draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define SENT1SYNC SENT1SYNC
extern volatile uint16_t  SENT1SYNC __attribute__((__sfr__));
#define SENT1DATL SENT1DATL
extern volatile uint16_t  SENT1DATL __attribute__((__sfr__));
__extension__ typedef struct tagSENT1DATLBITS {
  union {
    struct {
      uint16_t CRC:4;
      uint16_t DATA6:4;
      uint16_t DATA5:4;
      uint16_t DATA4:4;
    };
    struct {
      uint16_t CRC0:1;
      uint16_t CRC1:1;
      uint16_t CRC2:1;
      uint16_t CRC3:1;
      uint16_t DATA60:1;
      uint16_t DATA61:1;
      uint16_t DATA62:1;
      uint16_t DATA63:1;
      uint16_t DATA50:1;
      uint16_t DATA51:1;
      uint16_t DATA52:1;
      uint16_t DATA53:1;
      uint16_t DATA40:1;
      uint16_t DATA41:1;
      uint16_t DATA42:1;
      uint16_t DATA43:1;
    };
  };
} SENT1DATLBITS;
extern volatile SENT1DATLBITS SENT1DATLbits __attribute__((__sfr__));

#define SENT1DATH SENT1DATH
extern volatile uint16_t  SENT1DATH __attribute__((__sfr__));
__extension__ typedef struct tagSENT1DATHBITS {
  union {
    struct {
      uint16_t DATA3:4;
      uint16_t DATA2:4;
      uint16_t DATA1:4;
      uint16_t STAT:4;
    };
    struct {
      uint16_t DATA30:1;
      uint16_t DATA31:1;
      uint16_t DATA32:1;
      uint16_t DATA33:1;
      uint16_t DATA20:1;
      uint16_t DATA21:1;
      uint16_t DATA22:1;
      uint16_t DATA23:1;
      uint16_t DATA10:1;
      uint16_t DATA11:1;
      uint16_t DATA12:1;
      uint16_t DATA13:1;
      uint16_t STAT0:1;
      uint16_t STAT1:1;
      uint16_t STAT2:1;
      uint16_t STAT3:1;
    };
  };
} SENT1DATHBITS;
extern volatile SENT1DATHBITS SENT1DATHbits __attribute__((__sfr__));

#define SENT2CON1 SENT2CON1
extern volatile uint16_t  SENT2CON1 __attribute__((__sfr__));
typedef struct tagSENT2CON1BITS {
  uint16_t NIBCNT:3;
  uint16_t :1;
  uint16_t PS:1;
  uint16_t :1;
  uint16_t SPCEN:1;
  uint16_t PPP:1;
  uint16_t CRCEN:1;
  uint16_t TXPOL:1;
  uint16_t TXM:1;
  uint16_t RCVEN:1;
  uint16_t :1;
  uint16_t SNTSIDL:1;
  uint16_t :1;
  uint16_t SNTEN:1;
} SENT2CON1BITS;
extern volatile SENT2CON1BITS SENT2CON1bits __attribute__((__sfr__));

#define SENT2CON2 SENT2CON2
extern volatile uint16_t  SENT2CON2 __attribute__((__sfr__));
#define SENT2CON3 SENT2CON3
extern volatile uint16_t  SENT2CON3 __attribute__((__sfr__));
#define SENT2STAT SENT2STAT
extern volatile uint16_t  SENT2STAT __attribute__((__sfr__));
__extension__ typedef struct tagSENT2STATBITS {
  union {
    struct {
      uint16_t SYNCTXEN:1;
      uint16_t RXIDLE:1;
      uint16_t FRMERR:1;
      uint16_t CRCERR:1;
      uint16_t NIB:3;
      uint16_t PAUSE:1;
    };
    struct {
      uint16_t SYNC:1;
      uint16_t :3;
      uint16_t NIB0:1;
      uint16_t NIB1:1;
      uint16_t NIB2:1;
    };
    struct {
      uint16_t TXEN:1;
    };
  };
} SENT2STATBITS;
extern volatile SENT2STATBITS SENT2STATbits __attribute__((__sfr__));

#define SENT2SYNC SENT2SYNC
extern volatile uint16_t  SENT2SYNC __attribute__((__sfr__));
#define SENT2DATL SENT2DATL
extern volatile uint16_t  SENT2DATL __attribute__((__sfr__));
__extension__ typedef struct tagSENT2DATLBITS {
  union {
    struct {
      uint16_t CRC:4;
      uint16_t DATA6:4;
      uint16_t DATA5:4;
      uint16_t DATA4:4;
    };
    struct {
      uint16_t CRC0:1;
      uint16_t CRC1:1;
      uint16_t CRC2:1;
      uint16_t CRC3:1;
      uint16_t DATA60:1;
      uint16_t DATA61:1;
      uint16_t DATA62:1;
      uint16_t DATA63:1;
      uint16_t DATA50:1;
      uint16_t DATA51:1;
      uint16_t DATA52:1;
      uint16_t DATA53:1;
      uint16_t DATA40:1;
      uint16_t DATA41:1;
      uint16_t DATA42:1;
      uint16_t DATA43:1;
    };
  };
} SENT2DATLBITS;
extern volatile SENT2DATLBITS SENT2DATLbits __attribute__((__sfr__));

#define SENT2DATH SENT2DATH
extern volatile uint16_t  SENT2DATH __attribute__((__sfr__));
__extension__ typedef struct tagSENT2DATHBITS {
  union {
    struct {
      uint16_t DATA3:4;
      uint16_t DATA2:4;
      uint16_t DATA1:4;
      uint16_t STAT:4;
    };
    struct {
      uint16_t DATA30:1;
      uint16_t DATA31:1;
      uint16_t DATA32:1;
      uint16_t DATA33:1;
      uint16_t DATA20:1;
      uint16_t DATA21:1;
      uint16_t DATA22:1;
      uint16_t DATA23:1;
      uint16_t DATA10:1;
      uint16_t DATA11:1;
      uint16_t DATA12:1;
      uint16_t DATA13:1;
      uint16_t STAT0:1;
      uint16_t STAT1:1;
      uint16_t STAT2:1;
      uint16_t STAT3:1;
    };
  };
} SENT2DATHBITS;
extern volatile SENT2DATHBITS SENT2DATHbits __attribute__((__sfr__));

#define CRCCON1 CRCCON1
extern volatile uint16_t  CRCCON1 __attribute__((__sfr__));
typedef struct tagCRCCON1BITS {
  uint16_t :2;
  uint16_t MOD:1;
  uint16_t LENDIAN:1;
  uint16_t CRCGO:1;
  uint16_t CRCISEL:1;
  uint16_t CRCMPT:1;
  uint16_t CRCFUL:1;
  uint16_t VWORD:5;
  uint16_t CSIDL:1;
  uint16_t :1;
  uint16_t CRCEN:1;
} CRCCON1BITS;
extern volatile CRCCON1BITS CRCCON1bits __attribute__((__sfr__));

#define CRCCONL CRCCONL
extern volatile uint16_t  CRCCONL __attribute__((__sfr__));
typedef struct tagCRCCONLBITS {
  uint16_t :2;
  uint16_t MOD:1;
  uint16_t LENDIAN:1;
  uint16_t CRCGO:1;
  uint16_t CRCISEL:1;
  uint16_t CRCMPT:1;
  uint16_t CRCFUL:1;
  uint16_t VWORD:5;
  uint16_t CSIDL:1;
  uint16_t :1;
  uint16_t CRCEN:1;
} CRCCONLBITS;
extern volatile CRCCONLBITS CRCCONLbits __attribute__((__sfr__));

#define CRCCON2 CRCCON2
extern volatile uint16_t  CRCCON2 __attribute__((__sfr__));
typedef struct tagCRCCON2BITS {
  uint16_t PLEN:5;
  uint16_t :3;
  uint16_t DWIDTH:5;
} CRCCON2BITS;
extern volatile CRCCON2BITS CRCCON2bits __attribute__((__sfr__));

#define CRCCONH CRCCONH
extern volatile uint16_t  CRCCONH __attribute__((__sfr__));
typedef struct tagCRCCONHBITS {
  uint16_t PLEN:5;
  uint16_t :3;
  uint16_t DWIDTH:5;
} CRCCONHBITS;
extern volatile CRCCONHBITS CRCCONHbits __attribute__((__sfr__));

#define CRCXORL CRCXORL
extern volatile uint16_t  CRCXORL __attribute__((__sfr__));
typedef struct tagCRCXORLBITS {
  uint16_t :1;
  uint16_t X1:1;
  uint16_t X2:1;
  uint16_t X3:1;
  uint16_t X4:1;
  uint16_t X5:1;
  uint16_t X6:1;
  uint16_t X7:1;
  uint16_t X8:1;
  uint16_t X9:1;
  uint16_t X10:1;
  uint16_t X11:1;
  uint16_t X12:1;
  uint16_t X13:1;
  uint16_t X14:1;
  uint16_t X15:1;
} CRCXORLBITS;
