draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile ECCCONHBITS ECCCONHbits __attribute__((__sfr__));

#define ECCADDRL ECCADDRL
extern volatile uint16_t  ECCADDRL __attribute__((__sfr__));
#define ECCADDRH ECCADDRH
extern volatile uint16_t  ECCADDRH __attribute__((__sfr__));
#define ECCSTATL ECCSTATL
extern volatile uint16_t  ECCSTATL __attribute__((__sfr__));
typedef struct tagECCSTATLBITS {
  uint16_t SECIN:8;
  uint16_t SECOUT:8;
} ECCSTATLBITS;
extern volatile ECCSTATLBITS ECCSTATLbits __attribute__((__sfr__));

#define ECCSTATH ECCSTATH
extern volatile uint16_t  ECCSTATH __attribute__((__sfr__));
typedef struct tagECCSTATHBITS {
  uint16_t SYND:8;
  uint16_t DEDIN:1;
  uint16_t DEDOUT:1;
} ECCSTATHBITS;
extern volatile ECCSTATHBITS ECCSTATHbits __attribute__((__sfr__));

#define T1CON T1CON
extern volatile uint16_t  T1CON __attribute__((__sfr__));
typedef struct tagT1CONBITS {
  uint16_t :1;
  uint16_t TCS:1;
  uint16_t TSYNC:1;
  uint16_t :1;
  uint16_t TCKPS:2;
  uint16_t :1;
  uint16_t TGATE:1;
  uint16_t TECS:2;
  uint16_t PRWIP:1;
  uint16_t TMWIP:1;
  uint16_t TMWDIS:1;
  uint16_t TSIDL:1;
  uint16_t :1;
  uint16_t TON:1;
} T1CONBITS;
extern volatile T1CONBITS T1CONbits __attribute__((__sfr__));

#define TMR1 TMR1
extern volatile uint16_t  TMR1 __attribute__((__sfr__));
#define PR1 PR1
extern volatile uint16_t  PR1 __attribute__((__sfr__));
#define QEI1CON QEI1CON
extern volatile uint16_t  QEI1CON __attribute__((__sfr__));
typedef struct tagQEI1CONBITS {
  uint16_t CCM:2;
  uint16_t GATEN:1;
  uint16_t CNTPOL:1;
  uint16_t INTDIV:3;
  uint16_t :1;
  uint16_t IMV:2;
  uint16_t PIMOD:3;
  uint16_t QEISIDL:1;
  uint16_t :1;
  uint16_t QEIEN:1;
} QEI1CONBITS;
extern volatile QEI1CONBITS QEI1CONbits __attribute__((__sfr__));

#define QEI1IOC QEI1IOC
extern volatile uint16_t  QEI1IOC __attribute__((__sfr__));
typedef struct tagQEI1IOCBITS {
  uint16_t QEA:1;
  uint16_t QEB:1;
  uint16_t INDEX:1;
  uint16_t HOME:1;
  uint16_t QEAPOL:1;
  uint16_t QEBPOL:1;
  uint16_t IDXPOL:1;
  uint16_t HOMPOL:1;
  uint16_t SWPAB:1;
  uint16_t OUTFNC:2;
  uint16_t QFDIV:3;
  uint16_t FLTREN:1;
  uint16_t QCAPEN:1;
} QEI1IOCBITS;
extern volatile QEI1IOCBITS QEI1IOCbits __attribute__((__sfr__));

#define QEI1IOCH QEI1IOCH
extern volatile uint16_t  QEI1IOCH __attribute__((__sfr__));
typedef struct tagQEI1IOCHBITS {
  uint16_t HCAPEN:1;
} QEI1IOCHBITS;
extern volatile QEI1IOCHBITS QEI1IOCHbits __attribute__((__sfr__));

#define QEI1STAT QEI1STAT
extern volatile uint16_t  QEI1STAT __attribute__((__sfr__));
typedef struct tagQEI1STATBITS {
  uint16_t IDXIEN:1;
  uint16_t IDXIRQ:1;
  uint16_t HOMIEN:1;
  uint16_t HOMIRQ:1;
  uint16_t VELOVIEN:1;
  uint16_t VELOVIRQ:1;
  uint16_t PCIIEN:1;
  uint16_t PCIIRQ:1;
  uint16_t POSOVIEN:1;
  uint16_t POSOVIRQ:1;
  uint16_t PCLEQIEN:1;
  uint16_t PCLEQIRQ:1;
  uint16_t PCHEQIEN:1;
  uint16_t PCHEQIRQ:1;
} QEI1STATBITS;
extern volatile QEI1STATBITS QEI1STATbits __attribute__((__sfr__));

#define POS1CNTL POS1CNTL
extern volatile uint16_t  POS1CNTL __attribute__((__sfr__));
#define POS1CNTH POS1CNTH
extern volatile uint16_t  POS1CNTH __attribute__((__sfr__));
#define POS1HLD POS1HLD
extern volatile uint16_t  POS1HLD __attribute__((__sfr__));
#define VEL1CNT VEL1CNT
extern volatile uint16_t  VEL1CNT __attribute__((__sfr__));
#define VEL1CNTH VEL1CNTH
extern volatile uint16_t  VEL1CNTH __attribute__((__sfr__));
#define VEL1HLD VEL1HLD
extern volatile uint16_t  VEL1HLD __attribute__((__sfr__));
#define INT1TMRL INT1TMRL
extern volatile uint16_t  INT1TMRL __attribute__((__sfr__));
#define INT1TMRH INT1TMRH
extern volatile uint16_t  INT1TMRH __attribute__((__sfr__));
#define INT1HLDL INT1HLDL
extern volatile uint16_t  INT1HLDL __attribute__((__sfr__));
#define INT1HLDH INT1HLDH
extern volatile uint16_t  INT1HLDH __attribute__((__sfr__));
#define INDX1CNTL INDX1CNTL
extern volatile uint16_t  INDX1CNTL __attribute__((__sfr__));
#define INDX1CNTH INDX1CNTH
extern volatile uint16_t  INDX1CNTH __attribute__((__sfr__));
#define INDX1HLD INDX1HLD
extern volatile uint16_t  INDX1HLD __attribute__((__sfr__));
#define QEI1GECL QEI1GECL
extern volatile uint16_t  QEI1GECL __attribute__((__sfr__));
#define QEI1ICL QEI1ICL
extern volatile uint16_t  QEI1ICL __attribute__((__sfr__));
#define QEI1GECH QEI1GECH
extern volatile uint16_t  QEI1GECH __attribute__((__sfr__));
#define QEI1ICH QEI1ICH
extern volatile uint16_t  QEI1ICH __attribute__((__sfr__));
#define QEI1LECL QEI1LECL
extern volatile uint16_t  QEI1LECL __attribute__((__sfr__));
#define QEI1LECH QEI1LECH
extern volatile uint16_t  QEI1LECH __attribute__((__sfr__));
#define QEI2CON QEI2CON
extern volatile uint16_t  QEI2CON __attribute__((__sfr__));
typedef struct tagQEI2CONBITS {
  uint16_t CCM:2;
  uint16_t GATEN:1;
  uint16_t CNTPOL:1;
  uint16_t INTDIV:3;
  uint16_t :1;
  uint16_t IMV:2;
  uint16_t PIMOD:3;
  uint16_t QEISIDL:1;
  uint16_t :1;
  uint16_t QEIEN:1;
} QEI2CONBITS;
extern volatile QEI2CONBITS QEI2CONbits __attribute__((__sfr__));

#define QEI2IOC QEI2IOC
extern volatile uint16_t  QEI2IOC __attribute__((__sfr__));
typedef struct tagQEI2IOCBITS {
  uint16_t QEA:1;
  uint16_t QEB:1;
  uint16_t INDEX:1;
  uint16_t HOME:1;
  uint16_t QEAPOL:1;
  uint16_t QEBPOL:1;
  uint16_t IDXPOL:1;
  uint16_t HOMPOL:1;
  uint16_t SWPAB:1;
  uint16_t OUTFNC:2;
  uint16_t QFDIV:3;
  uint16_t FLTREN:1;
  uint16_t QCAPEN:1;
} QEI2IOCBITS;
extern volatile QEI2IOCBITS QEI2IOCbits __attribute__((__sfr__));

#define QEI2IOCH QEI2IOCH
extern volatile uint16_t  QEI2IOCH __attribute__((__sfr__));
typedef struct tagQEI2IOCHBITS {
  uint16_t HCAPEN:1;
} QEI2IOCHBITS;
extern volatile QEI2IOCHBITS QEI2IOCHbits __attribute__((__sfr__));

#define QEI2STAT QEI2STAT
extern volatile uint16_t  QEI2STAT __attribute__((__sfr__));
typedef struct tagQEI2STATBITS {
  uint16_t IDXIEN:1;
  uint16_t IDXIRQ:1;
  uint16_t HOMIEN:1;
  uint16_t HOMIRQ:1;
  uint16_t VELOVIEN:1;
  uint16_t VELOVIRQ:1;
  uint16_t PCIIEN:1;
  uint16_t PCIIRQ:1;
  uint16_t POSOVIEN:1;
  uint16_t POSOVIRQ:1;
  uint16_t PCLEQIEN:1;
  uint16_t PCLEQIRQ:1;
  uint16_t PCHEQIEN:1;
  uint16_t PCHEQIRQ:1;
} QEI2STATBITS;
