draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile QEI2STATBITS QEI2STATbits __attribute__((__sfr__));

#define POS2CNTL POS2CNTL
extern volatile uint16_t  POS2CNTL __attribute__((__sfr__));
#define POS2CNTH POS2CNTH
extern volatile uint16_t  POS2CNTH __attribute__((__sfr__));
#define POS2HLD POS2HLD
extern volatile uint16_t  POS2HLD __attribute__((__sfr__));
#define VEL2CNT VEL2CNT
extern volatile uint16_t  VEL2CNT __attribute__((__sfr__));
#define VEL2CNTH VEL2CNTH
extern volatile uint16_t  VEL2CNTH __attribute__((__sfr__));
#define VEL2HLD VEL2HLD
extern volatile uint16_t  VEL2HLD __attribute__((__sfr__));
#define INT2TMRL INT2TMRL
extern volatile uint16_t  INT2TMRL __attribute__((__sfr__));
#define INT2TMRH INT2TMRH
extern volatile uint16_t  INT2TMRH __attribute__((__sfr__));
#define INT2HLDL INT2HLDL
extern volatile uint16_t  INT2HLDL __attribute__((__sfr__));
#define INT2HLDH INT2HLDH
extern volatile uint16_t  INT2HLDH __attribute__((__sfr__));
#define INDX2CNTL INDX2CNTL
extern volatile uint16_t  INDX2CNTL __attribute__((__sfr__));
#define INDX2CNTH INDX2CNTH
extern volatile uint16_t  INDX2CNTH __attribute__((__sfr__));
#define INDX2HLD INDX2HLD
extern volatile uint16_t  INDX2HLD __attribute__((__sfr__));
#define QEI2GECL QEI2GECL
extern volatile uint16_t  QEI2GECL __attribute__((__sfr__));
#define QEI2ICL QEI2ICL
extern volatile uint16_t  QEI2ICL __attribute__((__sfr__));
#define QEI2GECH QEI2GECH
extern volatile uint16_t  QEI2GECH __attribute__((__sfr__));
#define QEI2ICH QEI2ICH
extern volatile uint16_t  QEI2ICH __attribute__((__sfr__));
#define QEI2LECL QEI2LECL
extern volatile uint16_t  QEI2LECL __attribute__((__sfr__));
#define QEI2LECH QEI2LECH
extern volatile uint16_t  QEI2LECH __attribute__((__sfr__));
#define PMCON PMCON
extern volatile uint16_t  PMCON __attribute__((__sfr__));
__extension__ typedef struct tagPMCONBITS {
  union {
    struct {
      uint16_t RDSP:1;
      uint16_t WRSP:1;
      uint16_t :1;
      uint16_t CS1P:1;
      uint16_t CS2P:1;
      uint16_t ALP:1;
      uint16_t CSF:2;
      uint16_t PTRDEN:1;
      uint16_t PTWREN:1;
      uint16_t PMPTTL:1;
      uint16_t ADRMUX:2;
      uint16_t SIDL:1;
      uint16_t :1;
      uint16_t ON:1;
    };
    struct {
      uint16_t :6;
      uint16_t CSF0:1;
      uint16_t CSF1:1;
      uint16_t :3;
      uint16_t ADRMUX0:1;
      uint16_t ADRMUX1:1;
    };
    struct {
      uint16_t :13;
      uint16_t PSIDL:1;
      uint16_t :1;
      uint16_t PMPEN:1;
    };
  };
} PMCONBITS;
extern volatile PMCONBITS PMCONbits __attribute__((__sfr__));

#define PMCONH PMCONH
extern volatile uint16_t  PMCONH __attribute__((__sfr__));
typedef struct tagPMCONHBITS {
  uint16_t :1;
  uint16_t DUALBUF:1;
  uint16_t :5;
  uint16_t RDSTART:1;
} PMCONHBITS;
extern volatile PMCONHBITS PMCONHbits __attribute__((__sfr__));

#define PMMODE PMMODE
extern volatile uint16_t  PMMODE __attribute__((__sfr__));
__extension__ typedef struct tagPMMODEBITS {
  union {
    struct {
      uint16_t WAITE:2;
      uint16_t WAITM:4;
      uint16_t WAITB:2;
      uint16_t MODE:2;
      uint16_t MODE16:1;
      uint16_t INCM:2;
      uint16_t IRQM:2;
      uint16_t BUSY:1;
    };
    struct {
      uint16_t WAITE0:1;
      uint16_t WAITE1:1;
      uint16_t WAITM0:1;
      uint16_t WAITM1:1;
      uint16_t WAITM2:1;
      uint16_t WAITM3:1;
      uint16_t WAITB0:1;
      uint16_t WAITB1:1;
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :1;
      uint16_t INCM0:1;
      uint16_t INCM1:1;
      uint16_t IRQM0:1;
      uint16_t IRQM1:1;
    };
  };
} PMMODEBITS;
extern volatile PMMODEBITS PMMODEbits __attribute__((__sfr__));

#define PMADDR PMADDR
extern volatile uint16_t  PMADDR __attribute__((__sfr__));
__extension__ typedef struct tagPMADDRBITS {
  union {
    struct {
      uint16_t ADDR:14;
      uint16_t ADDR14:1;
      uint16_t ADDR15:1;
    };
    struct {
      uint16_t :14;
      uint16_t CS:2;
    };
    struct {
      uint16_t :14;
      uint16_t CS1:1;
      uint16_t CS2:1;
    };
  };
} PMADDRBITS;
extern volatile PMADDRBITS PMADDRbits __attribute__((__sfr__));

#define PMDOUT1 PMDOUT1
extern volatile uint16_t  PMDOUT1 __attribute__((__sfr__));
#define PMDOUT2 PMDOUT2
extern volatile uint16_t  PMDOUT2 __attribute__((__sfr__));
#define PMDIN1 PMDIN1
extern volatile uint16_t  PMDIN1 __attribute__((__sfr__));
#define PMDIN2 PMDIN2
extern volatile uint16_t  PMDIN2 __attribute__((__sfr__));
#define PMAEN PMAEN
extern volatile uint16_t  PMAEN __attribute__((__sfr__));
__extension__ typedef struct tagPMAENBITS {
  union {
    struct {
      uint16_t PTEN0:1;
      uint16_t PTEN1:1;
      uint16_t PTEN2:1;
      uint16_t PTEN3:1;
      uint16_t PTEN4:1;
      uint16_t PTEN5:1;
      uint16_t PTEN6:1;
      uint16_t PTEN7:1;
      uint16_t PTEN8:1;
      uint16_t PTEN9:1;
      uint16_t PTEN10:1;
      uint16_t PTEN11:1;
      uint16_t PTEN12:1;
      uint16_t PTEN13:1;
      uint16_t PTEN14:1;
      uint16_t PTEN15:1;
    };
    struct {
      uint16_t PTEN:16;
    };
  };
} PMAENBITS;
extern volatile PMAENBITS PMAENbits __attribute__((__sfr__));

#define PMSTAT PMSTAT
extern volatile uint16_t  PMSTAT __attribute__((__sfr__));
typedef struct tagPMSTATBITS {
  uint16_t OB0E:1;
  uint16_t OB1E:1;
  uint16_t OB2E:1;
  uint16_t OB3E:1;
  uint16_t :2;
  uint16_t OBUF:1;
  uint16_t OBE:1;
  uint16_t IB0F:1;
  uint16_t IB1F:1;
  uint16_t IB2F:1;
  uint16_t IB3F:1;
  uint16_t :2;
  uint16_t IBOV:1;
  uint16_t IBF:1;
} PMSTATBITS;
extern volatile PMSTATBITS PMSTATbits __attribute__((__sfr__));

#define PMWADDR PMWADDR
extern volatile uint16_t  PMWADDR __attribute__((__sfr__));
__extension__ typedef struct tagPMWADDRBITS {
  union {
    struct {
      uint16_t WADDR:14;
      uint16_t WADDR14:1;
      uint16_t WADDR15:1;
    };
    struct {
      uint16_t :14;
      uint16_t WCS:2;
    };
    struct {
      uint16_t :14;
      uint16_t WCS1:1;
      uint16_t WCS2:1;
    };
  };
} PMWADDRBITS;
extern volatile PMWADDRBITS PMWADDRbits __attribute__((__sfr__));

#define PMRADDR PMRADDR
extern volatile uint16_t  PMRADDR __attribute__((__sfr__));
__extension__ typedef struct tagPMRADDRBITS {
  union {
    struct {
      uint16_t RADDR:14;
      uint16_t RADDR14:1;
      uint16_t RADDR15:1;
    };
    struct {
      uint16_t :14;
      uint16_t RCS:2;
    };
    struct {
      uint16_t :14;
      uint16_t RCS1:1;
      uint16_t RCS2:1;
    };
  };
} PMRADDRBITS;
extern volatile PMRADDRBITS PMRADDRbits __attribute__((__sfr__));

#define PMRDIN PMRDIN
extern volatile uint16_t  PMRDIN __attribute__((__sfr__));
#define I2C1CON1 I2C1CON1
extern volatile uint16_t  I2C1CON1 __attribute__((__sfr__));
typedef struct tagI2C1CON1BITS {
  uint16_t SEN:1;
  uint16_t RSEN:1;
  uint16_t PEN:1;
  uint16_t RCEN:1;
  uint16_t ACKEN:1;
  uint16_t ACKDT:1;
  uint16_t STREN:1;
  uint16_t GCEN:1;
  uint16_t SMEN:1;
  uint16_t DISSLW:1;
  uint16_t A10M:1;
  uint16_t STRICT:1;
  uint16_t SCLREL:1;
  uint16_t I2CSIDL:1;
  uint16_t :1;
  uint16_t I2CEN:1;
} I2C1CON1BITS;
extern volatile I2C1CON1BITS I2C1CON1bits __attribute__((__sfr__));

#define I2C1CONL I2C1CONL
extern volatile uint16_t  I2C1CONL __attribute__((__sfr__));
typedef struct tagI2C1CONLBITS {
  uint16_t SEN:1;
  uint16_t RSEN:1;
  uint16_t PEN:1;
  uint16_t RCEN:1;
  uint16_t ACKEN:1;
  uint16_t ACKDT:1;
  uint16_t STREN:1;
  uint16_t GCEN:1;
  uint16_t SMEN:1;
  uint16_t DISSLW:1;
  uint16_t A10M:1;
  uint16_t STRICT:1;
  uint16_t SCLREL:1;
  uint16_t I2CSIDL:1;
  uint16_t :1;
  uint16_t I2CEN:1;
} I2C1CONLBITS;
extern volatile I2C1CONLBITS I2C1CONLbits __attribute__((__sfr__));

#define I2C1CON2 I2C1CON2
extern volatile uint16_t  I2C1CON2 __attribute__((__sfr__));
typedef struct tagI2C1CON2BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
} I2C1CON2BITS;
