draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define FSCL FSCL
extern volatile uint16_t  FSCL __attribute__((__sfr__));
#define FSMINPER FSMINPER
extern volatile uint16_t  FSMINPER __attribute__((__sfr__));
#define MPHASE MPHASE
extern volatile uint16_t  MPHASE __attribute__((__sfr__));
#define MDC MDC
extern volatile uint16_t  MDC __attribute__((__sfr__));
#define MPER MPER
extern volatile uint16_t  MPER __attribute__((__sfr__));
#define LFSR LFSR
extern volatile uint16_t  LFSR __attribute__((__sfr__));
typedef struct tagLFSRBITS {
  uint16_t LFSR:15;
} LFSRBITS;
extern volatile LFSRBITS LFSRbits __attribute__((__sfr__));

#define CMBTRIGL CMBTRIGL
extern volatile uint16_t  CMBTRIGL __attribute__((__sfr__));
typedef struct tagCMBTRIGLBITS {
  uint16_t CTA1EN:1;
  uint16_t CTA2EN:1;
  uint16_t CTA3EN:1;
  uint16_t CTA4EN:1;
  uint16_t CTA5EN:1;
  uint16_t CTA6EN:1;
  uint16_t CTA7EN:1;
  uint16_t CTA8EN:1;
} CMBTRIGLBITS;
extern volatile CMBTRIGLBITS CMBTRIGLbits __attribute__((__sfr__));

#define CMBTRIGH CMBTRIGH
extern volatile uint16_t  CMBTRIGH __attribute__((__sfr__));
typedef struct tagCMBTRIGHBITS {
  uint16_t CTB1EN:1;
  uint16_t CTB2EN:1;
  uint16_t CTB3EN:1;
  uint16_t CTB4EN:1;
  uint16_t CTB5EN:1;
  uint16_t CTB6EN:1;
  uint16_t CTB7EN:1;
  uint16_t CTB8EN:1;
} CMBTRIGHBITS;
extern volatile CMBTRIGHBITS CMBTRIGHbits __attribute__((__sfr__));

#define LOGCONA LOGCONA
extern volatile uint16_t  LOGCONA __attribute__((__sfr__));
typedef struct tagLOGCONABITS {
  uint16_t PWMLFAD:3;
  uint16_t :1;
  uint16_t PWMLFA:2;
  uint16_t S2APOL:1;
  uint16_t S1APOL:1;
  uint16_t PWMS2A:4;
  uint16_t PWMS1A:4;
} LOGCONABITS;
extern volatile LOGCONABITS LOGCONAbits __attribute__((__sfr__));

#define LOGCONB LOGCONB
extern volatile uint16_t  LOGCONB __attribute__((__sfr__));
typedef struct tagLOGCONBBITS {
  uint16_t PWMLFBD:3;
  uint16_t :1;
  uint16_t PWMLFB:2;
  uint16_t S2BPOL:1;
  uint16_t S1BPOL:1;
  uint16_t PWMS2B:4;
  uint16_t PWMS1B:4;
} LOGCONBBITS;
extern volatile LOGCONBBITS LOGCONBbits __attribute__((__sfr__));

#define LOGCONC LOGCONC
extern volatile uint16_t  LOGCONC __attribute__((__sfr__));
typedef struct tagLOGCONCBITS {
  uint16_t PWMLFCD:3;
  uint16_t :1;
  uint16_t PWMLFC:2;
  uint16_t S2CPOL:1;
  uint16_t S1CPOL:1;
  uint16_t PWMS2C:4;
  uint16_t PWMS1C:4;
} LOGCONCBITS;
extern volatile LOGCONCBITS LOGCONCbits __attribute__((__sfr__));

#define LOGCOND LOGCOND
extern volatile uint16_t  LOGCOND __attribute__((__sfr__));
typedef struct tagLOGCONDBITS {
  uint16_t PWMLFDD:3;
  uint16_t :1;
  uint16_t PWMLFD:2;
  uint16_t S2DPOL:1;
  uint16_t S1DPOL:1;
  uint16_t PWMS2D:4;
  uint16_t PWMS1D:4;
} LOGCONDBITS;
extern volatile LOGCONDBITS LOGCONDbits __attribute__((__sfr__));

#define LOGCONE LOGCONE
extern volatile uint16_t  LOGCONE __attribute__((__sfr__));
typedef struct tagLOGCONEBITS {
  uint16_t PWMLFED:3;
  uint16_t :1;
  uint16_t PWMLFE:2;
  uint16_t S2EPOL:1;
  uint16_t S1EPOL:1;
  uint16_t PWMS2E:4;
  uint16_t PWMS1E:4;
} LOGCONEBITS;
extern volatile LOGCONEBITS LOGCONEbits __attribute__((__sfr__));

#define LOGCONF LOGCONF
extern volatile uint16_t  LOGCONF __attribute__((__sfr__));
typedef struct tagLOGCONFBITS {
  uint16_t PWMLFFD:3;
  uint16_t :1;
  uint16_t PWMLFF:2;
  uint16_t S2FPOL:1;
  uint16_t S1FPOL:1;
  uint16_t PWMS2F:4;
  uint16_t PWMS1F:4;
} LOGCONFBITS;
extern volatile LOGCONFBITS LOGCONFbits __attribute__((__sfr__));

#define PWMEVTA PWMEVTA
extern volatile uint16_t  PWMEVTA __attribute__((__sfr__));
typedef struct tagPWMEVTABITS {
  uint16_t EVTAPGS:3;
  uint16_t :1;
  uint16_t EVTASEL:4;
  uint16_t :4;
  uint16_t EVTASYNC:1;
  uint16_t EVTASTRD:1;
  uint16_t EVTAPOL:1;
  uint16_t EVTAOEN:1;
} PWMEVTABITS;
extern volatile PWMEVTABITS PWMEVTAbits __attribute__((__sfr__));

#define PWMEVTB PWMEVTB
extern volatile uint16_t  PWMEVTB __attribute__((__sfr__));
typedef struct tagPWMEVTBBITS {
  uint16_t EVTBPGS:3;
  uint16_t :1;
  uint16_t EVTBSEL:4;
  uint16_t :4;
  uint16_t EVTBSYNC:1;
  uint16_t EVTBSTRD:1;
  uint16_t EVTBPOL:1;
  uint16_t EVTBOEN:1;
} PWMEVTBBITS;
extern volatile PWMEVTBBITS PWMEVTBbits __attribute__((__sfr__));

#define PWMEVTC PWMEVTC
extern volatile uint16_t  PWMEVTC __attribute__((__sfr__));
typedef struct tagPWMEVTCBITS {
  uint16_t EVTCPGS:3;
  uint16_t :1;
  uint16_t EVTCSEL:4;
  uint16_t :4;
  uint16_t EVTCSYNC:1;
  uint16_t EVTCSTRD:1;
  uint16_t EVTCPOL:1;
  uint16_t EVTCOEN:1;
} PWMEVTCBITS;
extern volatile PWMEVTCBITS PWMEVTCbits __attribute__((__sfr__));

#define PWMEVTD PWMEVTD
extern volatile uint16_t  PWMEVTD __attribute__((__sfr__));
typedef struct tagPWMEVTDBITS {
  uint16_t EVTDPGS:3;
  uint16_t :1;
  uint16_t EVTDSEL:4;
  uint16_t :4;
  uint16_t EVTDSYNC:1;
  uint16_t EVTDSTRD:1;
  uint16_t EVTDPOL:1;
  uint16_t EVTDOEN:1;
} PWMEVTDBITS;
extern volatile PWMEVTDBITS PWMEVTDbits __attribute__((__sfr__));

#define PWMEVTE PWMEVTE
extern volatile uint16_t  PWMEVTE __attribute__((__sfr__));
typedef struct tagPWMEVTEBITS {
  uint16_t EVTEPGS:3;
  uint16_t :1;
  uint16_t EVTESEL:4;
  uint16_t :4;
  uint16_t EVTESYNC:1;
  uint16_t EVTESTRD:1;
  uint16_t EVTEPOL:1;
  uint16_t EVTEOEN:1;
} PWMEVTEBITS;
extern volatile PWMEVTEBITS PWMEVTEbits __attribute__((__sfr__));

#define PWMEVTF PWMEVTF
extern volatile uint16_t  PWMEVTF __attribute__((__sfr__));
typedef struct tagPWMEVTFBITS {
  uint16_t EVTFPGS:3;
  uint16_t :1;
  uint16_t EVTFSEL:4;
  uint16_t :4;
  uint16_t EVTFSYNC:1;
  uint16_t EVTFSTRD:1;
  uint16_t EVTFPOL:1;
  uint16_t EVTFOEN:1;
} PWMEVTFBITS;
extern volatile PWMEVTFBITS PWMEVTFbits __attribute__((__sfr__));

#define PG1CONL PG1CONL
extern volatile uint16_t  PG1CONL __attribute__((__sfr__));
typedef struct tagPG1CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG1CONLBITS;
extern volatile PG1CONLBITS PG1CONLbits __attribute__((__sfr__));

#define PG1CONH PG1CONH
extern volatile uint16_t  PG1CONH __attribute__((__sfr__));
typedef struct tagPG1CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG1CONHBITS;
extern volatile PG1CONHBITS PG1CONHbits __attribute__((__sfr__));

#define PG1STAT PG1STAT
extern volatile uint16_t  PG1STAT __attribute__((__sfr__));
typedef struct tagPG1STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG1STATBITS;
