draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile PG1STATBITS PG1STATbits __attribute__((__sfr__));

#define PG1IOCONL PG1IOCONL
extern volatile uint16_t  PG1IOCONL __attribute__((__sfr__));
typedef struct tagPG1IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG1IOCONLBITS;
extern volatile PG1IOCONLBITS PG1IOCONLbits __attribute__((__sfr__));

#define PG1IOCONH PG1IOCONH
extern volatile uint16_t  PG1IOCONH __attribute__((__sfr__));
typedef struct tagPG1IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG1IOCONHBITS;
extern volatile PG1IOCONHBITS PG1IOCONHbits __attribute__((__sfr__));

#define PG1EVTL PG1EVTL
extern volatile uint16_t  PG1EVTL __attribute__((__sfr__));
typedef struct tagPG1EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG1EVTLBITS;
extern volatile PG1EVTLBITS PG1EVTLbits __attribute__((__sfr__));

#define PG1EVTH PG1EVTH
extern volatile uint16_t  PG1EVTH __attribute__((__sfr__));
typedef struct tagPG1EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG1EVTHBITS;
extern volatile PG1EVTHBITS PG1EVTHbits __attribute__((__sfr__));

#define PG1FPCIL PG1FPCIL
extern volatile uint16_t  PG1FPCIL __attribute__((__sfr__));
typedef struct tagPG1FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG1FPCILBITS;
extern volatile PG1FPCILBITS PG1FPCILbits __attribute__((__sfr__));

#define PG1FPCIH PG1FPCIH
extern volatile uint16_t  PG1FPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG1FPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG1FPCIHBITS;
extern volatile PG1FPCIHBITS PG1FPCIHbits __attribute__((__sfr__));

#define PG1CLPCIL PG1CLPCIL
extern volatile uint16_t  PG1CLPCIL __attribute__((__sfr__));
typedef struct tagPG1CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG1CLPCILBITS;
extern volatile PG1CLPCILBITS PG1CLPCILbits __attribute__((__sfr__));

#define PG1CLPCIH PG1CLPCIH
extern volatile uint16_t  PG1CLPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG1CLPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG1CLPCIHBITS;
extern volatile PG1CLPCIHBITS PG1CLPCIHbits __attribute__((__sfr__));

#define PG1FFPCIL PG1FFPCIL
extern volatile uint16_t  PG1FFPCIL __attribute__((__sfr__));
typedef struct tagPG1FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG1FFPCILBITS;
extern volatile PG1FFPCILBITS PG1FFPCILbits __attribute__((__sfr__));

#define PG1FFPCIH PG1FFPCIH
extern volatile uint16_t  PG1FFPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG1FFPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG1FFPCIHBITS;
extern volatile PG1FFPCIHBITS PG1FFPCIHbits __attribute__((__sfr__));

#define PG1SPCIL PG1SPCIL
extern volatile uint16_t  PG1SPCIL __attribute__((__sfr__));
typedef struct tagPG1SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG1SPCILBITS;
extern volatile PG1SPCILBITS PG1SPCILbits __attribute__((__sfr__));

#define PG1SPCIH PG1SPCIH
extern volatile uint16_t  PG1SPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG1SPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG1SPCIHBITS;
extern volatile PG1SPCIHBITS PG1SPCIHbits __attribute__((__sfr__));

#define PG1LEBL PG1LEBL
extern volatile uint16_t  PG1LEBL __attribute__((__sfr__));
#define PG1LEBH PG1LEBH
extern volatile uint16_t  PG1LEBH __attribute__((__sfr__));
typedef struct tagPG1LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG1LEBHBITS;
extern volatile PG1LEBHBITS PG1LEBHbits __attribute__((__sfr__));

#define PG1PHASE PG1PHASE
extern volatile uint16_t  PG1PHASE __attribute__((__sfr__));
#define PG1DC PG1DC
extern volatile uint16_t  PG1DC __attribute__((__sfr__));
#define PG1DCA PG1DCA
extern volatile uint16_t  PG1DCA __attribute__((__sfr__));
typedef struct tagPG1DCABITS {
  uint16_t DCA:8;
} PG1DCABITS;
extern volatile PG1DCABITS PG1DCAbits __attribute__((__sfr__));

#define PG1PER PG1PER
extern volatile uint16_t  PG1PER __attribute__((__sfr__));
#define PG1TRIGA PG1TRIGA
extern volatile uint16_t  PG1TRIGA __attribute__((__sfr__));
#define PG1TRIGB PG1TRIGB
extern volatile uint16_t  PG1TRIGB __attribute__((__sfr__));
#define PG1TRIGC PG1TRIGC
extern volatile uint16_t  PG1TRIGC __attribute__((__sfr__));
#define PG1DTL PG1DTL
extern volatile uint16_t  PG1DTL __attribute__((__sfr__));
typedef struct tagPG1DTLBITS {
  uint16_t DTL:14;
} PG1DTLBITS;
extern volatile PG1DTLBITS PG1DTLbits __attribute__((__sfr__));

#define PG1DTH PG1DTH
extern volatile uint16_t  PG1DTH __attribute__((__sfr__));
typedef struct tagPG1DTHBITS {
  uint16_t DTH:14;
} PG1DTHBITS;
extern volatile PG1DTHBITS PG1DTHbits __attribute__((__sfr__));

