draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile PG6IOCONLBITS PG6IOCONLbits __attribute__((__sfr__));

#define PG6IOCONH PG6IOCONH
extern volatile uint16_t  PG6IOCONH __attribute__((__sfr__));
typedef struct tagPG6IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG6IOCONHBITS;
extern volatile PG6IOCONHBITS PG6IOCONHbits __attribute__((__sfr__));

#define PG6EVTL PG6EVTL
extern volatile uint16_t  PG6EVTL __attribute__((__sfr__));
typedef struct tagPG6EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG6EVTLBITS;
extern volatile PG6EVTLBITS PG6EVTLbits __attribute__((__sfr__));

#define PG6EVTH PG6EVTH
extern volatile uint16_t  PG6EVTH __attribute__((__sfr__));
typedef struct tagPG6EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG6EVTHBITS;
extern volatile PG6EVTHBITS PG6EVTHbits __attribute__((__sfr__));

#define PG6FPCIL PG6FPCIL
extern volatile uint16_t  PG6FPCIL __attribute__((__sfr__));
typedef struct tagPG6FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG6FPCILBITS;
extern volatile PG6FPCILBITS PG6FPCILbits __attribute__((__sfr__));

#define PG6FPCIH PG6FPCIH
extern volatile uint16_t  PG6FPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG6FPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG6FPCIHBITS;
extern volatile PG6FPCIHBITS PG6FPCIHbits __attribute__((__sfr__));

#define PG6CLPCIL PG6CLPCIL
extern volatile uint16_t  PG6CLPCIL __attribute__((__sfr__));
typedef struct tagPG6CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG6CLPCILBITS;
extern volatile PG6CLPCILBITS PG6CLPCILbits __attribute__((__sfr__));

#define PG6CLPCIH PG6CLPCIH
extern volatile uint16_t  PG6CLPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG6CLPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG6CLPCIHBITS;
extern volatile PG6CLPCIHBITS PG6CLPCIHbits __attribute__((__sfr__));

#define PG6FFPCIL PG6FFPCIL
extern volatile uint16_t  PG6FFPCIL __attribute__((__sfr__));
typedef struct tagPG6FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG6FFPCILBITS;
extern volatile PG6FFPCILBITS PG6FFPCILbits __attribute__((__sfr__));

#define PG6FFPCIH PG6FFPCIH
extern volatile uint16_t  PG6FFPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG6FFPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG6FFPCIHBITS;
extern volatile PG6FFPCIHBITS PG6FFPCIHbits __attribute__((__sfr__));

#define PG6SPCIL PG6SPCIL
extern volatile uint16_t  PG6SPCIL __attribute__((__sfr__));
typedef struct tagPG6SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG6SPCILBITS;
extern volatile PG6SPCILBITS PG6SPCILbits __attribute__((__sfr__));

#define PG6SPCIH PG6SPCIH
extern volatile uint16_t  PG6SPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG6SPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG6SPCIHBITS;
extern volatile PG6SPCIHBITS PG6SPCIHbits __attribute__((__sfr__));

#define PG6LEBL PG6LEBL
extern volatile uint16_t  PG6LEBL __attribute__((__sfr__));
#define PG6LEBH PG6LEBH
extern volatile uint16_t  PG6LEBH __attribute__((__sfr__));
typedef struct tagPG6LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG6LEBHBITS;
extern volatile PG6LEBHBITS PG6LEBHbits __attribute__((__sfr__));

#define PG6PHASE PG6PHASE
extern volatile uint16_t  PG6PHASE __attribute__((__sfr__));
#define PG6DC PG6DC
extern volatile uint16_t  PG6DC __attribute__((__sfr__));
#define PG6DCA PG6DCA
extern volatile uint16_t  PG6DCA __attribute__((__sfr__));
typedef struct tagPG6DCABITS {
  uint16_t DCA:8;
} PG6DCABITS;
extern volatile PG6DCABITS PG6DCAbits __attribute__((__sfr__));

#define PG6PER PG6PER
extern volatile uint16_t  PG6PER __attribute__((__sfr__));
#define PG6TRIGA PG6TRIGA
extern volatile uint16_t  PG6TRIGA __attribute__((__sfr__));
#define PG6TRIGB PG6TRIGB
extern volatile uint16_t  PG6TRIGB __attribute__((__sfr__));
#define PG6TRIGC PG6TRIGC
extern volatile uint16_t  PG6TRIGC __attribute__((__sfr__));
#define PG6DTL PG6DTL
extern volatile uint16_t  PG6DTL __attribute__((__sfr__));
typedef struct tagPG6DTLBITS {
  uint16_t DTL:14;
} PG6DTLBITS;
extern volatile PG6DTLBITS PG6DTLbits __attribute__((__sfr__));

