draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define PG8SPCIL PG8SPCIL
extern volatile uint16_t  PG8SPCIL __attribute__((__sfr__));
typedef struct tagPG8SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG8SPCILBITS;
extern volatile PG8SPCILBITS PG8SPCILbits __attribute__((__sfr__));

#define PG8SPCIH PG8SPCIH
extern volatile uint16_t  PG8SPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG8SPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG8SPCIHBITS;
extern volatile PG8SPCIHBITS PG8SPCIHbits __attribute__((__sfr__));

#define PG8LEBL PG8LEBL
extern volatile uint16_t  PG8LEBL __attribute__((__sfr__));
#define PG8LEBH PG8LEBH
extern volatile uint16_t  PG8LEBH __attribute__((__sfr__));
typedef struct tagPG8LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG8LEBHBITS;
extern volatile PG8LEBHBITS PG8LEBHbits __attribute__((__sfr__));

#define PG8PHASE PG8PHASE
extern volatile uint16_t  PG8PHASE __attribute__((__sfr__));
#define PG8DC PG8DC
extern volatile uint16_t  PG8DC __attribute__((__sfr__));
#define PG8DCA PG8DCA
extern volatile uint16_t  PG8DCA __attribute__((__sfr__));
typedef struct tagPG8DCABITS {
  uint16_t DCA:8;
} PG8DCABITS;
extern volatile PG8DCABITS PG8DCAbits __attribute__((__sfr__));

#define PG8PER PG8PER
extern volatile uint16_t  PG8PER __attribute__((__sfr__));
#define PG8TRIGA PG8TRIGA
extern volatile uint16_t  PG8TRIGA __attribute__((__sfr__));
#define PG8TRIGB PG8TRIGB
extern volatile uint16_t  PG8TRIGB __attribute__((__sfr__));
#define PG8TRIGC PG8TRIGC
extern volatile uint16_t  PG8TRIGC __attribute__((__sfr__));
#define PG8DTL PG8DTL
extern volatile uint16_t  PG8DTL __attribute__((__sfr__));
typedef struct tagPG8DTLBITS {
  uint16_t DTL:14;
} PG8DTLBITS;
extern volatile PG8DTLBITS PG8DTLbits __attribute__((__sfr__));

#define PG8DTH PG8DTH
extern volatile uint16_t  PG8DTH __attribute__((__sfr__));
typedef struct tagPG8DTHBITS {
  uint16_t DTH:14;
} PG8DTHBITS;
extern volatile PG8DTHBITS PG8DTHbits __attribute__((__sfr__));

#define PG8CAP PG8CAP
extern volatile uint16_t  PG8CAP __attribute__((__sfr__));
#define IFS0 IFS0
extern volatile uint16_t  IFS0 __attribute__((__sfr__));
typedef struct tagIFS0BITS {
  uint16_t INT0IF:1;
  uint16_t T1IF:1;
  uint16_t CNAIF:1;
  uint16_t CNBIF:1;
  uint16_t DMA0IF:1;
  uint16_t :1;
  uint16_t CCP1IF:1;
  uint16_t CCT1IF:1;
  uint16_t DMA1IF:1;
  uint16_t SPI1RXIF:1;
  uint16_t SPI1TXIF:1;
  uint16_t U1RXIF:1;
  uint16_t U1TXIF:1;
  uint16_t ECCSBEIF:1;
  uint16_t NVMIF:1;
  uint16_t INT1IF:1;
} IFS0BITS;
extern volatile IFS0BITS IFS0bits __attribute__((__sfr__));

#define IFS1 IFS1
extern volatile uint16_t  IFS1 __attribute__((__sfr__));
typedef struct tagIFS1BITS {
  uint16_t SI2C1IF:1;
  uint16_t MI2C1IF:1;
  uint16_t DMA2IF:1;
  uint16_t CNCIF:1;
  uint16_t INT2IF:1;
  uint16_t DMA3IF:1;
  uint16_t :1;
  uint16_t CCP2IF:1;
  uint16_t CCT2IF:1;
  uint16_t :1;
  uint16_t INT3IF:1;
  uint16_t U2RXIF:1;
  uint16_t U2TXIF:1;
  uint16_t SPI2RXIF:1;
  uint16_t SPI2TXIF:1;
} IFS1BITS;
extern volatile IFS1BITS IFS1bits __attribute__((__sfr__));

#define IFS2 IFS2
extern volatile uint16_t  IFS2 __attribute__((__sfr__));
typedef struct tagIFS2BITS {
  uint16_t :3;
  uint16_t CCP3IF:1;
  uint16_t CCT3IF:1;
  uint16_t SI2C2IF:1;
  uint16_t MI2C2IF:1;
  uint16_t :1;
  uint16_t CCP4IF:1;
  uint16_t CCT4IF:1;
  uint16_t :1;
  uint16_t CCP5IF:1;
  uint16_t CCT5IF:1;
  uint16_t DMTIF:1;
  uint16_t CCP6IF:1;
  uint16_t CCT6IF:1;
} IFS2BITS;
extern volatile IFS2BITS IFS2bits __attribute__((__sfr__));

#define IFS3 IFS3
extern volatile uint16_t  IFS3 __attribute__((__sfr__));
typedef struct tagIFS3BITS {
  uint16_t QEI1IF:1;
  uint16_t U1EIF:1;
  uint16_t U2EIF:1;
  uint16_t CRCIF:1;
  uint16_t :2;
  uint16_t QEI2IF:1;
  uint16_t :1;
  uint16_t U3EIF:1;
  uint16_t U3RXIF:1;
  uint16_t U3TXIF:1;
  uint16_t SPI3RXIF:1;
  uint16_t SPI3TXIF:1;
  uint16_t :1;
  uint16_t JTAGIF:1;
  uint16_t PTGSTEPIF:1;
} IFS3BITS;
extern volatile IFS3BITS IFS3bits __attribute__((__sfr__));

#define IFS4 IFS4
extern volatile uint16_t  IFS4 __attribute__((__sfr__));
typedef struct tagIFS4BITS {
  uint16_t I2C1BCIF:1;
  uint16_t I2C2BCIF:1;
  uint16_t :1;
  uint16_t PWM1IF:1;
  uint16_t PWM2IF:1;
  uint16_t PWM3IF:1;
  uint16_t PWM4IF:1;
  uint16_t PWM5IF:1;
  uint16_t PWM6IF:1;
  uint16_t PWM7IF:1;
  uint16_t PWM8IF:1;
  uint16_t CNDIF:1;
  uint16_t :1;
  uint16_t CMP1IF:1;
  uint16_t CMP2IF:1;
  uint16_t CMP3IF:1;
} IFS4BITS;
extern volatile IFS4BITS IFS4bits __attribute__((__sfr__));

#define IFS5 IFS5
extern volatile uint16_t  IFS5 __attribute__((__sfr__));
typedef struct tagIFS5BITS {
  uint16_t :1;
  uint16_t PTGWDTIF:1;
  uint16_t PTG0IF:1;
  uint16_t PTG1IF:1;
  uint16_t PTG2IF:1;
  uint16_t PTG3IF:1;
  uint16_t SENT1IF:1;
  uint16_t SENT1EIF:1;
  uint16_t SENT2IF:1;
  uint16_t SENT2EIF:1;
  uint16_t ADCIF:1;
  uint16_t ADCAN0IF:1;
  uint16_t ADCAN1IF:1;
  uint16_t ADCAN2IF:1;
  uint16_t ADCAN3IF:1;
  uint16_t ADCAN4IF:1;
} IFS5BITS;
extern volatile IFS5BITS IFS5bits __attribute__((__sfr__));

#define IFS6 IFS6
extern volatile uint16_t  IFS6 __attribute__((__sfr__));
typedef struct tagIFS6BITS {
  uint16_t ADCAN5IF:1;
  uint16_t ADCAN6IF:1;
  uint16_t ADCAN7IF:1;
  uint16_t ADCAN8IF:1;
  uint16_t ADCAN9IF:1;
  uint16_t ADCAN10IF:1;
  uint16_t ADCAN11IF:1;
  uint16_t ADCAN12IF:1;
  uint16_t ADCAN13IF:1;
  uint16_t ADCAN14IF:1;
  uint16_t ADCAN15IF:1;
  uint16_t ADCAN16IF:1;
  uint16_t ADCAN17IF:1;
  uint16_t ADCAN18IF:1;
  uint16_t ADCAN19IF:1;
} IFS6BITS;
extern volatile IFS6BITS IFS6bits __attribute__((__sfr__));

#define IFS7 IFS7
extern volatile uint16_t  IFS7 __attribute__((__sfr__));
typedef struct tagIFS7BITS {
  uint16_t :3;
  uint16_t ADFLTIF:1;
  uint16_t ADCMP0IF:1;
  uint16_t ADCMP1IF:1;
  uint16_t ADCMP2IF:1;
  uint16_t ADCMP3IF:1;
  uint16_t ADFLTR0IF:1;
  uint16_t ADFLTR1IF:1;
  uint16_t ADFLTR2IF:1;
  uint16_t ADFLTR3IF:1;
  uint16_t CLC1PIF:1;
  uint16_t CLC2PIF:1;
  uint16_t SPI1IF:1;
  uint16_t SPI2IF:1;
} IFS7BITS;
