draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define IEC11 IEC11
extern volatile uint16_t  IEC11 __attribute__((__sfr__));
typedef struct tagIEC11BITS {
  uint16_t CLC4PIE:1;
  uint16_t CLC1NIE:1;
  uint16_t CLC2NIE:1;
  uint16_t CLC3NIE:1;
  uint16_t CLC4NIE:1;
  uint16_t CCP9IE:1;
  uint16_t CCT9IE:1;
  uint16_t :6;
  uint16_t U1EVTIE:1;
  uint16_t U2EVTIE:1;
  uint16_t U3EVTIE:1;
} IEC11BITS;
extern volatile IEC11BITS IEC11bits __attribute__((__sfr__));

#define IEC12 IEC12
extern volatile uint16_t  IEC12 __attribute__((__sfr__));
typedef struct tagIEC12BITS {
  uint16_t ADCAN24IE:1;
  uint16_t ADCAN25IE:1;
  uint16_t PMPIE:1;
  uint16_t PMPEIE:1;
} IEC12BITS;
extern volatile IEC12BITS IEC12bits __attribute__((__sfr__));

#define IPC0 IPC0
extern volatile uint16_t  IPC0 __attribute__((__sfr__));
typedef struct tagIPC0BITS {
  uint16_t INT0IP:3;
  uint16_t :1;
  uint16_t T1IP:3;
  uint16_t :1;
  uint16_t CNAIP:3;
  uint16_t :1;
  uint16_t CNBIP:3;
} IPC0BITS;
extern volatile IPC0BITS IPC0bits __attribute__((__sfr__));

#define IPC1 IPC1
extern volatile uint16_t  IPC1 __attribute__((__sfr__));
typedef struct tagIPC1BITS {
  uint16_t DMA0IP:3;
  uint16_t :5;
  uint16_t CCP1IP:3;
  uint16_t :1;
  uint16_t CCT1IP:3;
} IPC1BITS;
extern volatile IPC1BITS IPC1bits __attribute__((__sfr__));

#define IPC2 IPC2
extern volatile uint16_t  IPC2 __attribute__((__sfr__));
typedef struct tagIPC2BITS {
  uint16_t DMA1IP:3;
  uint16_t :1;
  uint16_t SPI1RXIP:3;
  uint16_t :1;
  uint16_t SPI1TXIP:3;
  uint16_t :1;
  uint16_t U1RXIP:3;
} IPC2BITS;
extern volatile IPC2BITS IPC2bits __attribute__((__sfr__));

#define IPC3 IPC3
extern volatile uint16_t  IPC3 __attribute__((__sfr__));
typedef struct tagIPC3BITS {
  uint16_t U1TXIP:3;
  uint16_t :1;
  uint16_t ECCSBEIP:3;
  uint16_t :1;
  uint16_t NVMIP:3;
  uint16_t :1;
  uint16_t INT1IP:3;
} IPC3BITS;
extern volatile IPC3BITS IPC3bits __attribute__((__sfr__));

#define IPC4 IPC4
extern volatile uint16_t  IPC4 __attribute__((__sfr__));
typedef struct tagIPC4BITS {
  uint16_t SI2C1IP:3;
  uint16_t :1;
  uint16_t MI2C1IP:3;
  uint16_t :1;
  uint16_t DMA2IP:3;
  uint16_t :1;
  uint16_t CNCIP:3;
} IPC4BITS;
extern volatile IPC4BITS IPC4bits __attribute__((__sfr__));

#define IPC5 IPC5
extern volatile uint16_t  IPC5 __attribute__((__sfr__));
typedef struct tagIPC5BITS {
  uint16_t INT2IP:3;
  uint16_t :1;
  uint16_t DMA3IP:3;
  uint16_t :5;
  uint16_t CCP2IP:3;
} IPC5BITS;
extern volatile IPC5BITS IPC5bits __attribute__((__sfr__));

#define IPC6 IPC6
extern volatile uint16_t  IPC6 __attribute__((__sfr__));
typedef struct tagIPC6BITS {
  uint16_t CCT2IP:3;
  uint16_t :5;
  uint16_t INT3IP:3;
  uint16_t :1;
  uint16_t U2RXIP:3;
} IPC6BITS;
extern volatile IPC6BITS IPC6bits __attribute__((__sfr__));

#define IPC7 IPC7
extern volatile uint16_t  IPC7 __attribute__((__sfr__));
typedef struct tagIPC7BITS {
  uint16_t U2TXIP:3;
  uint16_t :1;
  uint16_t SPI2RXIP:3;
  uint16_t :1;
  uint16_t SPI2TXIP:3;
} IPC7BITS;
extern volatile IPC7BITS IPC7bits __attribute__((__sfr__));

#define IPC8 IPC8
extern volatile uint16_t  IPC8 __attribute__((__sfr__));
typedef struct tagIPC8BITS {
  uint16_t :12;
  uint16_t CCP3IP:3;
} IPC8BITS;
extern volatile IPC8BITS IPC8bits __attribute__((__sfr__));

#define IPC9 IPC9
extern volatile uint16_t  IPC9 __attribute__((__sfr__));
typedef struct tagIPC9BITS {
  uint16_t CCT3IP:3;
  uint16_t :1;
  uint16_t SI2C2IP:3;
  uint16_t :1;
  uint16_t MI2C2IP:3;
} IPC9BITS;
extern volatile IPC9BITS IPC9bits __attribute__((__sfr__));

#define IPC10 IPC10
extern volatile uint16_t  IPC10 __attribute__((__sfr__));
typedef struct tagIPC10BITS {
  uint16_t CCP4IP:3;
  uint16_t :1;
  uint16_t CCT4IP:3;
  uint16_t :5;
  uint16_t CCP5IP:3;
} IPC10BITS;
extern volatile IPC10BITS IPC10bits __attribute__((__sfr__));

#define IPC11 IPC11
extern volatile uint16_t  IPC11 __attribute__((__sfr__));
typedef struct tagIPC11BITS {
  uint16_t CCT5IP:3;
  uint16_t :1;
  uint16_t DMTIP:3;
  uint16_t :1;
  uint16_t CCP6IP:3;
  uint16_t :1;
  uint16_t CCT6IP:3;
} IPC11BITS;
extern volatile IPC11BITS IPC11bits __attribute__((__sfr__));

#define IPC12 IPC12
extern volatile uint16_t  IPC12 __attribute__((__sfr__));
typedef struct tagIPC12BITS {
  uint16_t QEI1IP:3;
  uint16_t :1;
  uint16_t U1EIP:3;
  uint16_t :1;
  uint16_t U2EIP:3;
  uint16_t :1;
  uint16_t CRCIP:3;
} IPC12BITS;
extern volatile IPC12BITS IPC12bits __attribute__((__sfr__));

#define IPC13 IPC13
extern volatile uint16_t  IPC13 __attribute__((__sfr__));
typedef struct tagIPC13BITS {
  uint16_t :8;
  uint16_t QEI2IP:3;
} IPC13BITS;
extern volatile IPC13BITS IPC13bits __attribute__((__sfr__));

#define IPC14 IPC14
extern volatile uint16_t  IPC14 __attribute__((__sfr__));
typedef struct tagIPC14BITS {
  uint16_t U3EIP:3;
  uint16_t :1;
  uint16_t U3RXIP:3;
  uint16_t :1;
  uint16_t U3TXIP:3;
  uint16_t :1;
  uint16_t SPI3RXIP:3;
} IPC14BITS;
extern volatile IPC14BITS IPC14bits __attribute__((__sfr__));

#define IPC15 IPC15
extern volatile uint16_t  IPC15 __attribute__((__sfr__));
typedef struct tagIPC15BITS {
  uint16_t SPI3TXIP:3;
  uint16_t :1;
  uint16_t ICDIP:3;
  uint16_t :1;
  uint16_t JTAGIP:3;
  uint16_t :1;
  uint16_t PTGSTEPIP:3;
} IPC15BITS;
extern volatile IPC15BITS IPC15bits __attribute__((__sfr__));

#define IPC16 IPC16
extern volatile uint16_t  IPC16 __attribute__((__sfr__));
typedef struct tagIPC16BITS {
  uint16_t I2C1BCIP:3;
  uint16_t :1;
  uint16_t I2C2BCIP:3;
  uint16_t :5;
  uint16_t PWM1IP:3;
} IPC16BITS;
extern volatile IPC16BITS IPC16bits __attribute__((__sfr__));

#define IPC17 IPC17
extern volatile uint16_t  IPC17 __attribute__((__sfr__));
typedef struct tagIPC17BITS {
  uint16_t PWM2IP:3;
  uint16_t :1;
  uint16_t PWM3IP:3;
  uint16_t :1;
  uint16_t PWM4IP:3;
  uint16_t :1;
  uint16_t PWM5IP:3;
} IPC17BITS;
extern volatile IPC17BITS IPC17bits __attribute__((__sfr__));

#define IPC18 IPC18
extern volatile uint16_t  IPC18 __attribute__((__sfr__));
typedef struct tagIPC18BITS {
  uint16_t PWM6IP:3;
  uint16_t :1;
  uint16_t PWM7IP:3;
  uint16_t :1;
  uint16_t PWM8IP:3;
  uint16_t :1;
  uint16_t CNDIP:3;
} IPC18BITS;
extern volatile IPC18BITS IPC18bits __attribute__((__sfr__));

