draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define NVMSRCADRH NVMSRCADRH
extern volatile uint16_t  NVMSRCADRH __attribute__((__sfr__));
typedef struct tagNVMSRCADRHBITS {
  uint16_t NVMSRCADRH:8;
} NVMSRCADRHBITS;
extern volatile NVMSRCADRHBITS NVMSRCADRHbits __attribute__((__sfr__));

#define AMPCON1L AMPCON1L
extern volatile uint16_t  AMPCON1L __attribute__((__sfr__));
typedef struct tagAMPCON1LBITS {
  uint16_t AMPEN1:1;
  uint16_t AMPEN2:1;
  uint16_t AMPEN3:1;
  uint16_t :12;
  uint16_t AMPON:1;
} AMPCON1LBITS;
extern volatile AMPCON1LBITS AMPCON1Lbits __attribute__((__sfr__));

#define AMPCON1H AMPCON1H
extern volatile uint16_t  AMPCON1H __attribute__((__sfr__));
typedef struct tagAMPCON1HBITS {
  uint16_t NCHDIS1:1;
  uint16_t NCHDIS2:1;
  uint16_t NCHDIS3:1;
} AMPCON1HBITS;
extern volatile AMPCON1HBITS AMPCON1Hbits __attribute__((__sfr__));

#define BIASCON BIASCON
extern volatile uint16_t  BIASCON __attribute__((__sfr__));
typedef struct tagBIASCONBITS {
  uint16_t I10EN0:1;
  uint16_t I10EN1:1;
  uint16_t I10EN2:1;
  uint16_t I10EN3:1;
  uint16_t :11;
  uint16_t ON:1;
} BIASCONBITS;
extern volatile BIASCONBITS BIASCONbits __attribute__((__sfr__));

#define IBIASCONL IBIASCONL
extern volatile uint16_t  IBIASCONL __attribute__((__sfr__));
typedef struct tagIBIASCONLBITS {
  uint16_t SNKEN0:1;
  uint16_t SRCEN0:1;
  uint16_t GENSNKEN0:1;
  uint16_t GENSRCEN0:1;
  uint16_t SHRSNKEN0:1;
  uint16_t SHRSRCEN0:1;
  uint16_t :2;
  uint16_t SNKEN1:1;
  uint16_t SRCEN1:1;
  uint16_t GENSNKEN1:1;
  uint16_t GENSRCEN1:1;
  uint16_t SHRSNKEN1:1;
  uint16_t SHRSRCEN1:1;
} IBIASCONLBITS;
extern volatile IBIASCONLBITS IBIASCONLbits __attribute__((__sfr__));

#define IBIASCONH IBIASCONH
extern volatile uint16_t  IBIASCONH __attribute__((__sfr__));
typedef struct tagIBIASCONHBITS {
  uint16_t SNKEN2:1;
  uint16_t SRCEN2:1;
  uint16_t GENSNKEN2:1;
  uint16_t GENSRCEN2:1;
  uint16_t SHRSNKEN2:1;
  uint16_t SHRSRCEN2:1;
  uint16_t :2;
  uint16_t SNKEN3:1;
  uint16_t SRCEN3:1;
  uint16_t GENSNKEN3:1;
  uint16_t GENSRCEN3:1;
  uint16_t SHRSNKEN3:1;
  uint16_t SHRSRCEN3:1;
} IBIASCONHBITS;
extern volatile IBIASCONHBITS IBIASCONHbits __attribute__((__sfr__));

#define PTGCST PTGCST
extern volatile uint16_t  PTGCST __attribute__((__sfr__));
typedef struct tagPTGCSTBITS {
  uint16_t PTGITM:2;
  uint16_t :3;
  uint16_t PTGBUSY:1;
  uint16_t PTGWTO:1;
  uint16_t PTGSTRT:1;
  uint16_t PTGIVIS:1;
  uint16_t PTGSSEN:1;
  uint16_t PTGSWT:1;
  uint16_t :1;
  uint16_t PTGTOGL:1;
  uint16_t PTGSIDL:1;
  uint16_t :1;
  uint16_t PTGEN:1;
} PTGCSTBITS;
extern volatile PTGCSTBITS PTGCSTbits __attribute__((__sfr__));

#define PTGCON PTGCON
extern volatile uint16_t  PTGCON __attribute__((__sfr__));
typedef struct tagPTGCONBITS {
  uint16_t PTGWDT:3;
  uint16_t :1;
  uint16_t PTGPWD:4;
  uint16_t PTGDIV:5;
  uint16_t PTGCLK:3;
} PTGCONBITS;
extern volatile PTGCONBITS PTGCONbits __attribute__((__sfr__));

#define PTGBTE PTGBTE
extern volatile uint16_t  PTGBTE __attribute__((__sfr__));
typedef struct tagPTGBTEBITS {
  uint16_t PTGBTE0:1;
  uint16_t PTGBTE1:1;
  uint16_t PTGBTE2:1;
  uint16_t PTGBTE3:1;
  uint16_t PTGBTE4:1;
  uint16_t PTGBTE5:1;
  uint16_t PTGBTE6:1;
  uint16_t PTGBTE7:1;
  uint16_t PTGBTE8:1;
  uint16_t PTGBTE9:1;
  uint16_t PTGBTE10:1;
  uint16_t PTGBTE11:1;
  uint16_t PTGBTE12:1;
  uint16_t PTGBTE13:1;
  uint16_t PTGBTE14:1;
  uint16_t PTGBTE15:1;
} PTGBTEBITS;
extern volatile PTGBTEBITS PTGBTEbits __attribute__((__sfr__));

#define PTGBTEH PTGBTEH
extern volatile uint16_t  PTGBTEH __attribute__((__sfr__));
typedef struct tagPTGBTEHBITS {
  uint16_t PTGBTE16:1;
  uint16_t PTGBTE17:1;
  uint16_t PTGBTE18:1;
  uint16_t PTGBTE19:1;
  uint16_t PTGBTE20:1;
  uint16_t PTGBTE21:1;
  uint16_t PTGBTE22:1;
  uint16_t PTGBTE23:1;
  uint16_t PTGBTE24:1;
  uint16_t PTGBTE25:1;
  uint16_t PTGBTE26:1;
  uint16_t PTGBTE27:1;
  uint16_t PTGBTE28:1;
  uint16_t PTGBTE29:1;
  uint16_t PTGBTE30:1;
  uint16_t PTGBTE31:1;
} PTGBTEHBITS;
extern volatile PTGBTEHBITS PTGBTEHbits __attribute__((__sfr__));

#define PTGHOLD PTGHOLD
extern volatile uint16_t  PTGHOLD __attribute__((__sfr__));
#define PTGT0LIM PTGT0LIM
extern volatile uint16_t  PTGT0LIM __attribute__((__sfr__));
#define PTGT1LIM PTGT1LIM
extern volatile uint16_t  PTGT1LIM __attribute__((__sfr__));
#define PTGSDLIM PTGSDLIM
extern volatile uint16_t  PTGSDLIM __attribute__((__sfr__));
#define PTGC0LIM PTGC0LIM
extern volatile uint16_t  PTGC0LIM __attribute__((__sfr__));
#define PTGC1LIM PTGC1LIM
extern volatile uint16_t  PTGC1LIM __attribute__((__sfr__));
#define PTGADJ PTGADJ
extern volatile uint16_t  PTGADJ __attribute__((__sfr__));
#define PTGL0 PTGL0
extern volatile uint16_t  PTGL0 __attribute__((__sfr__));
#define PTGQPTR PTGQPTR
extern volatile uint16_t  PTGQPTR __attribute__((__sfr__));
typedef struct tagPTGQPTRBITS {
  uint16_t PTGQPTR:5;
} PTGQPTRBITS;
extern volatile PTGQPTRBITS PTGQPTRbits __attribute__((__sfr__));

#define PTGQUE0 PTGQUE0
extern volatile uint16_t  PTGQUE0 __attribute__((__sfr__));
typedef struct tagPTGQUE0BITS {
  uint16_t STEP0:8;
  uint16_t STEP1:8;
} PTGQUE0BITS;
extern volatile PTGQUE0BITS PTGQUE0bits __attribute__((__sfr__));

#define PTGQUE1 PTGQUE1
extern volatile uint16_t  PTGQUE1 __attribute__((__sfr__));
typedef struct tagPTGQUE1BITS {
  uint16_t STEP2:8;
  uint16_t STEP3:8;
} PTGQUE1BITS;
extern volatile PTGQUE1BITS PTGQUE1bits __attribute__((__sfr__));

#define PTGQUE2 PTGQUE2
extern volatile uint16_t  PTGQUE2 __attribute__((__sfr__));
typedef struct tagPTGQUE2BITS {
  uint16_t STEP4:8;
  uint16_t STEP5:8;
} PTGQUE2BITS;
extern volatile PTGQUE2BITS PTGQUE2bits __attribute__((__sfr__));

#define PTGQUE3 PTGQUE3
extern volatile uint16_t  PTGQUE3 __attribute__((__sfr__));
typedef struct tagPTGQUE3BITS {
  uint16_t STEP6:8;
  uint16_t STEP7:8;
} PTGQUE3BITS;
extern volatile PTGQUE3BITS PTGQUE3bits __attribute__((__sfr__));

#define PTGQUE4 PTGQUE4
extern volatile uint16_t  PTGQUE4 __attribute__((__sfr__));
typedef struct tagPTGQUE4BITS {
  uint16_t STEP8:8;
  uint16_t STEP9:8;
} PTGQUE4BITS;
extern volatile PTGQUE4BITS PTGQUE4bits __attribute__((__sfr__));

#define PTGQUE5 PTGQUE5
extern volatile uint16_t  PTGQUE5 __attribute__((__sfr__));
typedef struct tagPTGQUE5BITS {
  uint16_t STEP10:8;
  uint16_t STEP11:8;
} PTGQUE5BITS;
extern volatile PTGQUE5BITS PTGQUE5bits __attribute__((__sfr__));

