draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile DMACH0BITS DMACH0bits __attribute__((__sfr__));

#define DMAINT0 DMAINT0
extern volatile uint16_t  DMAINT0 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT0BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT0BITS;
extern volatile DMAINT0BITS DMAINT0bits __attribute__((__sfr__));

#define DMASRC0 DMASRC0
extern volatile uint16_t  DMASRC0 __attribute__((__sfr__));
#define DMADST0 DMADST0
extern volatile uint16_t  DMADST0 __attribute__((__sfr__));
#define DMACNT0 DMACNT0
extern volatile uint16_t  DMACNT0 __attribute__((__sfr__));
#define DMACH1 DMACH1
extern volatile uint16_t  DMACH1 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH1BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH1BITS;
extern volatile DMACH1BITS DMACH1bits __attribute__((__sfr__));

#define DMAINT1 DMAINT1
extern volatile uint16_t  DMAINT1 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT1BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT1BITS;
extern volatile DMAINT1BITS DMAINT1bits __attribute__((__sfr__));

#define DMASRC1 DMASRC1
extern volatile uint16_t  DMASRC1 __attribute__((__sfr__));
#define DMADST1 DMADST1
extern volatile uint16_t  DMADST1 __attribute__((__sfr__));
#define DMACNT1 DMACNT1
extern volatile uint16_t  DMACNT1 __attribute__((__sfr__));
#define DMACH2 DMACH2
extern volatile uint16_t  DMACH2 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH2BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH2BITS;
extern volatile DMACH2BITS DMACH2bits __attribute__((__sfr__));

#define DMAINT2 DMAINT2
extern volatile uint16_t  DMAINT2 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT2BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT2BITS;
extern volatile DMAINT2BITS DMAINT2bits __attribute__((__sfr__));

#define DMASRC2 DMASRC2
extern volatile uint16_t  DMASRC2 __attribute__((__sfr__));
#define DMADST2 DMADST2
extern volatile uint16_t  DMADST2 __attribute__((__sfr__));
#define DMACNT2 DMACNT2
extern volatile uint16_t  DMACNT2 __attribute__((__sfr__));
#define DMACH3 DMACH3
extern volatile uint16_t  DMACH3 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH3BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH3BITS;
extern volatile DMACH3BITS DMACH3bits __attribute__((__sfr__));

#define DMAINT3 DMAINT3
extern volatile uint16_t  DMAINT3 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT3BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT3BITS;
extern volatile DMAINT3BITS DMAINT3bits __attribute__((__sfr__));

#define DMASRC3 DMASRC3
extern volatile uint16_t  DMASRC3 __attribute__((__sfr__));
#define DMADST3 DMADST3
extern volatile uint16_t  DMADST3 __attribute__((__sfr__));
#define DMACNT3 DMACNT3
extern volatile uint16_t  DMACNT3 __attribute__((__sfr__));
#define ADCON1L ADCON1L
extern volatile uint16_t  ADCON1L __attribute__((__sfr__));
typedef struct tagADCON1LBITS {
  uint16_t :13;
  uint16_t ADSIDL:1;
  uint16_t :1;
  uint16_t ADON:1;
} ADCON1LBITS;
extern volatile ADCON1LBITS ADCON1Lbits __attribute__((__sfr__));

#define ADCON1H ADCON1H
extern volatile uint16_t  ADCON1H __attribute__((__sfr__));
__extension__ typedef struct tagADCON1HBITS {
  union {
    struct {
      uint16_t :5;
      uint16_t SHRRES:2;
      uint16_t FORM:1;
    };
    struct {
      uint16_t :5;
      uint16_t SHRRES0:1;
      uint16_t SHRRES1:1;
    };
  };
} ADCON1HBITS;
extern volatile ADCON1HBITS ADCON1Hbits __attribute__((__sfr__));

#define ADCON2L ADCON2L
extern volatile uint16_t  ADCON2L __attribute__((__sfr__));
__extension__ typedef struct tagADCON2LBITS {
  union {
    struct {
      uint16_t SHRADCS:7;
      uint16_t :1;
      uint16_t SHREISEL:3;
      uint16_t PTGEN:1;
      uint16_t EIEN:1;
      uint16_t :1;
      uint16_t REFERCIE:1;
      uint16_t REFCIE:1;
    };
    struct {
      uint16_t SHRADCS0:1;
      uint16_t SHRADCS1:1;
      uint16_t SHRADCS2:1;
      uint16_t SHRADCS3:1;
      uint16_t SHRADCS4:1;
      uint16_t SHRADCS5:1;
      uint16_t SHRADCS6:1;
      uint16_t :1;
      uint16_t SHREISEL0:1;
      uint16_t SHREISEL1:1;
      uint16_t SHREISEL2:1;
    };
  };
} ADCON2LBITS;
extern volatile ADCON2LBITS ADCON2Lbits __attribute__((__sfr__));

