draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile PORTCBITS PORTCbits __attribute__((__sfr__));

#define LATC LATC
extern volatile uint16_t  LATC __attribute__((__sfr__));
typedef struct tagLATCBITS {
  uint16_t LATC0:1;
  uint16_t LATC1:1;
  uint16_t LATC2:1;
  uint16_t LATC3:1;
  uint16_t LATC4:1;
  uint16_t LATC5:1;
  uint16_t LATC6:1;
  uint16_t LATC7:1;
  uint16_t LATC8:1;
  uint16_t LATC9:1;
  uint16_t LATC10:1;
  uint16_t LATC11:1;
  uint16_t LATC12:1;
  uint16_t LATC13:1;
  uint16_t LATC14:1;
  uint16_t LATC15:1;
} LATCBITS;
extern volatile LATCBITS LATCbits __attribute__((__sfr__));

#define ODCC ODCC
extern volatile uint16_t  ODCC __attribute__((__sfr__));
typedef struct tagODCCBITS {
  uint16_t ODCC0:1;
  uint16_t ODCC1:1;
  uint16_t ODCC2:1;
  uint16_t ODCC3:1;
  uint16_t ODCC4:1;
  uint16_t ODCC5:1;
  uint16_t ODCC6:1;
  uint16_t ODCC7:1;
  uint16_t ODCC8:1;
  uint16_t ODCC9:1;
  uint16_t ODCC10:1;
  uint16_t ODCC11:1;
  uint16_t ODCC12:1;
  uint16_t ODCC13:1;
  uint16_t ODCC14:1;
  uint16_t ODCC15:1;
} ODCCBITS;
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define CNPUC CNPUC
extern volatile uint16_t  CNPUC __attribute__((__sfr__));
typedef struct tagCNPUCBITS {
  uint16_t CNPUC0:1;
  uint16_t CNPUC1:1;
  uint16_t CNPUC2:1;
  uint16_t CNPUC3:1;
  uint16_t CNPUC4:1;
  uint16_t CNPUC5:1;
  uint16_t CNPUC6:1;
  uint16_t CNPUC7:1;
  uint16_t CNPUC8:1;
  uint16_t CNPUC9:1;
  uint16_t CNPUC10:1;
  uint16_t CNPUC11:1;
  uint16_t CNPUC12:1;
  uint16_t CNPUC13:1;
  uint16_t CNPUC14:1;
  uint16_t CNPUC15:1;
} CNPUCBITS;
extern volatile CNPUCBITS CNPUCbits __attribute__((__sfr__));

#define CNPDC CNPDC
extern volatile uint16_t  CNPDC __attribute__((__sfr__));
typedef struct tagCNPDCBITS {
  uint16_t CNPDC0:1;
  uint16_t CNPDC1:1;
  uint16_t CNPDC2:1;
  uint16_t CNPDC3:1;
  uint16_t CNPDC4:1;
  uint16_t CNPDC5:1;
  uint16_t CNPDC6:1;
  uint16_t CNPDC7:1;
  uint16_t CNPDC8:1;
  uint16_t CNPDC9:1;
  uint16_t CNPDC10:1;
  uint16_t CNPDC11:1;
  uint16_t CNPDC12:1;
  uint16_t CNPDC13:1;
  uint16_t CNPDC14:1;
  uint16_t CNPDC15:1;
} CNPDCBITS;
extern volatile CNPDCBITS CNPDCbits __attribute__((__sfr__));

#define CNCONC CNCONC
extern volatile uint16_t  CNCONC __attribute__((__sfr__));
typedef struct tagCNCONCBITS {
  uint16_t :11;
  uint16_t CNSTYLE:1;
  uint16_t :3;
  uint16_t ON:1;
} CNCONCBITS;
extern volatile CNCONCBITS CNCONCbits __attribute__((__sfr__));

#define CNEN0C CNEN0C
extern volatile uint16_t  CNEN0C __attribute__((__sfr__));
typedef struct tagCNEN0CBITS {
  uint16_t CNEN0C0:1;
  uint16_t CNEN0C1:1;
  uint16_t CNEN0C2:1;
  uint16_t CNEN0C3:1;
  uint16_t CNEN0C4:1;
  uint16_t CNEN0C5:1;
  uint16_t CNEN0C6:1;
  uint16_t CNEN0C7:1;
  uint16_t CNEN0C8:1;
  uint16_t CNEN0C9:1;
  uint16_t CNEN0C10:1;
  uint16_t CNEN0C11:1;
  uint16_t CNEN0C12:1;
  uint16_t CNEN0C13:1;
  uint16_t CNEN0C14:1;
  uint16_t CNEN0C15:1;
} CNEN0CBITS;
extern volatile CNEN0CBITS CNEN0Cbits __attribute__((__sfr__));

#define CNSTATC CNSTATC
extern volatile uint16_t  CNSTATC __attribute__((__sfr__));
typedef struct tagCNSTATCBITS {
  uint16_t CNSTATC0:1;
  uint16_t CNSTATC1:1;
  uint16_t CNSTATC2:1;
  uint16_t CNSTATC3:1;
  uint16_t CNSTATC4:1;
  uint16_t CNSTATC5:1;
  uint16_t CNSTATC6:1;
  uint16_t CNSTATC7:1;
  uint16_t CNSTATC8:1;
  uint16_t CNSTATC9:1;
  uint16_t CNSTATC10:1;
  uint16_t CNSTATC11:1;
  uint16_t CNSTATC12:1;
  uint16_t CNSTATC13:1;
  uint16_t CNSTATC14:1;
  uint16_t CNSTATC15:1;
} CNSTATCBITS;
extern volatile CNSTATCBITS CNSTATCbits __attribute__((__sfr__));

#define CNEN1C CNEN1C
extern volatile uint16_t  CNEN1C __attribute__((__sfr__));
typedef struct tagCNEN1CBITS {
  uint16_t CNEN1C0:1;
  uint16_t CNEN1C1:1;
  uint16_t CNEN1C2:1;
  uint16_t CNEN1C3:1;
  uint16_t CNEN1C4:1;
  uint16_t CNEN1C5:1;
  uint16_t CNEN1C6:1;
  uint16_t CNEN1C7:1;
  uint16_t CNEN1C8:1;
  uint16_t CNEN1C9:1;
  uint16_t CNEN1C10:1;
  uint16_t CNEN1C11:1;
  uint16_t CNEN1C12:1;
  uint16_t CNEN1C13:1;
  uint16_t CNEN1C14:1;
  uint16_t CNEN1C15:1;
} CNEN1CBITS;
extern volatile CNEN1CBITS CNEN1Cbits __attribute__((__sfr__));

#define CNFC CNFC
extern volatile uint16_t  CNFC __attribute__((__sfr__));
typedef struct tagCNFCBITS {
  uint16_t CNFC0:1;
  uint16_t CNFC1:1;
  uint16_t CNFC2:1;
  uint16_t CNFC3:1;
  uint16_t CNFC4:1;
  uint16_t CNFC5:1;
  uint16_t CNFC6:1;
  uint16_t CNFC7:1;
  uint16_t CNFC8:1;
  uint16_t CNFC9:1;
  uint16_t CNFC10:1;
  uint16_t CNFC11:1;
  uint16_t CNFC12:1;
  uint16_t CNFC13:1;
  uint16_t CNFC14:1;
  uint16_t CNFC15:1;
} CNFCBITS;
extern volatile CNFCBITS CNFCbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t  ANSELD __attribute__((__sfr__));
typedef struct tagANSELDBITS {
  uint16_t :10;
  uint16_t ANSELD10:1;
  uint16_t ANSELD11:1;
  uint16_t :1;
  uint16_t ANSELD13:1;
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define TRISD TRISD
extern volatile uint16_t  TRISD __attribute__((__sfr__));
typedef struct tagTRISDBITS {
  uint16_t TRISD0:1;
  uint16_t TRISD1:1;
  uint16_t TRISD2:1;
  uint16_t TRISD3:1;
  uint16_t TRISD4:1;
  uint16_t TRISD5:1;
  uint16_t TRISD6:1;
  uint16_t TRISD7:1;
  uint16_t TRISD8:1;
  uint16_t TRISD9:1;
  uint16_t TRISD10:1;
  uint16_t TRISD11:1;
  uint16_t TRISD12:1;
  uint16_t TRISD13:1;
  uint16_t TRISD14:1;
  uint16_t TRISD15:1;
} TRISDBITS;
extern volatile TRISDBITS TRISDbits __attribute__((__sfr__));

#define PORTD PORTD
extern volatile uint16_t  PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  uint16_t RD0:1;
  uint16_t RD1:1;
  uint16_t RD2:1;
  uint16_t RD3:1;
  uint16_t RD4:1;
  uint16_t RD5:1;
  uint16_t RD6:1;
  uint16_t RD7:1;
  uint16_t RD8:1;
  uint16_t RD9:1;
  uint16_t RD10:1;
  uint16_t RD11:1;
  uint16_t RD12:1;
  uint16_t RD13:1;
  uint16_t RD14:1;
  uint16_t RD15:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

#define LATD LATD
extern volatile uint16_t  LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  uint16_t LATD0:1;
  uint16_t LATD1:1;
  uint16_t LATD2:1;
  uint16_t LATD3:1;
  uint16_t LATD4:1;
  uint16_t LATD5:1;
  uint16_t LATD6:1;
  uint16_t LATD7:1;
  uint16_t LATD8:1;
  uint16_t LATD9:1;
  uint16_t LATD10:1;
  uint16_t LATD11:1;
  uint16_t LATD12:1;
  uint16_t LATD13:1;
  uint16_t LATD14:1;
  uint16_t LATD15:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

#define ODCD ODCD
extern volatile uint16_t  ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  uint16_t ODCD0:1;
  uint16_t ODCD1:1;
  uint16_t ODCD2:1;
  uint16_t ODCD3:1;
  uint16_t ODCD4:1;
  uint16_t ODCD5:1;
  uint16_t ODCD6:1;
  uint16_t ODCD7:1;
  uint16_t ODCD8:1;
  uint16_t ODCD9:1;
  uint16_t ODCD10:1;
  uint16_t ODCD11:1;
  uint16_t ODCD12:1;
  uint16_t ODCD13:1;
  uint16_t ODCD14:1;
  uint16_t ODCD15:1;
} ODCDBITS;
