draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t  CNPUD __attribute__((__sfr__));
typedef struct tagCNPUDBITS {
  uint16_t CNPUD0:1;
  uint16_t CNPUD1:1;
  uint16_t CNPUD2:1;
  uint16_t CNPUD3:1;
  uint16_t CNPUD4:1;
  uint16_t CNPUD5:1;
  uint16_t CNPUD6:1;
  uint16_t CNPUD7:1;
  uint16_t CNPUD8:1;
  uint16_t CNPUD9:1;
  uint16_t CNPUD10:1;
  uint16_t CNPUD11:1;
  uint16_t CNPUD12:1;
  uint16_t CNPUD13:1;
  uint16_t CNPUD14:1;
  uint16_t CNPUD15:1;
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t  CNPDD __attribute__((__sfr__));
typedef struct tagCNPDDBITS {
  uint16_t CNPDD0:1;
  uint16_t CNPDD1:1;
  uint16_t CNPDD2:1;
  uint16_t CNPDD3:1;
  uint16_t CNPDD4:1;
  uint16_t CNPDD5:1;
  uint16_t CNPDD6:1;
  uint16_t CNPDD7:1;
  uint16_t CNPDD8:1;
  uint16_t CNPDD9:1;
  uint16_t CNPDD10:1;
  uint16_t CNPDD11:1;
  uint16_t CNPDD12:1;
  uint16_t CNPDD13:1;
  uint16_t CNPDD14:1;
  uint16_t CNPDD15:1;
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define CNCOND CNCOND
extern volatile uint16_t  CNCOND __attribute__((__sfr__));
typedef struct tagCNCONDBITS {
  uint16_t :11;
  uint16_t CNSTYLE:1;
  uint16_t :3;
  uint16_t ON:1;
} CNCONDBITS;
extern volatile CNCONDBITS CNCONDbits __attribute__((__sfr__));

#define CNEN0D CNEN0D
extern volatile uint16_t  CNEN0D __attribute__((__sfr__));
typedef struct tagCNEN0DBITS {
  uint16_t CNEN0D0:1;
  uint16_t CNEN0D1:1;
  uint16_t CNEN0D2:1;
  uint16_t CNEN0D3:1;
  uint16_t CNEN0D4:1;
  uint16_t CNEN0D5:1;
  uint16_t CNEN0D6:1;
  uint16_t CNEN0D7:1;
  uint16_t CNEN0D8:1;
  uint16_t CNEN0D9:1;
  uint16_t CNEN0D10:1;
  uint16_t CNEN0D11:1;
  uint16_t CNEN0D12:1;
  uint16_t CNEN0D13:1;
  uint16_t CNEN0D14:1;
  uint16_t CNEN0D15:1;
} CNEN0DBITS;
extern volatile CNEN0DBITS CNEN0Dbits __attribute__((__sfr__));

#define CNSTATD CNSTATD
extern volatile uint16_t  CNSTATD __attribute__((__sfr__));
typedef struct tagCNSTATDBITS {
  uint16_t CNSTATD0:1;
  uint16_t CNSTATD1:1;
  uint16_t CNSTATD2:1;
  uint16_t CNSTATD3:1;
  uint16_t CNSTATD4:1;
  uint16_t CNSTATD5:1;
  uint16_t CNSTATD6:1;
  uint16_t CNSTATD7:1;
  uint16_t CNSTATD8:1;
  uint16_t CNSTATD9:1;
  uint16_t CNSTATD10:1;
  uint16_t CNSTATD11:1;
  uint16_t CNSTATD12:1;
  uint16_t CNSTATD13:1;
  uint16_t CNSTATD14:1;
  uint16_t CNSTATD15:1;
} CNSTATDBITS;
extern volatile CNSTATDBITS CNSTATDbits __attribute__((__sfr__));

#define CNEN1D CNEN1D
extern volatile uint16_t  CNEN1D __attribute__((__sfr__));
typedef struct tagCNEN1DBITS {
  uint16_t CNEN1D0:1;
  uint16_t CNEN1D1:1;
  uint16_t CNEN1D2:1;
  uint16_t CNEN1D3:1;
  uint16_t CNEN1D4:1;
  uint16_t CNEN1D5:1;
  uint16_t CNEN1D6:1;
  uint16_t CNEN1D7:1;
  uint16_t CNEN1D8:1;
  uint16_t CNEN1D9:1;
  uint16_t CNEN1D10:1;
  uint16_t CNEN1D11:1;
  uint16_t CNEN1D12:1;
  uint16_t CNEN1D13:1;
  uint16_t CNEN1D14:1;
  uint16_t CNEN1D15:1;
} CNEN1DBITS;
extern volatile CNEN1DBITS CNEN1Dbits __attribute__((__sfr__));

#define CNFD CNFD
extern volatile uint16_t  CNFD __attribute__((__sfr__));
typedef struct tagCNFDBITS {
  uint16_t CNFD0:1;
  uint16_t CNFD1:1;
  uint16_t CNFD2:1;
  uint16_t CNFD3:1;
  uint16_t CNFD4:1;
  uint16_t CNFD5:1;
  uint16_t CNFD6:1;
  uint16_t CNFD7:1;
  uint16_t CNFD8:1;
  uint16_t CNFD9:1;
  uint16_t CNFD10:1;
  uint16_t CNFD11:1;
  uint16_t CNFD12:1;
  uint16_t CNFD13:1;
  uint16_t CNFD14:1;
  uint16_t CNFD15:1;
} CNFDBITS;
extern volatile CNFDBITS CNFDbits __attribute__((__sfr__));

#define MBISTCON MBISTCON
extern volatile uint16_t  MBISTCON __attribute__((__sfr__));
typedef struct tagMBISTCONBITS {
  uint16_t MBISTEN:1;
  uint16_t :3;
  uint16_t MBISTSTAT:1;
  uint16_t :2;
  uint16_t MBISTDONE:1;
  uint16_t FLTINJ:1;
} MBISTCONBITS;
extern volatile MBISTCONBITS MBISTCONbits __attribute__((__sfr__));

#define U3MODE U3MODE
extern volatile uint16_t  U3MODE __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t URXEN:1;
      uint16_t UTXEN:1;
      uint16_t ABAUD:1;
      uint16_t BRGH:1;
      uint16_t UTXBRK:1;
      uint16_t BRKOVR:1;
      uint16_t :1;
      uint16_t RXBIMD:1;
      uint16_t WAKE:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
    };
  };
} U3MODEBITS;
extern volatile U3MODEBITS U3MODEbits __attribute__((__sfr__));

#define U3MODEH U3MODEH
extern volatile uint16_t  U3MODEH __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEHBITS {
  union {
    struct {
      uint16_t FLO:2;
      uint16_t UTXINV:1;
      uint16_t C0EN:1;
      uint16_t STSEL:2;
      uint16_t URXINV:1;
      uint16_t RUNOVF:1;
      uint16_t HALFDPLX:1;
      uint16_t BCLKSEL:2;
      uint16_t BCLKMOD:1;
      uint16_t :2;
      uint16_t ACTIVE:1;
      uint16_t SLPEN:1;
    };
    struct {
      uint16_t FLO0:1;
      uint16_t FLO1:1;
      uint16_t :2;
      uint16_t STSEL0:1;
      uint16_t STSEL1:1;
      uint16_t :3;
      uint16_t BCLKSEL0:1;
      uint16_t BCLKSEL1:1;
    };
  };
} U3MODEHBITS;
extern volatile U3MODEHBITS U3MODEHbits __attribute__((__sfr__));

#define U3STA U3STA
extern volatile uint16_t  U3STA __attribute__((__sfr__));
typedef struct tagU3STABITS {
  uint16_t TXCIF:1;
  uint16_t OERR:1;
  uint16_t RXBKIF:1;
  uint16_t FERR:1;
  uint16_t CERIF:1;
  uint16_t ABDOVF:1;
  uint16_t PERR:1;
  uint16_t TRMT:1;
  uint16_t TXCIE:1;
  uint16_t OERIE:1;
  uint16_t RXBKIE:1;
  uint16_t FERIE:1;
  uint16_t CERIE:1;
  uint16_t ABDOVE:1;
  uint16_t PERIE:1;
  uint16_t TXMTIE:1;
} U3STABITS;
extern volatile U3STABITS U3STAbits __attribute__((__sfr__));

#define U3STAH U3STAH
extern volatile uint16_t  U3STAH __attribute__((__sfr__));
__extension__ typedef struct tagU3STAHBITS {
  union {
    struct {
      uint16_t URXBF:1;
      uint16_t URXBE:1;
      uint16_t XON:1;
      uint16_t RIDLE:1;
      uint16_t UTXBF:1;
      uint16_t UTXBE:1;
      uint16_t STPMD:1;
      uint16_t TXWRE:1;
      uint16_t URXISEL:3;
      uint16_t :1;
      uint16_t UTXISEL:3;
    };
    struct {
      uint16_t :8;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
      uint16_t URXISEL2:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXISEL1:1;
      uint16_t UTXISEL2:1;
    };
  };
} U3STAHBITS;
extern volatile U3STAHBITS U3STAHbits __attribute__((__sfr__));

