draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define U3BRG U3BRG
extern volatile uint16_t  U3BRG __attribute__((__sfr__));
__extension__ typedef struct tagU3BRGBITS {
  union {
    struct {
      uint16_t BRG:16;
    };
    struct {
      uint16_t BRG0:1;
      uint16_t BRG1:1;
      uint16_t BRG2:1;
      uint16_t BRG3:1;
      uint16_t BRG4:1;
      uint16_t BRG5:1;
      uint16_t BRG6:1;
      uint16_t BRG7:1;
      uint16_t BRG8:1;
      uint16_t BRG9:1;
      uint16_t BRG10:1;
      uint16_t BRG11:1;
      uint16_t BRG12:1;
      uint16_t BRG13:1;
      uint16_t BRG14:1;
      uint16_t BRG15:1;
    };
  };
} U3BRGBITS;
extern volatile U3BRGBITS U3BRGbits __attribute__((__sfr__));

#define U3BRGH U3BRGH
extern volatile uint16_t  U3BRGH __attribute__((__sfr__));
__extension__ typedef struct tagU3BRGHBITS {
  union {
    struct {
      uint16_t BRG:4;
    };
    struct {
      uint16_t BRG16:1;
      uint16_t BRG1:1;
      uint16_t BRG18:1;
      uint16_t BRG19:1;
    };
  };
} U3BRGHBITS;
extern volatile U3BRGHBITS U3BRGHbits __attribute__((__sfr__));

#define U3RXREG U3RXREG
extern volatile uint16_t  U3RXREG __attribute__((__sfr__));
__extension__ typedef struct tagU3RXREGBITS {
  union {
    struct {
      uint16_t RXREG:8;
    };
    struct {
      uint16_t RXREG0:1;
      uint16_t RXREG1:1;
      uint16_t RXREG2:1;
      uint16_t RXREG3:1;
      uint16_t RXREG4:1;
      uint16_t RXREG5:1;
      uint16_t RXREG6:1;
      uint16_t RXREG7:1;
    };
  };
} U3RXREGBITS;
extern volatile U3RXREGBITS U3RXREGbits __attribute__((__sfr__));

#define U3TXREG U3TXREG
extern volatile uint16_t  U3TXREG __attribute__((__sfr__));
__extension__ typedef struct tagU3TXREGBITS {
  union {
    struct {
      uint16_t TXREG:8;
      uint16_t :7;
      uint16_t LAST:1;
    };
    struct {
      uint16_t TXREG0:1;
      uint16_t TXREG1:1;
      uint16_t TXREG2:1;
      uint16_t TXREG3:1;
      uint16_t TXREG4:1;
      uint16_t TXREG5:1;
      uint16_t TXREG6:1;
      uint16_t TXREG7:1;
    };
  };
} U3TXREGBITS;
extern volatile U3TXREGBITS U3TXREGbits __attribute__((__sfr__));

#define U3P1 U3P1
extern volatile uint16_t  U3P1 __attribute__((__sfr__));
__extension__ typedef struct tagU3P1BITS {
  union {
    struct {
      uint16_t P1:9;
    };
    struct {
      uint16_t P10:1;
      uint16_t P11:1;
      uint16_t P12:1;
      uint16_t P13:1;
      uint16_t P14:1;
      uint16_t P15:1;
      uint16_t P16:1;
      uint16_t P17:1;
      uint16_t P18:1;
    };
  };
} U3P1BITS;
extern volatile U3P1BITS U3P1bits __attribute__((__sfr__));

#define U3P2 U3P2
extern volatile uint16_t  U3P2 __attribute__((__sfr__));
__extension__ typedef struct tagU3P2BITS {
  union {
    struct {
      uint16_t P2:9;
    };
    struct {
      uint16_t P20:1;
      uint16_t P21:1;
      uint16_t P22:1;
      uint16_t P23:1;
      uint16_t P24:1;
      uint16_t P25:1;
      uint16_t P26:1;
      uint16_t P27:1;
      uint16_t P28:1;
    };
  };
} U3P2BITS;
extern volatile U3P2BITS U3P2bits __attribute__((__sfr__));

#define U3P3 U3P3
extern volatile uint16_t  U3P3 __attribute__((__sfr__));
__extension__ typedef struct tagU3P3BITS {
  union {
    struct {
      uint16_t P3:16;
    };
    struct {
      uint16_t P30:1;
      uint16_t P31:1;
      uint16_t P32:1;
      uint16_t P33:1;
      uint16_t P34:1;
      uint16_t P35:1;
      uint16_t P36:1;
      uint16_t P37:1;
      uint16_t P38:1;
      uint16_t P39:1;
      uint16_t P310:1;
      uint16_t P311:1;
      uint16_t P312:1;
      uint16_t P313:1;
      uint16_t P314:1;
      uint16_t P315:1;
    };
  };
} U3P3BITS;
extern volatile U3P3BITS U3P3bits __attribute__((__sfr__));

#define U3P3H U3P3H
extern volatile uint16_t  U3P3H __attribute__((__sfr__));
__extension__ typedef struct tagU3P3HBITS {
  union {
    struct {
      uint16_t P3H:8;
    };
    struct {
      uint16_t P316:1;
      uint16_t P317:1;
      uint16_t P318:1;
      uint16_t P319:1;
      uint16_t P320:1;
      uint16_t P321:1;
      uint16_t P322:1;
      uint16_t P323:1;
    };
  };
} U3P3HBITS;
extern volatile U3P3HBITS U3P3Hbits __attribute__((__sfr__));

#define U3TXCHK U3TXCHK
extern volatile uint16_t  U3TXCHK __attribute__((__sfr__));
__extension__ typedef struct tagU3TXCHKBITS {
  union {
    struct {
      uint16_t TXCHK:8;
    };
    struct {
      uint16_t TXCHK0:1;
      uint16_t TXCHK1:1;
      uint16_t TXCHK2:1;
      uint16_t TXCHK3:1;
      uint16_t TXCHK4:1;
      uint16_t TXCHK5:1;
      uint16_t TXCHK6:1;
      uint16_t TXCHK7:1;
    };
  };
} U3TXCHKBITS;
extern volatile U3TXCHKBITS U3TXCHKbits __attribute__((__sfr__));

#define U3RXCHK U3RXCHK
extern volatile uint16_t  U3RXCHK __attribute__((__sfr__));
typedef struct tagU3RXCHKBITS {
  uint16_t RXCHK:8;
} U3RXCHKBITS;
extern volatile U3RXCHKBITS U3RXCHKbits __attribute__((__sfr__));

#define U3SCCON U3SCCON
extern volatile uint16_t  U3SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU3SCCONBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t PTRCL:1;
      uint16_t T0PD:1;
      uint16_t CONV:1;
      uint16_t TXRPT:2;
    };
    struct {
      uint16_t :4;
      uint16_t TXRPT0:1;
      uint16_t TXRPT1:1;
    };
  };
} U3SCCONBITS;
extern volatile U3SCCONBITS U3SCCONbits __attribute__((__sfr__));

#define U3SCINT U3SCINT
extern volatile uint16_t  U3SCINT __attribute__((__sfr__));
typedef struct tagU3SCINTBITS {
  uint16_t GTCIE:1;
  uint16_t WTCIE:1;
  uint16_t BTCIE:1;
  uint16_t :1;
  uint16_t TXRPTIE:1;
  uint16_t RXRPTIE:1;
  uint16_t :2;
  uint16_t GTCIF:1;
  uint16_t WTCIF:1;
  uint16_t BTCIF:1;
  uint16_t :1;
  uint16_t TXRPTIF:1;
  uint16_t RXRPTIF:1;
} U3SCINTBITS;
extern volatile U3SCINTBITS U3SCINTbits __attribute__((__sfr__));

#define U3INT U3INT
extern volatile uint16_t  U3INT __attribute__((__sfr__));
typedef struct tagU3INTBITS {
  uint16_t :2;
  uint16_t ABDIE:1;
  uint16_t :3;
  uint16_t ABDIF:1;
  uint16_t WUIF:1;
} U3INTBITS;
extern volatile U3INTBITS U3INTbits __attribute__((__sfr__));

#define I2C3CON1 I2C3CON1
extern volatile uint16_t  I2C3CON1 __attribute__((__sfr__));
typedef struct tagI2C3CON1BITS {
  uint16_t SEN:1;
  uint16_t RSEN:1;
  uint16_t PEN:1;
  uint16_t RCEN:1;
  uint16_t ACKEN:1;
  uint16_t ACKDT:1;
  uint16_t STREN:1;
  uint16_t GCEN:1;
  uint16_t SMEN:1;
  uint16_t DISSLW:1;
  uint16_t A10M:1;
  uint16_t STRICT:1;
  uint16_t SCLREL:1;
  uint16_t I2CSIDL:1;
  uint16_t :1;
  uint16_t I2CEN:1;
} I2C3CON1BITS;
