draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
extern volatile I2C3CON1BITS I2C3CON1bits __attribute__((__sfr__));

#define I2C3CONL I2C3CONL
extern volatile uint16_t  I2C3CONL __attribute__((__sfr__));
typedef struct tagI2C3CONLBITS {
  uint16_t SEN:1;
  uint16_t RSEN:1;
  uint16_t PEN:1;
  uint16_t RCEN:1;
  uint16_t ACKEN:1;
  uint16_t ACKDT:1;
  uint16_t STREN:1;
  uint16_t GCEN:1;
  uint16_t SMEN:1;
  uint16_t DISSLW:1;
  uint16_t A10M:1;
  uint16_t STRICT:1;
  uint16_t SCLREL:1;
  uint16_t I2CSIDL:1;
  uint16_t :1;
  uint16_t I2CEN:1;
} I2C3CONLBITS;
extern volatile I2C3CONLBITS I2C3CONLbits __attribute__((__sfr__));

#define I2C3CON2 I2C3CON2
extern volatile uint16_t  I2C3CON2 __attribute__((__sfr__));
typedef struct tagI2C3CON2BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
} I2C3CON2BITS;
extern volatile I2C3CON2BITS I2C3CON2bits __attribute__((__sfr__));

#define I2C3CONH I2C3CONH
extern volatile uint16_t  I2C3CONH __attribute__((__sfr__));
typedef struct tagI2C3CONHBITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
} I2C3CONHBITS;
extern volatile I2C3CONHBITS I2C3CONHbits __attribute__((__sfr__));

#define I2C3STAT I2C3STAT
extern volatile uint16_t  I2C3STAT __attribute__((__sfr__));
typedef struct tagI2C3STATBITS {
  uint16_t TBF:1;
  uint16_t RBF:1;
  uint16_t R_W:1;
  uint16_t S:1;
  uint16_t P:1;
  uint16_t D_A:1;
  uint16_t I2COV:1;
  uint16_t IWCOL:1;
  uint16_t ADD10:1;
  uint16_t GCSTAT:1;
  uint16_t BCL:1;
  uint16_t :2;
  uint16_t ACKTIM:1;
  uint16_t TRSTAT:1;
  uint16_t ACKSTAT:1;
} I2C3STATBITS;
extern volatile I2C3STATBITS I2C3STATbits __attribute__((__sfr__));

#define I2C3ADD I2C3ADD
extern volatile uint16_t  I2C3ADD __attribute__((__sfr__));
typedef struct tagI2C3ADDBITS {
  uint16_t ADD:10;
} I2C3ADDBITS;
extern volatile I2C3ADDBITS I2C3ADDbits __attribute__((__sfr__));

#define I2C3MSK I2C3MSK
extern volatile uint16_t  I2C3MSK __attribute__((__sfr__));
__extension__ typedef struct tagI2C3MSKBITS {
  union {
    struct {
      uint16_t AMSK:10;
    };
    struct {
      uint16_t AMSK0:1;
      uint16_t AMSK1:1;
      uint16_t AMSK2:1;
      uint16_t AMSK3:1;
      uint16_t AMSK4:1;
      uint16_t AMSK5:1;
      uint16_t AMSK6:1;
      uint16_t AMSK7:1;
      uint16_t AMSK8:1;
      uint16_t AMSK9:1;
    };
  };
} I2C3MSKBITS;
extern volatile I2C3MSKBITS I2C3MSKbits __attribute__((__sfr__));

#define I2C3BRG I2C3BRG
extern volatile uint16_t  I2C3BRG __attribute__((__sfr__));
#define I2C3TRN I2C3TRN
extern volatile uint16_t  I2C3TRN __attribute__((__sfr__));
typedef struct tagI2C3TRNBITS {
  uint16_t I2CTXDATA:8;
} I2C3TRNBITS;
extern volatile I2C3TRNBITS I2C3TRNbits __attribute__((__sfr__));

#define I2C3RCV I2C3RCV
extern volatile uint16_t  I2C3RCV __attribute__((__sfr__));
typedef struct tagI2C3RCVBITS {
  uint16_t I2CRXDATA:8;
} I2C3RCVBITS;
extern volatile I2C3RCVBITS I2C3RCVbits __attribute__((__sfr__));

#define RCON RCON
extern volatile uint16_t  RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  uint16_t POR:1;
  uint16_t BOR:1;
  uint16_t IDLE:1;
  uint16_t SLEEP:1;
  uint16_t WDTO:1;
  uint16_t :1;
  uint16_t SWR:1;
  uint16_t EXTR:1;
  uint16_t VREGS:1;
  uint16_t CM:1;
  uint16_t :4;
  uint16_t IOPUWR:1;
  uint16_t TRAPR:1;
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t  OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t :2;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t :1;
      uint16_t CLKLOCK:1;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :8;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

#define OSCCONL OSCCONL
extern volatile uint8_t OSCCONL __attribute__((__sfr__));
#define OSCCONH OSCCONH
extern volatile uint8_t OSCCONH __attribute__((__sfr__));
#define CLKDIV CLKDIV
extern volatile uint16_t  CLKDIV __attribute__((__sfr__));
__extension__ typedef struct tagCLKDIVBITS {
  union {
    struct {
      uint16_t PLLPRE:6;
      uint16_t :2;
      uint16_t FRCDIV:3;
      uint16_t DOZEN:1;
      uint16_t DOZE:3;
      uint16_t ROI:1;
    };
    struct {
      uint16_t PLLPRE0:1;
      uint16_t PLLPRE1:1;
      uint16_t PLLPRE2:1;
      uint16_t PLLPRE3:1;
      uint16_t PLLPRE4:1;
      uint16_t PLLPRE5:1;
      uint16_t :2;
      uint16_t FRCDIV0:1;
      uint16_t FRCDIV1:1;
      uint16_t FRCDIV2:1;
      uint16_t :1;
      uint16_t DOZE0:1;
      uint16_t DOZE1:1;
      uint16_t DOZE2:1;
    };
  };
} CLKDIVBITS;
extern volatile CLKDIVBITS CLKDIVbits __attribute__((__sfr__));

#define PLLFBD PLLFBD
extern volatile uint16_t  PLLFBD __attribute__((__sfr__));
__extension__ typedef struct tagPLLFBDBITS {
  union {
    struct {
      uint16_t PLLFBDIV:12;
    };
    struct {
      uint16_t PLLFBDIV0:1;
      uint16_t PLLFBDIV1:1;
      uint16_t PLLFBDIV2:1;
      uint16_t PLLFBDIV3:1;
      uint16_t PLLFBDIV4:1;
      uint16_t PLLFBDIV5:1;
      uint16_t PLLFBDIV6:1;
      uint16_t PLLFBDIV7:1;
      uint16_t PLLFBDIV8:1;
      uint16_t PLLFBDIV9:1;
      uint16_t PLLFBDIV10:1;
      uint16_t PLLFBDIV11:1;
    };
  };
} PLLFBDBITS;
extern volatile PLLFBDBITS PLLFBDbits __attribute__((__sfr__));

#define PLLDIV PLLDIV
extern volatile uint16_t  PLLDIV __attribute__((__sfr__));
__extension__ typedef struct tagPLLDIVBITS {
  union {
    struct {
      uint16_t POST2DIV:3;
      uint16_t :1;
      uint16_t POST1DIV:3;
      uint16_t :1;
      uint16_t VCODIV:2;
    };
    struct {
      uint16_t POST2DIV0:1;
      uint16_t POST2DIV1:1;
      uint16_t POST2DIV2:1;
      uint16_t :1;
      uint16_t POST1DIV0:1;
      uint16_t POST1DIV1:1;
      uint16_t POST1DIV2:1;
      uint16_t :1;
      uint16_t VCODIV0:1;
      uint16_t VCODIV1:1;
    };
  };
} PLLDIVBITS;
extern volatile PLLDIVBITS PLLDIVbits __attribute__((__sfr__));

#define OSCTUN OSCTUN
extern volatile uint16_t  OSCTUN __attribute__((__sfr__));
__extension__ typedef struct tagOSCTUNBITS {
  union {
    struct {
      uint16_t TUN:6;
    };
    struct {
      uint16_t TUN0:1;
      uint16_t TUN1:1;
      uint16_t TUN2:1;
      uint16_t TUN3:1;
      uint16_t TUN4:1;
      uint16_t TUN5:1;
    };
  };
} OSCTUNBITS;
extern volatile OSCTUNBITS OSCTUNbits __attribute__((__sfr__));

#define ACLKCON1 ACLKCON1
extern volatile uint16_t  ACLKCON1 __attribute__((__sfr__));
__extension__ typedef struct tagACLKCON1BITS {
  union {
    struct {
      uint16_t APLLPRE:6;
      uint16_t :2;
      uint16_t FRCSEL:1;
      uint16_t ASRCSEL:1;
      uint16_t :4;
      uint16_t APLLCK:1;
      uint16_t APLLEN:1;
    };
    struct {
      uint16_t APLLPRE0:1;
      uint16_t APLLPRE1:1;
      uint16_t APLLPRE2:1;
      uint16_t APLLPRE3:1;
      uint16_t APLLPRE4:1;
      uint16_t APLLPRE5:1;
    };
  };
} ACLKCON1BITS;
extern volatile ACLKCON1BITS ACLKCON1bits __attribute__((__sfr__));

#define APLLFBD1 APLLFBD1
extern volatile uint16_t  APLLFBD1 __attribute__((__sfr__));
__extension__ typedef struct tagAPLLFBD1BITS {
  union {
    struct {
      uint16_t APLLFBDIV:12;
    };
    struct {
      uint16_t APLLFBDIV0:1;
      uint16_t APLLFBDIV1:1;
      uint16_t APLLFBDIV2:1;
      uint16_t APLLFBDIV3:1;
      uint16_t APLLFBDIV4:1;
      uint16_t APLLFBDIV5:1;
      uint16_t APLLFBDIV6:1;
      uint16_t APLLFBDIV7:1;
      uint16_t APLLFBDIV8:1;
      uint16_t APLLFBDIV9:1;
      uint16_t APLLFBDIV10:1;
      uint16_t APLLFBDIV11:1;
    };
  };
} APLLFBD1BITS;
extern volatile APLLFBD1BITS APLLFBD1bits __attribute__((__sfr__));

