draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define FEXL FEXL
extern volatile uint16_t  FEXL __attribute__((__sfr__));
#define FEXH FEXH
extern volatile uint16_t  FEXH __attribute__((__sfr__));
typedef struct tagFEXHBITS {
  uint16_t FEXL:8;
} FEXHBITS;
extern volatile FEXHBITS FEXHbits __attribute__((__sfr__));

#define FEX2L FEX2L
extern volatile uint16_t  FEX2L __attribute__((__sfr__));
#define FEX2H FEX2H
extern volatile uint16_t  FEX2H __attribute__((__sfr__));
typedef struct tagFEX2HBITS {
  uint16_t FEX2H:8;
} FEX2HBITS;
extern volatile FEX2HBITS FEX2Hbits __attribute__((__sfr__));

#define VISI VISI
extern volatile uint16_t  VISI __attribute__((__sfr__));
#define DPCL DPCL
extern volatile uint16_t  DPCL __attribute__((__sfr__));
#define DPCH DPCH
extern volatile uint16_t  DPCH __attribute__((__sfr__));
typedef struct tagDPCHBITS {
  uint16_t DPCH:8;
} DPCHBITS;
extern volatile DPCHBITS DPCHbits __attribute__((__sfr__));

#define APPO APPO
extern volatile uint16_t  APPO __attribute__((__sfr__));
#define APPI APPI
extern volatile uint16_t  APPI __attribute__((__sfr__));
#define APPS APPS
extern volatile uint16_t  APPS __attribute__((__sfr__));
typedef struct tagAPPSBITS {
  uint16_t APIFUL:1;
  uint16_t APIOV:1;
  uint16_t APOFUL:1;
  uint16_t APOOV:1;
  uint16_t STRFUL:1;
} APPSBITS;
extern volatile APPSBITS APPSbits __attribute__((__sfr__));

#define STROUTL STROUTL
extern volatile uint16_t  STROUTL __attribute__((__sfr__));
#define STROUTH STROUTH
extern volatile uint16_t  STROUTH __attribute__((__sfr__));
#define STROVCNT STROVCNT
extern volatile uint16_t  STROVCNT __attribute__((__sfr__));
#define JDATAL JDATAL
extern volatile uint16_t  JDATAL __attribute__((__sfr__));
#define JDATAH JDATAH
extern volatile uint16_t  JDATAH __attribute__((__sfr__));


/* ---------------------------------------------------------- */
/* Defines for unique SFR bit names                           */
/* ---------------------------------------------------------- */

/* DSRPAG */
#define _DSRPAG DSRPAGbits.DSRPAG

/* DSWPAG */
#define _DSWPAG DSWPAGbits.DSWPAG

/* SR */
#define _C SRbits.C
#define _Z SRbits.Z
#define _OV SRbits.OV
#define _N SRbits.N
#define _RA SRbits.RA
#define _IPL SRbits.IPL
#define _DC SRbits.DC
#define _DA SRbits.DA
#define _SAB SRbits.SAB
#define _OAB SRbits.OAB
#define _SB SRbits.SB
#define _SA SRbits.SA
#define _OB SRbits.OB
#define _OA SRbits.OA
#define _IPL0 SRbits.IPL0
#define _IPL1 SRbits.IPL1
#define _IPL2 SRbits.IPL2

/* CORCON */
#define _IF CORCONbits.IF
#define _RND CORCONbits.RND
#define _SFA CORCONbits.SFA
#define _IPL3 CORCONbits.IPL3
#define _ACCSAT CORCONbits.ACCSAT
#define _SATDW CORCONbits.SATDW
#define _SATB CORCONbits.SATB
#define _SATA CORCONbits.SATA
#define _DL CORCONbits.DL
#define _EDT CORCONbits.EDT
#define _US CORCONbits.US
#define _VAR CORCONbits.VAR
#define _DL0 CORCONbits.DL0
#define _DL1 CORCONbits.DL1
#define _DL2 CORCONbits.DL2
#define _US0 CORCONbits.US0
#define _US1 CORCONbits.US1

/* MODCON */
#define _XWM MODCONbits.XWM
#define _YWM MODCONbits.YWM
#define _BWM MODCONbits.BWM
#define _YMODEN MODCONbits.YMODEN
#define _XMODEN MODCONbits.XMODEN
#define _XWM0 MODCONbits.XWM0
#define _XWM1 MODCONbits.XWM1
#define _XWM2 MODCONbits.XWM2
#define _XWM3 MODCONbits.XWM3
#define _YWM0 MODCONbits.YWM0
#define _YWM1 MODCONbits.YWM1
#define _YWM2 MODCONbits.YWM2
#define _YWM3 MODCONbits.YWM3
#define _BWM0 MODCONbits.BWM0
#define _BWM1 MODCONbits.BWM1
#define _BWM2 MODCONbits.BWM2
#define _BWM3 MODCONbits.BWM3

/* XBREV */
#define _XB XBREVbits.XB
#define _BREN XBREVbits.BREN
#define _XB0 XBREVbits.XB0
#define _XB1 XBREVbits.XB1
#define _XB2 XBREVbits.XB2
#define _XB3 XBREVbits.XB3
#define _XB4 XBREVbits.XB4
#define _XB5 XBREVbits.XB5
#define _XB6 XBREVbits.XB6
#define _XB7 XBREVbits.XB7
#define _XB8 XBREVbits.XB8
#define _XB9 XBREVbits.XB9
#define _XB10 XBREVbits.XB10
#define _XB11 XBREVbits.XB11
#define _XB12 XBREVbits.XB12
#define _XB13 XBREVbits.XB13
#define _XB14 XBREVbits.XB14

/* TBLPAG */
#define _TBLPAG TBLPAGbits.TBLPAG

/* YPAG */
#define _YPAG YPAGbits.YPAG

/* MSTRPR */
#define _NVMPR MSTRPRbits.NVMPR
#define _DMAPR MSTRPRbits.DMAPR

/* CTXTSTAT */
#define _MCTXI CTXTSTATbits.MCTXI
#define _CCTXI CTXTSTATbits.CCTXI

/* DMTCON */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* DMTPRECLR */
/* Bitname _STEP1 cannot be defined because it is used by more than one SFR */

/* DMTCLR */
/* Bitname _STEP2 cannot be defined because it is used by more than one SFR */

/* DMTSTAT */
#define _WINOPN DMTSTATbits.WINOPN
#define _DMTEVENT DMTSTATbits.DMTEVENT
#define _BAD2 DMTSTATbits.BAD2
#define _BAD1 DMTSTATbits.BAD1

/* SENT1CON1 */
/* Bitname _NIBCNT cannot be defined because it is used by more than one SFR */
/* Bitname _PS cannot be defined because it is used by more than one SFR */
/* Bitname _SPCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PPP cannot be defined because it is used by more than one SFR */
/* Bitname _CRCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _TXM cannot be defined because it is used by more than one SFR */
/* Bitname _RCVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SNTSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SNTEN cannot be defined because it is used by more than one SFR */

/* SENT1STAT */
/* Bitname _SYNCTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERR cannot be defined because it is used by more than one SFR */
/* Bitname _CRCERR cannot be defined because it is used by more than one SFR */
/* Bitname _NIB cannot be defined because it is used by more than one SFR */
/* Bitname _PAUSE cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
/* Bitname _NIB0 cannot be defined because it is used by more than one SFR */
/* Bitname _NIB1 cannot be defined because it is used by more than one SFR */
/* Bitname _NIB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */

/* SENT1DATL */
/* Bitname _CRC cannot be defined because it is used by more than one SFR */
/* Bitname _DATA6 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA5 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA4 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC2 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC3 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA60 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA61 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA62 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA63 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA50 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA51 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA52 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA53 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA40 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA41 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA42 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA43 cannot be defined because it is used by more than one SFR */

/* SENT1DATH */
/* Bitname _DATA3 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA2 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA1 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _DATA30 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA31 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA32 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA33 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA20 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA21 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA22 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA23 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA10 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA11 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA12 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA13 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT2 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT3 cannot be defined because it is used by more than one SFR */

/* SENT2CON1 */
/* Bitname _NIBCNT cannot be defined because it is used by more than one SFR */
/* Bitname _PS cannot be defined because it is used by more than one SFR */
/* Bitname _SPCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PPP cannot be defined because it is used by more than one SFR */
/* Bitname _CRCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _TXM cannot be defined because it is used by more than one SFR */
/* Bitname _RCVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SNTSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SNTEN cannot be defined because it is used by more than one SFR */

