draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/* IFS6 */
#define _ADCAN5IF IFS6bits.ADCAN5IF
#define _ADCAN6IF IFS6bits.ADCAN6IF
#define _ADCAN7IF IFS6bits.ADCAN7IF
#define _ADCAN8IF IFS6bits.ADCAN8IF
#define _ADCAN9IF IFS6bits.ADCAN9IF
#define _ADCAN10IF IFS6bits.ADCAN10IF
#define _ADCAN11IF IFS6bits.ADCAN11IF
#define _ADCAN12IF IFS6bits.ADCAN12IF
#define _ADCAN13IF IFS6bits.ADCAN13IF
#define _ADCAN14IF IFS6bits.ADCAN14IF
#define _ADCAN15IF IFS6bits.ADCAN15IF
#define _ADCAN16IF IFS6bits.ADCAN16IF
#define _ADCAN17IF IFS6bits.ADCAN17IF
#define _ADCAN18IF IFS6bits.ADCAN18IF
#define _ADCAN19IF IFS6bits.ADCAN19IF

/* IFS7 */
#define _ADFLTIF IFS7bits.ADFLTIF
#define _ADCMP0IF IFS7bits.ADCMP0IF
#define _ADCMP1IF IFS7bits.ADCMP1IF
#define _ADCMP2IF IFS7bits.ADCMP2IF
#define _ADCMP3IF IFS7bits.ADCMP3IF
#define _ADFLTR0IF IFS7bits.ADFLTR0IF
#define _ADFLTR1IF IFS7bits.ADFLTR1IF
#define _ADFLTR2IF IFS7bits.ADFLTR2IF
#define _ADFLTR3IF IFS7bits.ADFLTR3IF
#define _CLC1PIF IFS7bits.CLC1PIF
#define _CLC2PIF IFS7bits.CLC2PIF
#define _SPI1IF IFS7bits.SPI1IF
#define _SPI2IF IFS7bits.SPI2IF

/* IFS8 */
#define _SPI3IF IFS8bits.SPI3IF
#define _SI2C3IF IFS8bits.SI2C3IF
#define _MI2C3IF IFS8bits.MI2C3IF

/* IFS9 */
#define _I2C3BCIF IFS9bits.I2C3BCIF
#define _CCP7IF IFS9bits.CCP7IF
#define _CCT7IF IFS9bits.CCT7IF
#define _CCP8IF IFS9bits.CCP8IF
#define _CCT8IF IFS9bits.CCT8IF

/* IFS10 */
#define _ADC0EIF IFS10bits.ADC0EIF
#define _ADC1EIF IFS10bits.ADC1EIF
#define _ADFIFOIF IFS10bits.ADFIFOIF
#define _PEVTAIF IFS10bits.PEVTAIF
#define _PEVTBIF IFS10bits.PEVTBIF
#define _PEVTCIF IFS10bits.PEVTCIF
#define _PEVTDIF IFS10bits.PEVTDIF
#define _PEVTEIF IFS10bits.PEVTEIF
#define _PEVTFIF IFS10bits.PEVTFIF
#define _CLC3PIF IFS10bits.CLC3PIF

/* IFS11 */
#define _CLC4PIF IFS11bits.CLC4PIF
#define _CLC1NIF IFS11bits.CLC1NIF
#define _CLC2NIF IFS11bits.CLC2NIF
#define _CLC3NIF IFS11bits.CLC3NIF
#define _CLC4NIF IFS11bits.CLC4NIF
#define _CCP9IF IFS11bits.CCP9IF
#define _CCT9IF IFS11bits.CCT9IF
#define _U1EVTIF IFS11bits.U1EVTIF
#define _U2EVTIF IFS11bits.U2EVTIF
#define _U3EVTIF IFS11bits.U3EVTIF

/* IFS12 */
#define _ADCAN24IF IFS12bits.ADCAN24IF
#define _ADCAN25IF IFS12bits.ADCAN25IF
#define _PMPIF IFS12bits.PMPIF
#define _PMPEIF IFS12bits.PMPEIF

/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _T1IE IEC0bits.T1IE
#define _CNAIE IEC0bits.CNAIE
#define _CNBIE IEC0bits.CNBIE
#define _DMA0IE IEC0bits.DMA0IE
#define _CCP1IE IEC0bits.CCP1IE
#define _CCT1IE IEC0bits.CCT1IE
#define _DMA1IE IEC0bits.DMA1IE
#define _SPI1RXIE IEC0bits.SPI1RXIE
#define _SPI1TXIE IEC0bits.SPI1TXIE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _ECCSBEIE IEC0bits.ECCSBEIE
#define _NVMIE IEC0bits.NVMIE
#define _INT1IE IEC0bits.INT1IE

/* IEC1 */
#define _SI2C1IE IEC1bits.SI2C1IE
#define _MI2C1IE IEC1bits.MI2C1IE
#define _DMA2IE IEC1bits.DMA2IE
#define _CNCIE IEC1bits.CNCIE
#define _INT2IE IEC1bits.INT2IE
#define _DMA3IE IEC1bits.DMA3IE
#define _CCP2IE IEC1bits.CCP2IE
#define _CCT2IE IEC1bits.CCT2IE
#define _INT3IE IEC1bits.INT3IE
#define _U2RXIE IEC1bits.U2RXIE
#define _U2TXIE IEC1bits.U2TXIE
#define _SPI2RXIE IEC1bits.SPI2RXIE
#define _SPI2TXIE IEC1bits.SPI2TXIE

/* IEC2 */
#define _CCP3IE IEC2bits.CCP3IE
#define _CCT3IE IEC2bits.CCT3IE
#define _SI2C2IE IEC2bits.SI2C2IE
#define _MI2C2IE IEC2bits.MI2C2IE
#define _CCP4IE IEC2bits.CCP4IE
#define _CCT4IE IEC2bits.CCT4IE
#define _CCP5IE IEC2bits.CCP5IE
#define _CCT5IE IEC2bits.CCT5IE
#define _DMTIE IEC2bits.DMTIE
#define _CCP6IE IEC2bits.CCP6IE
#define _CCT6IE IEC2bits.CCT6IE

/* IEC3 */
#define _QEI1IE IEC3bits.QEI1IE
#define _U1EIE IEC3bits.U1EIE
#define _U2EIE IEC3bits.U2EIE
#define _CRCIE IEC3bits.CRCIE
#define _QEI2IE IEC3bits.QEI2IE
#define _U3EIE IEC3bits.U3EIE
#define _U3RXIE IEC3bits.U3RXIE
#define _U3TXIE IEC3bits.U3TXIE
#define _SPI3RXIE IEC3bits.SPI3RXIE
#define _SPI3TXIE IEC3bits.SPI3TXIE
#define _JTAGIE IEC3bits.JTAGIE
#define _PTGSTEPIE IEC3bits.PTGSTEPIE

/* IEC4 */
#define _I2C1BCIE IEC4bits.I2C1BCIE
#define _I2C2BCIE IEC4bits.I2C2BCIE
#define _PWM1IE IEC4bits.PWM1IE
#define _PWM2IE IEC4bits.PWM2IE
#define _PWM3IE IEC4bits.PWM3IE
#define _PWM4IE IEC4bits.PWM4IE
#define _PWM5IE IEC4bits.PWM5IE
#define _PWM6IE IEC4bits.PWM6IE
#define _PWM7IE IEC4bits.PWM7IE
#define _PWM8IE IEC4bits.PWM8IE
#define _CNDIE IEC4bits.CNDIE
#define _CMP1IE IEC4bits.CMP1IE
#define _CMP2IE IEC4bits.CMP2IE
#define _CMP3IE IEC4bits.CMP3IE

/* IEC5 */
#define _PTGWDTIE IEC5bits.PTGWDTIE
#define _PTG0IE IEC5bits.PTG0IE
#define _PTG1IE IEC5bits.PTG1IE
#define _PTG2IE IEC5bits.PTG2IE
#define _PTG3IE IEC5bits.PTG3IE
#define _SENT1IE IEC5bits.SENT1IE
#define _SENT1EIE IEC5bits.SENT1EIE
#define _SENT2IE IEC5bits.SENT2IE
#define _SENT2EIE IEC5bits.SENT2EIE
#define _ADCIE IEC5bits.ADCIE
#define _ADCAN0IE IEC5bits.ADCAN0IE
#define _ADCAN1IE IEC5bits.ADCAN1IE
#define _ADCAN2IE IEC5bits.ADCAN2IE
#define _ADCAN3IE IEC5bits.ADCAN3IE
#define _ADCAN4IE IEC5bits.ADCAN4IE

/* IEC6 */
#define _ADCAN5IE IEC6bits.ADCAN5IE
#define _ADCAN6IE IEC6bits.ADCAN6IE
#define _ADCAN7IE IEC6bits.ADCAN7IE
#define _ADCAN8IE IEC6bits.ADCAN8IE
#define _ADCAN9IE IEC6bits.ADCAN9IE
#define _ADCAN10IE IEC6bits.ADCAN10IE
#define _ADCAN11IE IEC6bits.ADCAN11IE
#define _ADCAN12IE IEC6bits.ADCAN12IE
#define _ADCAN13IE IEC6bits.ADCAN13IE
#define _ADCAN14IE IEC6bits.ADCAN14IE
#define _ADCAN15IE IEC6bits.ADCAN15IE
#define _ADCAN16IE IEC6bits.ADCAN16IE
#define _ADCAN17IE IEC6bits.ADCAN17IE
#define _ADCAN18IE IEC6bits.ADCAN18IE
#define _ADCAN19IE IEC6bits.ADCAN19IE

/* IEC7 */
#define _ADFLTIE IEC7bits.ADFLTIE
#define _ADCMP0IE IEC7bits.ADCMP0IE
#define _ADCMP1IE IEC7bits.ADCMP1IE
#define _ADCMP2IE IEC7bits.ADCMP2IE
#define _ADCMP3IE IEC7bits.ADCMP3IE
#define _ADFLTR0IE IEC7bits.ADFLTR0IE
#define _ADFLTR1IE IEC7bits.ADFLTR1IE
#define _ADFLTR2IE IEC7bits.ADFLTR2IE
#define _ADFLTR3IE IEC7bits.ADFLTR3IE
#define _CLC1PIE IEC7bits.CLC1PIE
#define _CLC2PIE IEC7bits.CLC2PIE
#define _SPI1IE IEC7bits.SPI1IE
#define _SPI2IE IEC7bits.SPI2IE

/* IEC8 */
#define _SPI3IE IEC8bits.SPI3IE
#define _SI2C3IE IEC8bits.SI2C3IE
#define _MI2C3IE IEC8bits.MI2C3IE

/* IEC9 */
#define _I2C3BCIE IEC9bits.I2C3BCIE
#define _CCP7IE IEC9bits.CCP7IE
#define _CCT7IE IEC9bits.CCT7IE
#define _CCP8IE IEC9bits.CCP8IE
#define _CCT8IE IEC9bits.CCT8IE

/* IEC10 */
#define _ADC0EIE IEC10bits.ADC0EIE
#define _ADC1EIE IEC10bits.ADC1EIE
#define _ADFIFOIE IEC10bits.ADFIFOIE
#define _PEVTAIE IEC10bits.PEVTAIE
#define _PEVTBIE IEC10bits.PEVTBIE
#define _PEVTCIE IEC10bits.PEVTCIE
#define _PEVTDIE IEC10bits.PEVTDIE
#define _PEVTEIE IEC10bits.PEVTEIE
#define _PEVTFIE IEC10bits.PEVTFIE
#define _CLC3PIE IEC10bits.CLC3PIE

/* IEC11 */
#define _CLC4PIE IEC11bits.CLC4PIE
#define _CLC1NIE IEC11bits.CLC1NIE
#define _CLC2NIE IEC11bits.CLC2NIE
#define _CLC3NIE IEC11bits.CLC3NIE
#define _CLC4NIE IEC11bits.CLC4NIE
#define _CCP9IE IEC11bits.CCP9IE
#define _CCT9IE IEC11bits.CCT9IE
#define _U1EVTIE IEC11bits.U1EVTIE
#define _U2EVTIE IEC11bits.U2EVTIE
#define _U3EVTIE IEC11bits.U3EVTIE

