draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/* INTCON3 */
#define _APLL INTCON3bits.APLL
#define _DOOVR INTCON3bits.DOOVR
#define _NAE INTCON3bits.NAE
#define _DMT INTCON3bits.DMT

/* INTCON4 */
#define _SGHT INTCON4bits.SGHT
#define _ECCDBE INTCON4bits.ECCDBE

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VHOLD INTTREGbits.VHOLD
#define _TMODE INTTREGbits.TMODE
#define _IRQCPU INTTREGbits.IRQCPU
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _VECNUM7 INTTREGbits.VECNUM7
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _URERR NVMCONbits.URERR
#define _RPDF NVMCONbits.RPDF
#define _P2ACTIV NVMCONbits.P2ACTIV
#define _SFTSWP NVMCONbits.SFTSWP
#define _NVMSIDL NVMCONbits.NVMSIDL
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3

/* NVMADR */
#define _NVMADRL NVMADRbits.NVMADRL
#define _NVMADR NVMADRbits.NVMADR

/* NVMADRH */
#define _NVMADRH NVMADRHbits.NVMADRH
#define _NVMADRU NVMADRHbits.NVMADRU

/* NVMSRCADDR */
#define _NVMSRCADRL NVMSRCADDRbits.NVMSRCADRL

/* NVMSRCADRH */
#define _NVMSRCADRH NVMSRCADRHbits.NVMSRCADRH

/* AMPCON1L */
#define _AMPEN1 AMPCON1Lbits.AMPEN1
#define _AMPEN2 AMPCON1Lbits.AMPEN2
#define _AMPEN3 AMPCON1Lbits.AMPEN3
#define _AMPON AMPCON1Lbits.AMPON

/* AMPCON1H */
#define _NCHDIS1 AMPCON1Hbits.NCHDIS1
#define _NCHDIS2 AMPCON1Hbits.NCHDIS2
#define _NCHDIS3 AMPCON1Hbits.NCHDIS3

/* BIASCON */
#define _I10EN0 BIASCONbits.I10EN0
#define _I10EN1 BIASCONbits.I10EN1
#define _I10EN2 BIASCONbits.I10EN2
#define _I10EN3 BIASCONbits.I10EN3
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* IBIASCONL */
#define _SNKEN0 IBIASCONLbits.SNKEN0
#define _SRCEN0 IBIASCONLbits.SRCEN0
#define _GENSNKEN0 IBIASCONLbits.GENSNKEN0
#define _GENSRCEN0 IBIASCONLbits.GENSRCEN0
#define _SHRSNKEN0 IBIASCONLbits.SHRSNKEN0
#define _SHRSRCEN0 IBIASCONLbits.SHRSRCEN0
#define _SNKEN1 IBIASCONLbits.SNKEN1
#define _SRCEN1 IBIASCONLbits.SRCEN1
#define _GENSNKEN1 IBIASCONLbits.GENSNKEN1
#define _GENSRCEN1 IBIASCONLbits.GENSRCEN1
#define _SHRSNKEN1 IBIASCONLbits.SHRSNKEN1
#define _SHRSRCEN1 IBIASCONLbits.SHRSRCEN1

/* IBIASCONH */
#define _SNKEN2 IBIASCONHbits.SNKEN2
#define _SRCEN2 IBIASCONHbits.SRCEN2
#define _GENSNKEN2 IBIASCONHbits.GENSNKEN2
#define _GENSRCEN2 IBIASCONHbits.GENSRCEN2
#define _SHRSNKEN2 IBIASCONHbits.SHRSNKEN2
#define _SHRSRCEN2 IBIASCONHbits.SHRSRCEN2
#define _SNKEN3 IBIASCONHbits.SNKEN3
#define _SRCEN3 IBIASCONHbits.SRCEN3
#define _GENSNKEN3 IBIASCONHbits.GENSNKEN3
#define _GENSRCEN3 IBIASCONHbits.GENSRCEN3
#define _SHRSNKEN3 IBIASCONHbits.SHRSNKEN3
#define _SHRSRCEN3 IBIASCONHbits.SHRSRCEN3

/* PTGCST */
#define _PTGITM PTGCSTbits.PTGITM
#define _PTGBUSY PTGCSTbits.PTGBUSY
#define _PTGWTO PTGCSTbits.PTGWTO
#define _PTGSTRT PTGCSTbits.PTGSTRT
#define _PTGIVIS PTGCSTbits.PTGIVIS
#define _PTGSSEN PTGCSTbits.PTGSSEN
#define _PTGSWT PTGCSTbits.PTGSWT
#define _PTGTOGL PTGCSTbits.PTGTOGL
#define _PTGSIDL PTGCSTbits.PTGSIDL
/* Bitname _PTGEN cannot be defined because it is used by more than one SFR */

/* PTGCON */
#define _PTGWDT PTGCONbits.PTGWDT
#define _PTGPWD PTGCONbits.PTGPWD
#define _PTGDIV PTGCONbits.PTGDIV
#define _PTGCLK PTGCONbits.PTGCLK

/* PTGBTE */
#define _PTGBTE0 PTGBTEbits.PTGBTE0
#define _PTGBTE1 PTGBTEbits.PTGBTE1
#define _PTGBTE2 PTGBTEbits.PTGBTE2
#define _PTGBTE3 PTGBTEbits.PTGBTE3
#define _PTGBTE4 PTGBTEbits.PTGBTE4
#define _PTGBTE5 PTGBTEbits.PTGBTE5
#define _PTGBTE6 PTGBTEbits.PTGBTE6
#define _PTGBTE7 PTGBTEbits.PTGBTE7
#define _PTGBTE8 PTGBTEbits.PTGBTE8
#define _PTGBTE9 PTGBTEbits.PTGBTE9
#define _PTGBTE10 PTGBTEbits.PTGBTE10
#define _PTGBTE11 PTGBTEbits.PTGBTE11
#define _PTGBTE12 PTGBTEbits.PTGBTE12
#define _PTGBTE13 PTGBTEbits.PTGBTE13
#define _PTGBTE14 PTGBTEbits.PTGBTE14
#define _PTGBTE15 PTGBTEbits.PTGBTE15

/* PTGBTEH */
#define _PTGBTE16 PTGBTEHbits.PTGBTE16
#define _PTGBTE17 PTGBTEHbits.PTGBTE17
#define _PTGBTE18 PTGBTEHbits.PTGBTE18
#define _PTGBTE19 PTGBTEHbits.PTGBTE19
#define _PTGBTE20 PTGBTEHbits.PTGBTE20
#define _PTGBTE21 PTGBTEHbits.PTGBTE21
#define _PTGBTE22 PTGBTEHbits.PTGBTE22
#define _PTGBTE23 PTGBTEHbits.PTGBTE23
#define _PTGBTE24 PTGBTEHbits.PTGBTE24
#define _PTGBTE25 PTGBTEHbits.PTGBTE25
#define _PTGBTE26 PTGBTEHbits.PTGBTE26
#define _PTGBTE27 PTGBTEHbits.PTGBTE27
#define _PTGBTE28 PTGBTEHbits.PTGBTE28
#define _PTGBTE29 PTGBTEHbits.PTGBTE29
#define _PTGBTE30 PTGBTEHbits.PTGBTE30
#define _PTGBTE31 PTGBTEHbits.PTGBTE31

/* PTGQPTR */
#define _PTGQPTR PTGQPTRbits.PTGQPTR

/* PTGQUE0 */
#define _STEP0 PTGQUE0bits.STEP0
/* Bitname _STEP1 cannot be defined because it is used by more than one SFR */

/* PTGQUE1 */
/* Bitname _STEP2 cannot be defined because it is used by more than one SFR */
#define _STEP3 PTGQUE1bits.STEP3

/* PTGQUE2 */
#define _STEP4 PTGQUE2bits.STEP4
#define _STEP5 PTGQUE2bits.STEP5

/* PTGQUE3 */
#define _STEP6 PTGQUE3bits.STEP6
#define _STEP7 PTGQUE3bits.STEP7

/* PTGQUE4 */
#define _STEP8 PTGQUE4bits.STEP8
#define _STEP9 PTGQUE4bits.STEP9

/* PTGQUE5 */
#define _STEP10 PTGQUE5bits.STEP10
#define _STEP11 PTGQUE5bits.STEP11

/* PTGQUE6 */
#define _STEP12 PTGQUE6bits.STEP12
#define _STEP13 PTGQUE6bits.STEP13

/* PTGQUE7 */
#define _STEP14 PTGQUE7bits.STEP14
#define _STEP15 PTGQUE7bits.STEP15

/* PTGQUE8 */
#define _STEP16 PTGQUE8bits.STEP16
#define _STEP17 PTGQUE8bits.STEP17

/* PTGQUE9 */
#define _STEP18 PTGQUE9bits.STEP18
#define _STEP19 PTGQUE9bits.STEP19

/* PTGQUE10 */
#define _STEP20 PTGQUE10bits.STEP20
#define _STEP21 PTGQUE10bits.STEP21

/* PTGQUE11 */
#define _STEP22 PTGQUE11bits.STEP22
#define _STEP23 PTGQUE11bits.STEP23

