draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/* ADCORE1H */
/* Bitname _ADCS cannot be defined because it is used by more than one SFR */
/* Bitname _RES cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS6 cannot be defined because it is used by more than one SFR */
/* Bitname _RES0 cannot be defined because it is used by more than one SFR */
/* Bitname _RES1 cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL2 cannot be defined because it is used by more than one SFR */

/* ADEIEL */
#define _EIEN0 ADEIELbits.EIEN0
#define _EIEN1 ADEIELbits.EIEN1
#define _EIEN2 ADEIELbits.EIEN2
#define _EIEN3 ADEIELbits.EIEN3
#define _EIEN4 ADEIELbits.EIEN4
#define _EIEN5 ADEIELbits.EIEN5
#define _EIEN6 ADEIELbits.EIEN6
#define _EIEN7 ADEIELbits.EIEN7
#define _EIEN8 ADEIELbits.EIEN8
#define _EIEN9 ADEIELbits.EIEN9
#define _EIEN10 ADEIELbits.EIEN10
#define _EIEN11 ADEIELbits.EIEN11
#define _EIEN12 ADEIELbits.EIEN12
#define _EIEN13 ADEIELbits.EIEN13
#define _EIEN14 ADEIELbits.EIEN14
#define _EIEN15 ADEIELbits.EIEN15

/* ADEIEH */
#define _EIEN16 ADEIEHbits.EIEN16
#define _EIEN17 ADEIEHbits.EIEN17
#define _EIEN18 ADEIEHbits.EIEN18
#define _EIEN19 ADEIEHbits.EIEN19
#define _EIEN24 ADEIEHbits.EIEN24
#define _EIEN25 ADEIEHbits.EIEN25

/* ADEISTATL */
#define _EISTAT0 ADEISTATLbits.EISTAT0
#define _EISTAT1 ADEISTATLbits.EISTAT1
#define _EISTAT2 ADEISTATLbits.EISTAT2
#define _EISTAT3 ADEISTATLbits.EISTAT3
#define _EISTAT4 ADEISTATLbits.EISTAT4
#define _EISTAT5 ADEISTATLbits.EISTAT5
#define _EISTAT6 ADEISTATLbits.EISTAT6
#define _EISTAT7 ADEISTATLbits.EISTAT7
#define _EISTAT8 ADEISTATLbits.EISTAT8
#define _EISTAT9 ADEISTATLbits.EISTAT9
#define _EISTAT10 ADEISTATLbits.EISTAT10
#define _EISTAT11 ADEISTATLbits.EISTAT11
#define _EISTAT12 ADEISTATLbits.EISTAT12
#define _EISTAT13 ADEISTATLbits.EISTAT13
#define _EISTAT14 ADEISTATLbits.EISTAT14
#define _EISTAT15 ADEISTATLbits.EISTAT15

/* ADEISTATH */
#define _EISTAT16 ADEISTATHbits.EISTAT16
#define _EISTAT17 ADEISTATHbits.EISTAT17
#define _EISTAT18 ADEISTATHbits.EISTAT18
#define _EISTAT19 ADEISTATHbits.EISTAT19
#define _EISTAT24 ADEISTATHbits.EISTAT24
#define _EISTAT25 ADEISTATHbits.EISTAT25

/* ADCON5L */
#define _C0PWR ADCON5Lbits.C0PWR
#define _C1PWR ADCON5Lbits.C1PWR
#define _SHRPWR ADCON5Lbits.SHRPWR
#define _C0RDY ADCON5Lbits.C0RDY
#define _C1RDY ADCON5Lbits.C1RDY
#define _SHRRDY ADCON5Lbits.SHRRDY

/* ADCON5H */
#define _C0CIE ADCON5Hbits.C0CIE
#define _C1CIE ADCON5Hbits.C1CIE
#define _SHRCIE ADCON5Hbits.SHRCIE
#define _WARMTIME ADCON5Hbits.WARMTIME
#define _C0C1E ADCON5Hbits.C0C1E
#define _C1C1E ADCON5Hbits.C1C1E

/* DACCTRL1L */
#define _FCLKDIV DACCTRL1Lbits.FCLKDIV
/* Bitname _CLKDIV cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
#define _DACSIDL DACCTRL1Lbits.DACSIDL
#define _DACON DACCTRL1Lbits.DACON
#define _FCLKDIV0 DACCTRL1Lbits.FCLKDIV0
#define _FCLKDIV1 DACCTRL1Lbits.FCLKDIV1
#define _FCLKDIV2 DACCTRL1Lbits.FCLKDIV2
/* Bitname _CLKDIV0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKDIV1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL1 cannot be defined because it is used by more than one SFR */

/* DACCTRL2L */
#define _TMODTIME DACCTRL2Lbits.TMODTIME
#define _TMODTIME0 DACCTRL2Lbits.TMODTIME0
#define _TMODTIME1 DACCTRL2Lbits.TMODTIME1
#define _TMODTIME2 DACCTRL2Lbits.TMODTIME2
#define _TMODTIME3 DACCTRL2Lbits.TMODTIME3
#define _TMODTIME4 DACCTRL2Lbits.TMODTIME4
#define _TMODTIME5 DACCTRL2Lbits.TMODTIME5
#define _TMODTIME6 DACCTRL2Lbits.TMODTIME6
#define _TMODTIME7 DACCTRL2Lbits.TMODTIME7
#define _TMODTIME8 DACCTRL2Lbits.TMODTIME8
#define _TMODTIME9 DACCTRL2Lbits.TMODTIME9

/* DACCTRL2H */
#define _SSTIME DACCTRL2Hbits.SSTIME
#define _SSTIME0 DACCTRL2Hbits.SSTIME0
#define _SSTIME1 DACCTRL2Hbits.SSTIME1
#define _SSTIME2 DACCTRL2Hbits.SSTIME2
#define _SSTIME3 DACCTRL2Hbits.SSTIME3
#define _SSTIME4 DACCTRL2Hbits.SSTIME4
#define _SSTIME5 DACCTRL2Hbits.SSTIME5
#define _SSTIME6 DACCTRL2Hbits.SSTIME6
#define _SSTIME7 DACCTRL2Hbits.SSTIME7
#define _SSTIME8 DACCTRL2Hbits.SSTIME8
#define _SSTIME9 DACCTRL2Hbits.SSTIME9

/* DAC1CONL */
/* Bitname _HYSSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HYSPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPPOL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _DACOEN cannot be defined because it is used by more than one SFR */
/* Bitname _CBE cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM1 cannot be defined because it is used by more than one SFR */

/* DAC1CONH */
/* Bitname _TMCB cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB6 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB7 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB8 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB9 cannot be defined because it is used by more than one SFR */

