draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/* DAC2DATH */
/* Bitname _DACDAT cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH11 cannot be defined because it is used by more than one SFR */

/* SLP2CONL */
/* Bitname _SLPSTRT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL3 cannot be defined because it is used by more than one SFR */

/* SLP2CONH */
/* Bitname _PSE cannot be defined because it is used by more than one SFR */
/* Bitname _TWME cannot be defined because it is used by more than one SFR */
/* Bitname _HME cannot be defined because it is used by more than one SFR */
/* Bitname _SLOPEN cannot be defined because it is used by more than one SFR */

/* SLP2DAT */
/* Bitname _SLPDAT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT4 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT5 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT6 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT7 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT8 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT9 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT10 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT11 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT12 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT13 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT14 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT15 cannot be defined because it is used by more than one SFR */

/* DAC3CONL */
/* Bitname _HYSSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HYSPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPPOL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _DACOEN cannot be defined because it is used by more than one SFR */
/* Bitname _CBE cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM1 cannot be defined because it is used by more than one SFR */

/* DAC3CONH */
/* Bitname _TMCB cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB6 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB7 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB8 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB9 cannot be defined because it is used by more than one SFR */

/* DAC3DATL */
/* Bitname _DACLOW cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL11 cannot be defined because it is used by more than one SFR */

/* DAC3DATH */
/* Bitname _DACDAT cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH11 cannot be defined because it is used by more than one SFR */

