draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/* RPINR44 */
#define _PCI16R RPINR44bits.PCI16R
#define _SENT1R RPINR44bits.SENT1R

/* RPINR45 */
#define _SENT2R RPINR45bits.SENT2R
#define _CLCINAR RPINR45bits.CLCINAR

/* RPINR46 */
#define _CLCINBR RPINR46bits.CLCINBR
#define _CLCINCR RPINR46bits.CLCINCR

/* RPINR47 */
#define _CLCINDR RPINR47bits.CLCINDR
#define _ADCTRGR RPINR47bits.ADCTRGR

/* RPINR48 */
#define _OCFDR RPINR48bits.OCFDR
#define _U1CTSR RPINR48bits.U1CTSR

/* RPINR49 */
#define _U2CTSR RPINR49bits.U2CTSR
#define _U3CTSR RPINR49bits.U3CTSR

/* RPOR0 */
#define _RP32R RPOR0bits.RP32R
#define _RP33R RPOR0bits.RP33R

/* RPOR1 */
#define _RP34R RPOR1bits.RP34R
#define _RP35R RPOR1bits.RP35R

/* RPOR2 */
#define _RP36R RPOR2bits.RP36R
#define _RP37R RPOR2bits.RP37R

/* RPOR3 */
#define _RP38R RPOR3bits.RP38R
#define _RP39R RPOR3bits.RP39R

/* RPOR4 */
#define _RP40R RPOR4bits.RP40R
#define _RP41R RPOR4bits.RP41R

/* RPOR5 */
#define _RP42R RPOR5bits.RP42R
#define _RP43R RPOR5bits.RP43R

/* RPOR6 */
#define _RP44R RPOR6bits.RP44R
#define _RP45R RPOR6bits.RP45R

/* RPOR7 */
#define _RP46R RPOR7bits.RP46R
#define _RP47R RPOR7bits.RP47R

/* RPOR8 */
#define _RP48R RPOR8bits.RP48R
#define _RP49R RPOR8bits.RP49R

/* RPOR9 */
#define _RP50R RPOR9bits.RP50R
#define _RP51R RPOR9bits.RP51R

/* RPOR10 */
#define _RP52R RPOR10bits.RP52R
#define _RP53R RPOR10bits.RP53R

/* RPOR11 */
#define _RP54R RPOR11bits.RP54R
#define _RP55R RPOR11bits.RP55R

/* RPOR12 */
#define _RP56R RPOR12bits.RP56R
#define _RP57R RPOR12bits.RP57R

/* RPOR13 */
#define _RP58R RPOR13bits.RP58R
#define _RP59R RPOR13bits.RP59R

/* RPOR14 */
#define _RP60R RPOR14bits.RP60R
#define _RP61R RPOR14bits.RP61R

/* RPOR15 */
#define _RP62R RPOR15bits.RP62R
#define _RP63R RPOR15bits.RP63R

/* RPOR16 */
#define _RP64R RPOR16bits.RP64R
#define _RP65R RPOR16bits.RP65R

/* RPOR17 */
#define _RP66R RPOR17bits.RP66R
#define _RP67R RPOR17bits.RP67R

/* RPOR18 */
#define _RP68R RPOR18bits.RP68R
#define _RP69R RPOR18bits.RP69R

/* RPOR19 */
#define _RP70R RPOR19bits.RP70R
#define _RP71R RPOR19bits.RP71R

/* RPOR20 */
#define _RP72R RPOR20bits.RP72R
#define _RP73R RPOR20bits.RP73R

/* RPOR21 */
#define _RP74R RPOR21bits.RP74R
#define _RP75R RPOR21bits.RP75R

/* RPOR22 */
#define _RP76R RPOR22bits.RP76R
#define _RP77R RPOR22bits.RP77R

/* RPOR23 */
#define _RP78R RPOR23bits.RP78R
#define _RP79R RPOR23bits.RP79R

/* RPOR24 */
#define _RP176R RPOR24bits.RP176R
#define _RP177R RPOR24bits.RP177R

/* RPOR25 */
#define _RP178R RPOR25bits.RP178R
#define _RP179R RPOR25bits.RP179R

/* RPOR26 */
#define _RP180R RPOR26bits.RP180R
#define _RP181R RPOR26bits.RP181R

/* ANSELA */
#define _ANSELA0 ANSELAbits.ANSELA0
#define _ANSELA1 ANSELAbits.ANSELA1
#define _ANSELA2 ANSELAbits.ANSELA2
#define _ANSELA3 ANSELAbits.ANSELA3
#define _ANSELA4 ANSELAbits.ANSELA4

/* TRISA */
#define _TRISA0 TRISAbits.TRISA0
#define _TRISA1 TRISAbits.TRISA1
#define _TRISA2 TRISAbits.TRISA2
#define _TRISA3 TRISAbits.TRISA3
#define _TRISA4 TRISAbits.TRISA4

/* PORTA */
#define _RA0 PORTAbits.RA0
#define _RA1 PORTAbits.RA1
#define _RA2 PORTAbits.RA2
#define _RA3 PORTAbits.RA3
#define _RA4 PORTAbits.RA4

/* LATA */
#define _LATA0 LATAbits.LATA0
#define _LATA1 LATAbits.LATA1
#define _LATA2 LATAbits.LATA2
#define _LATA3 LATAbits.LATA3
#define _LATA4 LATAbits.LATA4

/* ODCA */
#define _ODCA0 ODCAbits.ODCA0
#define _ODCA1 ODCAbits.ODCA1
#define _ODCA2 ODCAbits.ODCA2
#define _ODCA3 ODCAbits.ODCA3
#define _ODCA4 ODCAbits.ODCA4

/* CNPUA */
#define _CNPUA0 CNPUAbits.CNPUA0
#define _CNPUA1 CNPUAbits.CNPUA1
#define _CNPUA2 CNPUAbits.CNPUA2
#define _CNPUA3 CNPUAbits.CNPUA3
#define _CNPUA4 CNPUAbits.CNPUA4

/* CNPDA */
#define _CNPDA0 CNPDAbits.CNPDA0
#define _CNPDA1 CNPDAbits.CNPDA1
#define _CNPDA2 CNPDAbits.CNPDA2
#define _CNPDA3 CNPDAbits.CNPDA3
#define _CNPDA4 CNPDAbits.CNPDA4

/* CNCONA */
/* Bitname _CNSTYLE cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* CNEN0A */
#define _CNEN0A0 CNEN0Abits.CNEN0A0
#define _CNEN0A1 CNEN0Abits.CNEN0A1
#define _CNEN0A2 CNEN0Abits.CNEN0A2
#define _CNEN0A3 CNEN0Abits.CNEN0A3
#define _CNEN0A4 CNEN0Abits.CNEN0A4

/* CNSTATA */
#define _CNSTATA0 CNSTATAbits.CNSTATA0
#define _CNSTATA1 CNSTATAbits.CNSTATA1
#define _CNSTATA2 CNSTATAbits.CNSTATA2
#define _CNSTATA3 CNSTATAbits.CNSTATA3
#define _CNSTATA4 CNSTATAbits.CNSTATA4

/* CNEN1A */
#define _CNEN1A0 CNEN1Abits.CNEN1A0
#define _CNEN1A1 CNEN1Abits.CNEN1A1
#define _CNEN1A2 CNEN1Abits.CNEN1A2
#define _CNEN1A3 CNEN1Abits.CNEN1A3
#define _CNEN1A4 CNEN1Abits.CNEN1A4

/* CNFA */
#define _CNFA0 CNFAbits.CNFA0
#define _CNFA1 CNFAbits.CNFA1
#define _CNFA2 CNFAbits.CNFA2
#define _CNFA3 CNFAbits.CNFA3
#define _CNFA4 CNFAbits.CNFA4

/* ANSELB */
#define _ANSELB0 ANSELBbits.ANSELB0
#define _ANSELB1 ANSELBbits.ANSELB1
#define _ANSELB2 ANSELBbits.ANSELB2
#define _ANSELB3 ANSELBbits.ANSELB3
#define _ANSELB4 ANSELBbits.ANSELB4
#define _ANSELB7 ANSELBbits.ANSELB7
#define _ANSELB8 ANSELBbits.ANSELB8
#define _ANSELB9 ANSELBbits.ANSELB9

/* TRISB */
#define _TRISB0 TRISBbits.TRISB0
#define _TRISB1 TRISBbits.TRISB1
#define _TRISB2 TRISBbits.TRISB2
#define _TRISB3 TRISBbits.TRISB3
#define _TRISB4 TRISBbits.TRISB4
#define _TRISB5 TRISBbits.TRISB5
#define _TRISB6 TRISBbits.TRISB6
#define _TRISB7 TRISBbits.TRISB7
#define _TRISB8 TRISBbits.TRISB8
#define _TRISB9 TRISBbits.TRISB9
#define _TRISB10 TRISBbits.TRISB10
#define _TRISB11 TRISBbits.TRISB11
#define _TRISB12 TRISBbits.TRISB12
#define _TRISB13 TRISBbits.TRISB13
#define _TRISB14 TRISBbits.TRISB14
#define _TRISB15 TRISBbits.TRISB15

/* PORTB */
#define _RB0 PORTBbits.RB0
#define _RB1 PORTBbits.RB1
#define _RB2 PORTBbits.RB2
#define _RB3 PORTBbits.RB3
#define _RB4 PORTBbits.RB4
#define _RB5 PORTBbits.RB5
#define _RB6 PORTBbits.RB6
#define _RB7 PORTBbits.RB7
#define _RB8 PORTBbits.RB8
#define _RB9 PORTBbits.RB9
#define _RB10 PORTBbits.RB10
#define _RB11 PORTBbits.RB11
#define _RB12 PORTBbits.RB12
#define _RB13 PORTBbits.RB13
#define _RB14 PORTBbits.RB14
#define _RB15 PORTBbits.RB15

