draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/* LATB */
#define _LATB0 LATBbits.LATB0
#define _LATB1 LATBbits.LATB1
#define _LATB2 LATBbits.LATB2
#define _LATB3 LATBbits.LATB3
#define _LATB4 LATBbits.LATB4
#define _LATB5 LATBbits.LATB5
#define _LATB6 LATBbits.LATB6
#define _LATB7 LATBbits.LATB7
#define _LATB8 LATBbits.LATB8
#define _LATB9 LATBbits.LATB9
#define _LATB10 LATBbits.LATB10
#define _LATB11 LATBbits.LATB11
#define _LATB12 LATBbits.LATB12
#define _LATB13 LATBbits.LATB13
#define _LATB14 LATBbits.LATB14
#define _LATB15 LATBbits.LATB15

/* ODCB */
#define _ODCB0 ODCBbits.ODCB0
#define _ODCB1 ODCBbits.ODCB1
#define _ODCB2 ODCBbits.ODCB2
#define _ODCB3 ODCBbits.ODCB3
#define _ODCB4 ODCBbits.ODCB4
#define _ODCB5 ODCBbits.ODCB5
#define _ODCB6 ODCBbits.ODCB6
#define _ODCB7 ODCBbits.ODCB7
#define _ODCB8 ODCBbits.ODCB8
#define _ODCB9 ODCBbits.ODCB9
#define _ODCB10 ODCBbits.ODCB10
#define _ODCB11 ODCBbits.ODCB11
#define _ODCB12 ODCBbits.ODCB12
#define _ODCB13 ODCBbits.ODCB13
#define _ODCB14 ODCBbits.ODCB14
#define _ODCB15 ODCBbits.ODCB15

/* CNPUB */
#define _CNPUB0 CNPUBbits.CNPUB0
#define _CNPUB1 CNPUBbits.CNPUB1
#define _CNPUB2 CNPUBbits.CNPUB2
#define _CNPUB3 CNPUBbits.CNPUB3
#define _CNPUB4 CNPUBbits.CNPUB4
#define _CNPUB5 CNPUBbits.CNPUB5
#define _CNPUB6 CNPUBbits.CNPUB6
#define _CNPUB7 CNPUBbits.CNPUB7
#define _CNPUB8 CNPUBbits.CNPUB8
#define _CNPUB9 CNPUBbits.CNPUB9
#define _CNPUB10 CNPUBbits.CNPUB10
#define _CNPUB11 CNPUBbits.CNPUB11
#define _CNPUB12 CNPUBbits.CNPUB12
#define _CNPUB13 CNPUBbits.CNPUB13
#define _CNPUB14 CNPUBbits.CNPUB14
#define _CNPUB15 CNPUBbits.CNPUB15

/* CNPDB */
#define _CNPDB0 CNPDBbits.CNPDB0
#define _CNPDB1 CNPDBbits.CNPDB1
#define _CNPDB2 CNPDBbits.CNPDB2
#define _CNPDB3 CNPDBbits.CNPDB3
#define _CNPDB4 CNPDBbits.CNPDB4
#define _CNPDB5 CNPDBbits.CNPDB5
#define _CNPDB6 CNPDBbits.CNPDB6
#define _CNPDB7 CNPDBbits.CNPDB7
#define _CNPDB8 CNPDBbits.CNPDB8
#define _CNPDB9 CNPDBbits.CNPDB9
#define _CNPDB10 CNPDBbits.CNPDB10
#define _CNPDB11 CNPDBbits.CNPDB11
#define _CNPDB12 CNPDBbits.CNPDB12
#define _CNPDB13 CNPDBbits.CNPDB13
#define _CNPDB14 CNPDBbits.CNPDB14
#define _CNPDB15 CNPDBbits.CNPDB15

/* CNCONB */
/* Bitname _CNSTYLE cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* CNEN0B */
#define _CNEN0B0 CNEN0Bbits.CNEN0B0
#define _CNEN0B1 CNEN0Bbits.CNEN0B1
#define _CNEN0B2 CNEN0Bbits.CNEN0B2
#define _CNEN0B3 CNEN0Bbits.CNEN0B3
#define _CNEN0B4 CNEN0Bbits.CNEN0B4
#define _CNEN0B5 CNEN0Bbits.CNEN0B5
#define _CNEN0B6 CNEN0Bbits.CNEN0B6
#define _CNEN0B7 CNEN0Bbits.CNEN0B7
#define _CNEN0B8 CNEN0Bbits.CNEN0B8
#define _CNEN0B9 CNEN0Bbits.CNEN0B9
#define _CNEN0B10 CNEN0Bbits.CNEN0B10
#define _CNEN0B11 CNEN0Bbits.CNEN0B11
#define _CNEN0B12 CNEN0Bbits.CNEN0B12
#define _CNEN0B13 CNEN0Bbits.CNEN0B13
#define _CNEN0B14 CNEN0Bbits.CNEN0B14
#define _CNEN0B15 CNEN0Bbits.CNEN0B15

/* CNSTATB */
#define _CNSTATB0 CNSTATBbits.CNSTATB0
#define _CNSTATB1 CNSTATBbits.CNSTATB1
#define _CNSTATB2 CNSTATBbits.CNSTATB2
#define _CNSTATB3 CNSTATBbits.CNSTATB3
#define _CNSTATB4 CNSTATBbits.CNSTATB4
#define _CNSTATB5 CNSTATBbits.CNSTATB5
#define _CNSTATB6 CNSTATBbits.CNSTATB6
#define _CNSTATB7 CNSTATBbits.CNSTATB7
#define _CNSTATB8 CNSTATBbits.CNSTATB8
#define _CNSTATB9 CNSTATBbits.CNSTATB9
#define _CNSTATB10 CNSTATBbits.CNSTATB10
#define _CNSTATB11 CNSTATBbits.CNSTATB11
#define _CNSTATB12 CNSTATBbits.CNSTATB12
#define _CNSTATB13 CNSTATBbits.CNSTATB13
#define _CNSTATB14 CNSTATBbits.CNSTATB14
#define _CNSTATB15 CNSTATBbits.CNSTATB15

/* CNEN1B */
#define _CNEN1B0 CNEN1Bbits.CNEN1B0
#define _CNEN1B1 CNEN1Bbits.CNEN1B1
#define _CNEN1B2 CNEN1Bbits.CNEN1B2
#define _CNEN1B3 CNEN1Bbits.CNEN1B3
#define _CNEN1B4 CNEN1Bbits.CNEN1B4
#define _CNEN1B5 CNEN1Bbits.CNEN1B5
#define _CNEN1B6 CNEN1Bbits.CNEN1B6
#define _CNEN1B7 CNEN1Bbits.CNEN1B7
#define _CNEN1B8 CNEN1Bbits.CNEN1B8
#define _CNEN1B9 CNEN1Bbits.CNEN1B9
#define _CNEN1B10 CNEN1Bbits.CNEN1B10
#define _CNEN1B11 CNEN1Bbits.CNEN1B11
#define _CNEN1B12 CNEN1Bbits.CNEN1B12
#define _CNEN1B13 CNEN1Bbits.CNEN1B13
#define _CNEN1B14 CNEN1Bbits.CNEN1B14
#define _CNEN1B15 CNEN1Bbits.CNEN1B15

/* CNFB */
#define _CNFB0 CNFBbits.CNFB0
#define _CNFB1 CNFBbits.CNFB1
#define _CNFB2 CNFBbits.CNFB2
#define _CNFB3 CNFBbits.CNFB3
#define _CNFB4 CNFBbits.CNFB4
#define _CNFB5 CNFBbits.CNFB5
#define _CNFB6 CNFBbits.CNFB6
#define _CNFB7 CNFBbits.CNFB7
#define _CNFB8 CNFBbits.CNFB8
#define _CNFB9 CNFBbits.CNFB9
#define _CNFB10 CNFBbits.CNFB10
#define _CNFB11 CNFBbits.CNFB11
#define _CNFB12 CNFBbits.CNFB12
#define _CNFB13 CNFBbits.CNFB13
#define _CNFB14 CNFBbits.CNFB14
#define _CNFB15 CNFBbits.CNFB15

/* ANSELC */
#define _ANSELC0 ANSELCbits.ANSELC0
#define _ANSELC1 ANSELCbits.ANSELC1
#define _ANSELC2 ANSELCbits.ANSELC2
#define _ANSELC3 ANSELCbits.ANSELC3
#define _ANSELC6 ANSELCbits.ANSELC6
#define _ANSELC7 ANSELCbits.ANSELC7

/* TRISC */
#define _TRISC0 TRISCbits.TRISC0
#define _TRISC1 TRISCbits.TRISC1
#define _TRISC2 TRISCbits.TRISC2
#define _TRISC3 TRISCbits.TRISC3
#define _TRISC4 TRISCbits.TRISC4
#define _TRISC5 TRISCbits.TRISC5
#define _TRISC6 TRISCbits.TRISC6
#define _TRISC7 TRISCbits.TRISC7
#define _TRISC8 TRISCbits.TRISC8
#define _TRISC9 TRISCbits.TRISC9
#define _TRISC10 TRISCbits.TRISC10
#define _TRISC11 TRISCbits.TRISC11
#define _TRISC12 TRISCbits.TRISC12
#define _TRISC13 TRISCbits.TRISC13
#define _TRISC14 TRISCbits.TRISC14
#define _TRISC15 TRISCbits.TRISC15

/* PORTC */
#define _RC0 PORTCbits.RC0
#define _RC1 PORTCbits.RC1
#define _RC2 PORTCbits.RC2
#define _RC3 PORTCbits.RC3
#define _RC4 PORTCbits.RC4
#define _RC5 PORTCbits.RC5
#define _RC6 PORTCbits.RC6
#define _RC7 PORTCbits.RC7
#define _RC8 PORTCbits.RC8
#define _RC9 PORTCbits.RC9
#define _RC10 PORTCbits.RC10
#define _RC11 PORTCbits.RC11
#define _RC12 PORTCbits.RC12
#define _RC13 PORTCbits.RC13
#define _RC14 PORTCbits.RC14
#define _RC15 PORTCbits.RC15

/* LATC */
#define _LATC0 LATCbits.LATC0
#define _LATC1 LATCbits.LATC1
#define _LATC2 LATCbits.LATC2
#define _LATC3 LATCbits.LATC3
#define _LATC4 LATCbits.LATC4
#define _LATC5 LATCbits.LATC5
#define _LATC6 LATCbits.LATC6
#define _LATC7 LATCbits.LATC7
#define _LATC8 LATCbits.LATC8
#define _LATC9 LATCbits.LATC9
#define _LATC10 LATCbits.LATC10
#define _LATC11 LATCbits.LATC11
#define _LATC12 LATCbits.LATC12
#define _LATC13 LATCbits.LATC13
#define _LATC14 LATCbits.LATC14
#define _LATC15 LATCbits.LATC15

/* ODCC */
#define _ODCC0 ODCCbits.ODCC0
#define _ODCC1 ODCCbits.ODCC1
#define _ODCC2 ODCCbits.ODCC2
#define _ODCC3 ODCCbits.ODCC3
#define _ODCC4 ODCCbits.ODCC4
#define _ODCC5 ODCCbits.ODCC5
#define _ODCC6 ODCCbits.ODCC6
#define _ODCC7 ODCCbits.ODCC7
#define _ODCC8 ODCCbits.ODCC8
#define _ODCC9 ODCCbits.ODCC9
#define _ODCC10 ODCCbits.ODCC10
#define _ODCC11 ODCCbits.ODCC11
#define _ODCC12 ODCCbits.ODCC12
#define _ODCC13 ODCCbits.ODCC13
#define _ODCC14 ODCCbits.ODCC14
#define _ODCC15 ODCCbits.ODCC15

/* CNPUC */
#define _CNPUC0 CNPUCbits.CNPUC0
#define _CNPUC1 CNPUCbits.CNPUC1
#define _CNPUC2 CNPUCbits.CNPUC2
#define _CNPUC3 CNPUCbits.CNPUC3
#define _CNPUC4 CNPUCbits.CNPUC4
#define _CNPUC5 CNPUCbits.CNPUC5
#define _CNPUC6 CNPUCbits.CNPUC6
#define _CNPUC7 CNPUCbits.CNPUC7
#define _CNPUC8 CNPUCbits.CNPUC8
#define _CNPUC9 CNPUCbits.CNPUC9
#define _CNPUC10 CNPUCbits.CNPUC10
#define _CNPUC11 CNPUCbits.CNPUC11
#define _CNPUC12 CNPUCbits.CNPUC12
#define _CNPUC13 CNPUCbits.CNPUC13
#define _CNPUC14 CNPUCbits.CNPUC14
#define _CNPUC15 CNPUCbits.CNPUC15

/* CNPDC */
#define _CNPDC0 CNPDCbits.CNPDC0
#define _CNPDC1 CNPDCbits.CNPDC1
#define _CNPDC2 CNPDCbits.CNPDC2
#define _CNPDC3 CNPDCbits.CNPDC3
#define _CNPDC4 CNPDCbits.CNPDC4
#define _CNPDC5 CNPDCbits.CNPDC5
#define _CNPDC6 CNPDCbits.CNPDC6
#define _CNPDC7 CNPDCbits.CNPDC7
#define _CNPDC8 CNPDCbits.CNPDC8
#define _CNPDC9 CNPDCbits.CNPDC9
#define _CNPDC10 CNPDCbits.CNPDC10
#define _CNPDC11 CNPDCbits.CNPDC11
#define _CNPDC12 CNPDCbits.CNPDC12
#define _CNPDC13 CNPDCbits.CNPDC13
#define _CNPDC14 CNPDCbits.CNPDC14
#define _CNPDC15 CNPDCbits.CNPDC15

/* CNCONC */
/* Bitname _CNSTYLE cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* CNEN0C */
#define _CNEN0C0 CNEN0Cbits.CNEN0C0
#define _CNEN0C1 CNEN0Cbits.CNEN0C1
#define _CNEN0C2 CNEN0Cbits.CNEN0C2
#define _CNEN0C3 CNEN0Cbits.CNEN0C3
#define _CNEN0C4 CNEN0Cbits.CNEN0C4
#define _CNEN0C5 CNEN0Cbits.CNEN0C5
#define _CNEN0C6 CNEN0Cbits.CNEN0C6
#define _CNEN0C7 CNEN0Cbits.CNEN0C7
#define _CNEN0C8 CNEN0Cbits.CNEN0C8
#define _CNEN0C9 CNEN0Cbits.CNEN0C9
#define _CNEN0C10 CNEN0Cbits.CNEN0C10
#define _CNEN0C11 CNEN0Cbits.CNEN0C11
#define _CNEN0C12 CNEN0Cbits.CNEN0C12
#define _CNEN0C13 CNEN0Cbits.CNEN0C13
#define _CNEN0C14 CNEN0Cbits.CNEN0C14
#define _CNEN0C15 CNEN0Cbits.CNEN0C15

/* CNSTATC */
#define _CNSTATC0 CNSTATCbits.CNSTATC0
#define _CNSTATC1 CNSTATCbits.CNSTATC1
#define _CNSTATC2 CNSTATCbits.CNSTATC2
#define _CNSTATC3 CNSTATCbits.CNSTATC3
#define _CNSTATC4 CNSTATCbits.CNSTATC4
#define _CNSTATC5 CNSTATCbits.CNSTATC5
#define _CNSTATC6 CNSTATCbits.CNSTATC6
#define _CNSTATC7 CNSTATCbits.CNSTATC7
#define _CNSTATC8 CNSTATCbits.CNSTATC8
#define _CNSTATC9 CNSTATCbits.CNSTATC9
#define _CNSTATC10 CNSTATCbits.CNSTATC10
#define _CNSTATC11 CNSTATCbits.CNSTATC11
#define _CNSTATC12 CNSTATCbits.CNSTATC12
#define _CNSTATC13 CNSTATCbits.CNSTATC13
#define _CNSTATC14 CNSTATCbits.CNSTATC14
#define _CNSTATC15 CNSTATCbits.CNSTATC15

/* CNEN1C */
#define _CNEN1C0 CNEN1Cbits.CNEN1C0
#define _CNEN1C1 CNEN1Cbits.CNEN1C1
#define _CNEN1C2 CNEN1Cbits.CNEN1C2
#define _CNEN1C3 CNEN1Cbits.CNEN1C3
#define _CNEN1C4 CNEN1Cbits.CNEN1C4
#define _CNEN1C5 CNEN1Cbits.CNEN1C5
#define _CNEN1C6 CNEN1Cbits.CNEN1C6
#define _CNEN1C7 CNEN1Cbits.CNEN1C7
#define _CNEN1C8 CNEN1Cbits.CNEN1C8
#define _CNEN1C9 CNEN1Cbits.CNEN1C9
#define _CNEN1C10 CNEN1Cbits.CNEN1C10
#define _CNEN1C11 CNEN1Cbits.CNEN1C11
#define _CNEN1C12 CNEN1Cbits.CNEN1C12
#define _CNEN1C13 CNEN1Cbits.CNEN1C13
#define _CNEN1C14 CNEN1Cbits.CNEN1C14
#define _CNEN1C15 CNEN1Cbits.CNEN1C15

/* CNFC */
#define _CNFC0 CNFCbits.CNFC0
#define _CNFC1 CNFCbits.CNFC1
#define _CNFC2 CNFCbits.CNFC2
#define _CNFC3 CNFCbits.CNFC3
#define _CNFC4 CNFCbits.CNFC4
#define _CNFC5 CNFCbits.CNFC5
#define _CNFC6 CNFCbits.CNFC6
#define _CNFC7 CNFCbits.CNFC7
#define _CNFC8 CNFCbits.CNFC8
#define _CNFC9 CNFCbits.CNFC9
#define _CNFC10 CNFCbits.CNFC10
#define _CNFC11 CNFCbits.CNFC11
#define _CNFC12 CNFCbits.CNFC12
#define _CNFC13 CNFCbits.CNFC13
#define _CNFC14 CNFCbits.CNFC14
#define _CNFC15 CNFCbits.CNFC15

