draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/* APLLFBD1 */
#define _APLLFBDIV APLLFBD1bits.APLLFBDIV
#define _APLLFBDIV0 APLLFBD1bits.APLLFBDIV0
#define _APLLFBDIV1 APLLFBD1bits.APLLFBDIV1
#define _APLLFBDIV2 APLLFBD1bits.APLLFBDIV2
#define _APLLFBDIV3 APLLFBD1bits.APLLFBDIV3
#define _APLLFBDIV4 APLLFBD1bits.APLLFBDIV4
#define _APLLFBDIV5 APLLFBD1bits.APLLFBDIV5
#define _APLLFBDIV6 APLLFBD1bits.APLLFBDIV6
#define _APLLFBDIV7 APLLFBD1bits.APLLFBDIV7
#define _APLLFBDIV8 APLLFBD1bits.APLLFBDIV8
#define _APLLFBDIV9 APLLFBD1bits.APLLFBDIV9
#define _APLLFBDIV10 APLLFBD1bits.APLLFBDIV10
#define _APLLFBDIV11 APLLFBD1bits.APLLFBDIV11

/* APLLDIV1 */
#define _APOST2DIV APLLDIV1bits.APOST2DIV
#define _APOST1DIV APLLDIV1bits.APOST1DIV
#define _AVCODIV APLLDIV1bits.AVCODIV
#define _APOST2DIV0 APLLDIV1bits.APOST2DIV0
#define _APOST2DIV1 APLLDIV1bits.APOST2DIV1
#define _APOST2DIV2 APLLDIV1bits.APOST2DIV2
#define _APOST1DIV0 APLLDIV1bits.APOST1DIV0
#define _APOST1DIV1 APLLDIV1bits.APOST1DIV1
#define _APOST1DIV2 APLLDIV1bits.APOST1DIV2
#define _AVCODIV0 APLLDIV1bits.AVCODIV0
#define _AVCODIV1 APLLDIV1bits.AVCODIV1

/* DCOTUN */
/* Bitname _TUN cannot be defined because it is used by more than one SFR */
#define _STORPOL DCOTUNbits.STORPOL
#define _STOR DCOTUNbits.STOR
#define _STPOL DCOTUNbits.STPOL
#define _STLOCK DCOTUNbits.STLOCK
#define _STSRC DCOTUNbits.STSRC
#define _STSIDL DCOTUNbits.STSIDL
#define _STON DCOTUNbits.STON

/* DCOCON */
#define _DCOFSEL DCOCONbits.DCOFSEL
#define _DCOEN DCOCONbits.DCOEN

/* PMDCON */
#define _PMDLOCK PMDCONbits.PMDLOCK

/* PMD1 */
#define _ADC1MD PMD1bits.ADC1MD
#define _SPI1MD PMD1bits.SPI1MD
#define _SPI2MD PMD1bits.SPI2MD
#define _U1MD PMD1bits.U1MD
#define _U2MD PMD1bits.U2MD
#define _I2C1MD PMD1bits.I2C1MD
#define _PWMMD PMD1bits.PWMMD
#define _QEIMD PMD1bits.QEIMD
#define _T1MD PMD1bits.T1MD

/* PMD2 */
#define _CCP1MD PMD2bits.CCP1MD
#define _CCP2MD PMD2bits.CCP2MD
#define _CCP3MD PMD2bits.CCP3MD
#define _CCP4MD PMD2bits.CCP4MD
#define _CCP5MD PMD2bits.CCP5MD
#define _CCP6MD PMD2bits.CCP6MD
#define _CCP7MD PMD2bits.CCP7MD
#define _CCP8MD PMD2bits.CCP8MD
#define _CCP9MD PMD2bits.CCP9MD

/* PMD3 */
#define _I2C2MD PMD3bits.I2C2MD
#define _I2C3MD PMD3bits.I2C3MD
#define _U3MD PMD3bits.U3MD
#define _QEI2MD PMD3bits.QEI2MD
#define _CRCMD PMD3bits.CRCMD
#define _PMPMD PMD3bits.PMPMD

/* PMD4 */
#define _REFOMD PMD4bits.REFOMD

/* PMD6 */
#define _SPI3MD PMD6bits.SPI3MD
#define _DMA0MD PMD6bits.DMA0MD
#define _DMA1MD PMD6bits.DMA1MD
#define _DMA2MD PMD6bits.DMA2MD
#define _DMA3MD PMD6bits.DMA3MD

/* PMD7 */
#define _PTGMD PMD7bits.PTGMD
#define _CMP1MD PMD7bits.CMP1MD
#define _CMP2MD PMD7bits.CMP2MD
#define _CMP3MD PMD7bits.CMP3MD

/* PMD8 */
#define _BIASMD PMD8bits.BIASMD
#define _CLC1MD PMD8bits.CLC1MD
#define _CLC2MD PMD8bits.CLC2MD
#define _CLC3MD PMD8bits.CLC3MD
#define _CLC4MD PMD8bits.CLC4MD
#define _DMTMD PMD8bits.DMTMD
#define _SENT1MD PMD8bits.SENT1MD
#define _SENT2MD PMD8bits.SENT2MD
#define _OPAMPMD PMD8bits.OPAMPMD

/* WDTCONL */
#define _WDTWINEN WDTCONLbits.WDTWINEN
#define _SLPDIV WDTCONLbits.SLPDIV
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
#define _RUNDIV WDTCONLbits.RUNDIV
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* REFOCON1 */
#define _ROSEL REFOCON1bits.ROSEL
#define _ROACTIVE REFOCON1bits.ROACTIVE
#define _ROSWEN REFOCON1bits.ROSWEN
#define _ROSLP REFOCON1bits.ROSLP
#define _ROOUT REFOCON1bits.ROOUT
#define _ROSIDL REFOCON1bits.ROSIDL
#define _ROEN REFOCON1bits.ROEN
#define _ROSEL0 REFOCON1bits.ROSEL0
#define _ROSEL1 REFOCON1bits.ROSEL1
#define _ROSEL2 REFOCON1bits.ROSEL2
#define _ROSEL3 REFOCON1bits.ROSEL3

/* REFOCON2 */
#define _RODIV REFOCON2bits.RODIV
#define _RODIV0 REFOCON2bits.RODIV0
#define _RODIV1 REFOCON2bits.RODIV1
#define _RODIV2 REFOCON2bits.RODIV2
#define _RODIV3 REFOCON2bits.RODIV3
#define _RODIV4 REFOCON2bits.RODIV4
#define _RODIV5 REFOCON2bits.RODIV5
#define _RODIV6 REFOCON2bits.RODIV6
#define _RODIV7 REFOCON2bits.RODIV7
#define _RODIV8 REFOCON2bits.RODIV8
#define _RODIV9 REFOCON2bits.RODIV9
#define _RODIV10 REFOCON2bits.RODIV10
#define _RODIV11 REFOCON2bits.RODIV11
#define _RODIV12 REFOCON2bits.RODIV12
#define _RODIV13 REFOCON2bits.RODIV13
#define _RODIV14 REFOCON2bits.RODIV14

/* REFOTRIMH */
#define _ROTRIM REFOTRIMHbits.ROTRIM

/* PCTRAPH */
#define _PCTRAPH PCTRAPHbits.PCTRAPH

/* FEXH */
#define _FEXL FEXHbits.FEXL

/* FEX2H */
#define _FEX2H FEX2Hbits.FEX2H

/* DPCH */
#define _DPCH DPCHbits.DPCH

/* APPS */
#define _APIFUL APPSbits.APIFUL
#define _APIOV APPSbits.APIOV
#define _APOFUL APPSbits.APOFUL
#define _APOOV APPSbits.APOOV
#define _STRFUL APPSbits.STRFUL


/* ---------------------------------------------------------- */
/* Some useful macros for inline assembler instructions       */
/* ---------------------------------------------------------- */

#define Nop()    __builtin_nop()
#define ClrWdt() __builtin_clrwdt()
#define Sleep()  __builtin_pwrsav(0)
#define Idle()   __builtin_pwrsav(1)

/*----------------------------------------------------------- */
/* Some useful macros for allocating data memory              */
/*----------------------------------------------------------- */

/* The following macros require an argument N that specifies  */
/* alignment. N must a power of two, minimum value = 2.       */
/* For example, to declare an uninitialized array in X memory */
/* that is aligned to a 32 byte address:                      */
/*                                                            */
/* int _XBSS(32) xbuf[16];                                    */
/*                                                            */
#define _XBSS(N)    __attribute__((space(xmemory),far,aligned(N)))
#define _XDATA(N)   __attribute__((space(xmemory),far,aligned(N)))
#define _YBSS(N)    __attribute__((space(ymemory),far,aligned(N)))
#define _YDATA(N)   __attribute__((space(ymemory),far,aligned(N)))

/* The following macros do not require an argument. They can  */
/* be used to locate a variable in persistent data memory or  */
/* in near data memory. For example, to declare two variables */
/* that retain their values across a device reset:            */
/*                                                            */
/* int _PERSISTENT var1,var2;                                 */
/*                                                            */
#define _PERSISTENT __attribute__((persistent))
#define _NEAR       __attribute__((near))

/* ---------------------------------------------------------- */
/* Some useful macros for declaring functions                 */
/* ---------------------------------------------------------- */

/* The following macros can be used to declare interrupt      */
/* service routines (ISRs). For example, to declare an ISR    */
/* for the timer1 interrupt:                                  */
/*                                                            */
/* void _ISR _T1Interrupt(void);                              */
/*                                                            */
/* To declare an ISR for the SPI1 interrupt with fast         */
/* context save:                                              */
/*                                                            */
/* void _ISRFAST _SPI1Interrupt(void);                        */
/*                                                            */
/* Note: ISRs will be installed into the interrupt vector     */
/* tables automatically if the reserved names listed in the   */
/* MPLAB C30 Compiler User's Guide (DS51284) are used.        */
/*                                                            */
#define _ISR __attribute__((interrupt))
#define _ISRFAST __attribute__((interrupt, shadow))

/* ---------------------------------------------------------- */
/* Some useful macros for changing the CPU IPL                */
/* ---------------------------------------------------------- */

