draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _QEI2IOC_QEAPOL_POSITION                 0x00000004
#define _QEI2IOC_QEAPOL_MASK                     0x00000010
#define _QEI2IOC_QEAPOL_LENGTH                   0x00000001

#define _QEI2IOC_QEBPOL_POSITION                 0x00000005
#define _QEI2IOC_QEBPOL_MASK                     0x00000020
#define _QEI2IOC_QEBPOL_LENGTH                   0x00000001

#define _QEI2IOC_IDXPOL_POSITION                 0x00000006
#define _QEI2IOC_IDXPOL_MASK                     0x00000040
#define _QEI2IOC_IDXPOL_LENGTH                   0x00000001

#define _QEI2IOC_HOMPOL_POSITION                 0x00000007
#define _QEI2IOC_HOMPOL_MASK                     0x00000080
#define _QEI2IOC_HOMPOL_LENGTH                   0x00000001

#define _QEI2IOC_SWPAB_POSITION                  0x00000008
#define _QEI2IOC_SWPAB_MASK                      0x00000100
#define _QEI2IOC_SWPAB_LENGTH                    0x00000001

#define _QEI2IOC_OUTFNC_POSITION                 0x00000009
#define _QEI2IOC_OUTFNC_MASK                     0x00000600
#define _QEI2IOC_OUTFNC_LENGTH                   0x00000002

#define _QEI2IOC_QFDIV_POSITION                  0x0000000B
#define _QEI2IOC_QFDIV_MASK                      0x00003800
#define _QEI2IOC_QFDIV_LENGTH                    0x00000003

#define _QEI2IOC_FLTREN_POSITION                 0x0000000E
#define _QEI2IOC_FLTREN_MASK                     0x00004000
#define _QEI2IOC_FLTREN_LENGTH                   0x00000001

#define _QEI2IOC_QCAPEN_POSITION                 0x0000000F
#define _QEI2IOC_QCAPEN_MASK                     0x00008000
#define _QEI2IOC_QCAPEN_LENGTH                   0x00000001

#define _QEI2IOCH_HCAPEN_POSITION                0x00000000
#define _QEI2IOCH_HCAPEN_MASK                    0x00000001
#define _QEI2IOCH_HCAPEN_LENGTH                  0x00000001

#define _QEI2STAT_IDXIEN_POSITION                0x00000000
#define _QEI2STAT_IDXIEN_MASK                    0x00000001
#define _QEI2STAT_IDXIEN_LENGTH                  0x00000001

#define _QEI2STAT_IDXIRQ_POSITION                0x00000001
#define _QEI2STAT_IDXIRQ_MASK                    0x00000002
#define _QEI2STAT_IDXIRQ_LENGTH                  0x00000001

#define _QEI2STAT_HOMIEN_POSITION                0x00000002
#define _QEI2STAT_HOMIEN_MASK                    0x00000004
#define _QEI2STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI2STAT_HOMIRQ_POSITION                0x00000003
#define _QEI2STAT_HOMIRQ_MASK                    0x00000008
#define _QEI2STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI2STAT_VELOVIEN_POSITION              0x00000004
#define _QEI2STAT_VELOVIEN_MASK                  0x00000010
#define _QEI2STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI2STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI2STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI2STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCIIEN_POSITION                0x00000006
#define _QEI2STAT_PCIIEN_MASK                    0x00000040
#define _QEI2STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI2STAT_PCIIRQ_POSITION                0x00000007
#define _QEI2STAT_PCIIRQ_MASK                    0x00000080
#define _QEI2STAT_PCIIRQ_LENGTH                  0x00000001

#define _QEI2STAT_POSOVIEN_POSITION              0x00000008
#define _QEI2STAT_POSOVIEN_MASK                  0x00000100
#define _QEI2STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI2STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI2STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI2STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI2STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI2STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI2STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI2STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI2STAT_PCLEQIRQ_LENGTH                0x00000001

#define _QEI2STAT_PCHEQIEN_POSITION              0x0000000C
#define _QEI2STAT_PCHEQIEN_MASK                  0x00001000
#define _QEI2STAT_PCHEQIEN_LENGTH                0x00000001

#define _QEI2STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI2STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI2STAT_PCHEQIRQ_LENGTH                0x00000001

#define _PMCON_RDSP_POSITION                     0x00000000
#define _PMCON_RDSP_MASK                         0x00000001
#define _PMCON_RDSP_LENGTH                       0x00000001

#define _PMCON_WRSP_POSITION                     0x00000001
#define _PMCON_WRSP_MASK                         0x00000002
#define _PMCON_WRSP_LENGTH                       0x00000001

#define _PMCON_CS1P_POSITION                     0x00000003
#define _PMCON_CS1P_MASK                         0x00000008
#define _PMCON_CS1P_LENGTH                       0x00000001

#define _PMCON_CS2P_POSITION                     0x00000004
#define _PMCON_CS2P_MASK                         0x00000010
#define _PMCON_CS2P_LENGTH                       0x00000001

#define _PMCON_ALP_POSITION                      0x00000005
#define _PMCON_ALP_MASK                          0x00000020
#define _PMCON_ALP_LENGTH                        0x00000001

#define _PMCON_CSF_POSITION                      0x00000006
#define _PMCON_CSF_MASK                          0x000000C0
#define _PMCON_CSF_LENGTH                        0x00000002

#define _PMCON_PTRDEN_POSITION                   0x00000008
#define _PMCON_PTRDEN_MASK                       0x00000100
#define _PMCON_PTRDEN_LENGTH                     0x00000001

#define _PMCON_PTWREN_POSITION                   0x00000009
#define _PMCON_PTWREN_MASK                       0x00000200
#define _PMCON_PTWREN_LENGTH                     0x00000001

#define _PMCON_PMPTTL_POSITION                   0x0000000A
#define _PMCON_PMPTTL_MASK                       0x00000400
#define _PMCON_PMPTTL_LENGTH                     0x00000001

#define _PMCON_ADRMUX_POSITION                   0x0000000B
#define _PMCON_ADRMUX_MASK                       0x00001800
#define _PMCON_ADRMUX_LENGTH                     0x00000002

#define _PMCON_SIDL_POSITION                     0x0000000D
#define _PMCON_SIDL_MASK                         0x00002000
#define _PMCON_SIDL_LENGTH                       0x00000001

#define _PMCON_ON_POSITION                       0x0000000F
#define _PMCON_ON_MASK                           0x00008000
#define _PMCON_ON_LENGTH                         0x00000001

