draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _U1TXCHK_TXCHK3_POSITION                 0x00000003
#define _U1TXCHK_TXCHK3_MASK                     0x00000008
#define _U1TXCHK_TXCHK3_LENGTH                   0x00000001

#define _U1TXCHK_TXCHK4_POSITION                 0x00000004
#define _U1TXCHK_TXCHK4_MASK                     0x00000010
#define _U1TXCHK_TXCHK4_LENGTH                   0x00000001

#define _U1TXCHK_TXCHK5_POSITION                 0x00000005
#define _U1TXCHK_TXCHK5_MASK                     0x00000020
#define _U1TXCHK_TXCHK5_LENGTH                   0x00000001

#define _U1TXCHK_TXCHK6_POSITION                 0x00000006
#define _U1TXCHK_TXCHK6_MASK                     0x00000040
#define _U1TXCHK_TXCHK6_LENGTH                   0x00000001

#define _U1TXCHK_TXCHK7_POSITION                 0x00000007
#define _U1TXCHK_TXCHK7_MASK                     0x00000080
#define _U1TXCHK_TXCHK7_LENGTH                   0x00000001

#define _U1RXCHK_RXCHK_POSITION                  0x00000000
#define _U1RXCHK_RXCHK_MASK                      0x000000FF
#define _U1RXCHK_RXCHK_LENGTH                    0x00000008

#define _U1SCCON_PTRCL_POSITION                  0x00000001
#define _U1SCCON_PTRCL_MASK                      0x00000002
#define _U1SCCON_PTRCL_LENGTH                    0x00000001

#define _U1SCCON_T0PD_POSITION                   0x00000002
#define _U1SCCON_T0PD_MASK                       0x00000004
#define _U1SCCON_T0PD_LENGTH                     0x00000001

#define _U1SCCON_CONV_POSITION                   0x00000003
#define _U1SCCON_CONV_MASK                       0x00000008
#define _U1SCCON_CONV_LENGTH                     0x00000001

#define _U1SCCON_TXRPT_POSITION                  0x00000004
#define _U1SCCON_TXRPT_MASK                      0x00000030
#define _U1SCCON_TXRPT_LENGTH                    0x00000002

#define _U1SCCON_TXRPT0_POSITION                 0x00000004
#define _U1SCCON_TXRPT0_MASK                     0x00000010
#define _U1SCCON_TXRPT0_LENGTH                   0x00000001

#define _U1SCCON_TXRPT1_POSITION                 0x00000005
#define _U1SCCON_TXRPT1_MASK                     0x00000020
#define _U1SCCON_TXRPT1_LENGTH                   0x00000001

#define _U1SCINT_GTCIE_POSITION                  0x00000000
#define _U1SCINT_GTCIE_MASK                      0x00000001
#define _U1SCINT_GTCIE_LENGTH                    0x00000001

#define _U1SCINT_WTCIE_POSITION                  0x00000001
#define _U1SCINT_WTCIE_MASK                      0x00000002
#define _U1SCINT_WTCIE_LENGTH                    0x00000001

#define _U1SCINT_BTCIE_POSITION                  0x00000002
#define _U1SCINT_BTCIE_MASK                      0x00000004
#define _U1SCINT_BTCIE_LENGTH                    0x00000001

#define _U1SCINT_TXRPTIE_POSITION                0x00000004
#define _U1SCINT_TXRPTIE_MASK                    0x00000010
#define _U1SCINT_TXRPTIE_LENGTH                  0x00000001

#define _U1SCINT_RXRPTIE_POSITION                0x00000005
#define _U1SCINT_RXRPTIE_MASK                    0x00000020
#define _U1SCINT_RXRPTIE_LENGTH                  0x00000001

#define _U1SCINT_GTCIF_POSITION                  0x00000008
#define _U1SCINT_GTCIF_MASK                      0x00000100
#define _U1SCINT_GTCIF_LENGTH                    0x00000001

#define _U1SCINT_WTCIF_POSITION                  0x00000009
#define _U1SCINT_WTCIF_MASK                      0x00000200
#define _U1SCINT_WTCIF_LENGTH                    0x00000001

#define _U1SCINT_BTCIF_POSITION                  0x0000000A
#define _U1SCINT_BTCIF_MASK                      0x00000400
#define _U1SCINT_BTCIF_LENGTH                    0x00000001

#define _U1SCINT_TXRPTIF_POSITION                0x0000000C
#define _U1SCINT_TXRPTIF_MASK                    0x00001000
#define _U1SCINT_TXRPTIF_LENGTH                  0x00000001

#define _U1SCINT_RXRPTIF_POSITION                0x0000000D
#define _U1SCINT_RXRPTIF_MASK                    0x00002000
#define _U1SCINT_RXRPTIF_LENGTH                  0x00000001

#define _U1INT_ABDIE_POSITION                    0x00000002
#define _U1INT_ABDIE_MASK                        0x00000004
#define _U1INT_ABDIE_LENGTH                      0x00000001

#define _U1INT_ABDIF_POSITION                    0x00000006
#define _U1INT_ABDIF_MASK                        0x00000040
#define _U1INT_ABDIF_LENGTH                      0x00000001

#define _U1INT_WUIF_POSITION                     0x00000007
#define _U1INT_WUIF_MASK                         0x00000080
#define _U1INT_WUIF_LENGTH                       0x00000001

#define _U2MODE_MOD_POSITION                     0x00000000
#define _U2MODE_MOD_MASK                         0x0000000F
#define _U2MODE_MOD_LENGTH                       0x00000004

#define _U2MODE_URXEN_POSITION                   0x00000004
#define _U2MODE_URXEN_MASK                       0x00000010
#define _U2MODE_URXEN_LENGTH                     0x00000001

#define _U2MODE_UTXEN_POSITION                   0x00000005
#define _U2MODE_UTXEN_MASK                       0x00000020
#define _U2MODE_UTXEN_LENGTH                     0x00000001

#define _U2MODE_ABAUD_POSITION                   0x00000006
#define _U2MODE_ABAUD_MASK                       0x00000040
#define _U2MODE_ABAUD_LENGTH                     0x00000001

#define _U2MODE_BRGH_POSITION                    0x00000007
#define _U2MODE_BRGH_MASK                        0x00000080
#define _U2MODE_BRGH_LENGTH                      0x00000001

#define _U2MODE_UTXBRK_POSITION                  0x00000008
#define _U2MODE_UTXBRK_MASK                      0x00000100
#define _U2MODE_UTXBRK_LENGTH                    0x00000001

#define _U2MODE_BRKOVR_POSITION                  0x00000009
#define _U2MODE_BRKOVR_MASK                      0x00000200
#define _U2MODE_BRKOVR_LENGTH                    0x00000001

#define _U2MODE_RXBIMD_POSITION                  0x0000000B
#define _U2MODE_RXBIMD_MASK                      0x00000800
#define _U2MODE_RXBIMD_LENGTH                    0x00000001

#define _U2MODE_WAKE_POSITION                    0x0000000C
#define _U2MODE_WAKE_MASK                        0x00001000
#define _U2MODE_WAKE_LENGTH                      0x00000001

#define _U2MODE_USIDL_POSITION                   0x0000000D
#define _U2MODE_USIDL_MASK                       0x00002000
#define _U2MODE_USIDL_LENGTH                     0x00000001

#define _U2MODE_UARTEN_POSITION                  0x0000000F
#define _U2MODE_UARTEN_MASK                      0x00008000
#define _U2MODE_UARTEN_LENGTH                    0x00000001

#define _U2MODE_MOD0_POSITION                    0x00000000
#define _U2MODE_MOD0_MASK                        0x00000001
#define _U2MODE_MOD0_LENGTH                      0x00000001

