draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _U2TXCHK_TXCHK3_POSITION                 0x00000003
#define _U2TXCHK_TXCHK3_MASK                     0x00000008
#define _U2TXCHK_TXCHK3_LENGTH                   0x00000001

#define _U2TXCHK_TXCHK4_POSITION                 0x00000004
#define _U2TXCHK_TXCHK4_MASK                     0x00000010
#define _U2TXCHK_TXCHK4_LENGTH                   0x00000001

#define _U2TXCHK_TXCHK5_POSITION                 0x00000005
#define _U2TXCHK_TXCHK5_MASK                     0x00000020
#define _U2TXCHK_TXCHK5_LENGTH                   0x00000001

#define _U2TXCHK_TXCHK6_POSITION                 0x00000006
#define _U2TXCHK_TXCHK6_MASK                     0x00000040
#define _U2TXCHK_TXCHK6_LENGTH                   0x00000001

#define _U2TXCHK_TXCHK7_POSITION                 0x00000007
#define _U2TXCHK_TXCHK7_MASK                     0x00000080
#define _U2TXCHK_TXCHK7_LENGTH                   0x00000001

#define _U2RXCHK_RXCHK_POSITION                  0x00000000
#define _U2RXCHK_RXCHK_MASK                      0x000000FF
#define _U2RXCHK_RXCHK_LENGTH                    0x00000008

#define _U2SCCON_PTRCL_POSITION                  0x00000001
#define _U2SCCON_PTRCL_MASK                      0x00000002
#define _U2SCCON_PTRCL_LENGTH                    0x00000001

#define _U2SCCON_T0PD_POSITION                   0x00000002
#define _U2SCCON_T0PD_MASK                       0x00000004
#define _U2SCCON_T0PD_LENGTH                     0x00000001

#define _U2SCCON_CONV_POSITION                   0x00000003
#define _U2SCCON_CONV_MASK                       0x00000008
#define _U2SCCON_CONV_LENGTH                     0x00000001

#define _U2SCCON_TXRPT_POSITION                  0x00000004
#define _U2SCCON_TXRPT_MASK                      0x00000030
#define _U2SCCON_TXRPT_LENGTH                    0x00000002

#define _U2SCCON_TXRPT0_POSITION                 0x00000004
#define _U2SCCON_TXRPT0_MASK                     0x00000010
#define _U2SCCON_TXRPT0_LENGTH                   0x00000001

#define _U2SCCON_TXRPT1_POSITION                 0x00000005
#define _U2SCCON_TXRPT1_MASK                     0x00000020
#define _U2SCCON_TXRPT1_LENGTH                   0x00000001

#define _U2SCINT_GTCIE_POSITION                  0x00000000
#define _U2SCINT_GTCIE_MASK                      0x00000001
#define _U2SCINT_GTCIE_LENGTH                    0x00000001

#define _U2SCINT_WTCIE_POSITION                  0x00000001
#define _U2SCINT_WTCIE_MASK                      0x00000002
#define _U2SCINT_WTCIE_LENGTH                    0x00000001

#define _U2SCINT_BTCIE_POSITION                  0x00000002
#define _U2SCINT_BTCIE_MASK                      0x00000004
#define _U2SCINT_BTCIE_LENGTH                    0x00000001

#define _U2SCINT_TXRPTIE_POSITION                0x00000004
#define _U2SCINT_TXRPTIE_MASK                    0x00000010
#define _U2SCINT_TXRPTIE_LENGTH                  0x00000001

#define _U2SCINT_RXRPTIE_POSITION                0x00000005
#define _U2SCINT_RXRPTIE_MASK                    0x00000020
#define _U2SCINT_RXRPTIE_LENGTH                  0x00000001

#define _U2SCINT_GTCIF_POSITION                  0x00000008
#define _U2SCINT_GTCIF_MASK                      0x00000100
#define _U2SCINT_GTCIF_LENGTH                    0x00000001

#define _U2SCINT_WTCIF_POSITION                  0x00000009
#define _U2SCINT_WTCIF_MASK                      0x00000200
#define _U2SCINT_WTCIF_LENGTH                    0x00000001

#define _U2SCINT_BTCIF_POSITION                  0x0000000A
#define _U2SCINT_BTCIF_MASK                      0x00000400
#define _U2SCINT_BTCIF_LENGTH                    0x00000001

#define _U2SCINT_TXRPTIF_POSITION                0x0000000C
#define _U2SCINT_TXRPTIF_MASK                    0x00001000
#define _U2SCINT_TXRPTIF_LENGTH                  0x00000001

#define _U2SCINT_RXRPTIF_POSITION                0x0000000D
#define _U2SCINT_RXRPTIF_MASK                    0x00002000
#define _U2SCINT_RXRPTIF_LENGTH                  0x00000001

#define _U2INT_ABDIE_POSITION                    0x00000002
#define _U2INT_ABDIE_MASK                        0x00000004
#define _U2INT_ABDIE_LENGTH                      0x00000001

#define _U2INT_ABDIF_POSITION                    0x00000006
#define _U2INT_ABDIF_MASK                        0x00000040
#define _U2INT_ABDIF_LENGTH                      0x00000001

#define _U2INT_WUIF_POSITION                     0x00000007
#define _U2INT_WUIF_MASK                         0x00000080
#define _U2INT_WUIF_LENGTH                       0x00000001

#define _SPI1CON1_ENHBUF_POSITION                0x00000000
#define _SPI1CON1_ENHBUF_MASK                    0x00000001
#define _SPI1CON1_ENHBUF_LENGTH                  0x00000001

#define _SPI1CON1_SPIFE_POSITION                 0x00000001
#define _SPI1CON1_SPIFE_MASK                     0x00000002
#define _SPI1CON1_SPIFE_LENGTH                   0x00000001

#define _SPI1CON1_MCLKEN_POSITION                0x00000002
#define _SPI1CON1_MCLKEN_MASK                    0x00000004
#define _SPI1CON1_MCLKEN_LENGTH                  0x00000001

#define _SPI1CON1_DISSCK_POSITION                0x00000003
#define _SPI1CON1_DISSCK_MASK                    0x00000008
#define _SPI1CON1_DISSCK_LENGTH                  0x00000001

#define _SPI1CON1_DISSDI_POSITION                0x00000004
#define _SPI1CON1_DISSDI_MASK                    0x00000010
#define _SPI1CON1_DISSDI_LENGTH                  0x00000001

#define _SPI1CON1_MSTEN_POSITION                 0x00000005
#define _SPI1CON1_MSTEN_MASK                     0x00000020
#define _SPI1CON1_MSTEN_LENGTH                   0x00000001

#define _SPI1CON1_CKP_POSITION                   0x00000006
#define _SPI1CON1_CKP_MASK                       0x00000040
#define _SPI1CON1_CKP_LENGTH                     0x00000001

#define _SPI1CON1_SSEN_POSITION                  0x00000007
#define _SPI1CON1_SSEN_MASK                      0x00000080
#define _SPI1CON1_SSEN_LENGTH                    0x00000001

#define _SPI1CON1_CKE_POSITION                   0x00000008
#define _SPI1CON1_CKE_MASK                       0x00000100
#define _SPI1CON1_CKE_LENGTH                     0x00000001

#define _SPI1CON1_SMP_POSITION                   0x00000009
#define _SPI1CON1_SMP_MASK                       0x00000200
#define _SPI1CON1_SMP_LENGTH                     0x00000001

