draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _SPI2CON1_SPIFE_POSITION                 0x00000001
#define _SPI2CON1_SPIFE_MASK                     0x00000002
#define _SPI2CON1_SPIFE_LENGTH                   0x00000001

#define _SPI2CON1_MCLKEN_POSITION                0x00000002
#define _SPI2CON1_MCLKEN_MASK                    0x00000004
#define _SPI2CON1_MCLKEN_LENGTH                  0x00000001

#define _SPI2CON1_DISSCK_POSITION                0x00000003
#define _SPI2CON1_DISSCK_MASK                    0x00000008
#define _SPI2CON1_DISSCK_LENGTH                  0x00000001

#define _SPI2CON1_DISSDI_POSITION                0x00000004
#define _SPI2CON1_DISSDI_MASK                    0x00000010
#define _SPI2CON1_DISSDI_LENGTH                  0x00000001

#define _SPI2CON1_MSTEN_POSITION                 0x00000005
#define _SPI2CON1_MSTEN_MASK                     0x00000020
#define _SPI2CON1_MSTEN_LENGTH                   0x00000001

#define _SPI2CON1_CKP_POSITION                   0x00000006
#define _SPI2CON1_CKP_MASK                       0x00000040
#define _SPI2CON1_CKP_LENGTH                     0x00000001

#define _SPI2CON1_SSEN_POSITION                  0x00000007
#define _SPI2CON1_SSEN_MASK                      0x00000080
#define _SPI2CON1_SSEN_LENGTH                    0x00000001

#define _SPI2CON1_CKE_POSITION                   0x00000008
#define _SPI2CON1_CKE_MASK                       0x00000100
#define _SPI2CON1_CKE_LENGTH                     0x00000001

#define _SPI2CON1_SMP_POSITION                   0x00000009
#define _SPI2CON1_SMP_MASK                       0x00000200
#define _SPI2CON1_SMP_LENGTH                     0x00000001

#define _SPI2CON1_MODE16_POSITION                0x0000000A
#define _SPI2CON1_MODE16_MASK                    0x00000400
#define _SPI2CON1_MODE16_LENGTH                  0x00000001

#define _SPI2CON1_MODE32_POSITION                0x0000000B
#define _SPI2CON1_MODE32_MASK                    0x00000800
#define _SPI2CON1_MODE32_LENGTH                  0x00000001

#define _SPI2CON1_DISSDO_POSITION                0x0000000C
#define _SPI2CON1_DISSDO_MASK                    0x00001000
#define _SPI2CON1_DISSDO_LENGTH                  0x00000001

#define _SPI2CON1_SPISIDL_POSITION               0x0000000D
#define _SPI2CON1_SPISIDL_MASK                   0x00002000
#define _SPI2CON1_SPISIDL_LENGTH                 0x00000001

#define _SPI2CON1_SPIEN_POSITION                 0x0000000F
#define _SPI2CON1_SPIEN_MASK                     0x00008000
#define _SPI2CON1_SPIEN_LENGTH                   0x00000001

#define _SPI2CON1_MODE_POSITION                  0x0000000A
#define _SPI2CON1_MODE_MASK                      0x00000C00
#define _SPI2CON1_MODE_LENGTH                    0x00000002

#define _SPI2CON1L_ENHBUF_POSITION               0x00000000
#define _SPI2CON1L_ENHBUF_MASK                   0x00000001
#define _SPI2CON1L_ENHBUF_LENGTH                 0x00000001

#define _SPI2CON1L_SPIFE_POSITION                0x00000001
#define _SPI2CON1L_SPIFE_MASK                    0x00000002
#define _SPI2CON1L_SPIFE_LENGTH                  0x00000001

#define _SPI2CON1L_MCLKEN_POSITION               0x00000002
#define _SPI2CON1L_MCLKEN_MASK                   0x00000004
#define _SPI2CON1L_MCLKEN_LENGTH                 0x00000001

#define _SPI2CON1L_DISSCK_POSITION               0x00000003
#define _SPI2CON1L_DISSCK_MASK                   0x00000008
#define _SPI2CON1L_DISSCK_LENGTH                 0x00000001

#define _SPI2CON1L_DISSDI_POSITION               0x00000004
#define _SPI2CON1L_DISSDI_MASK                   0x00000010
#define _SPI2CON1L_DISSDI_LENGTH                 0x00000001

#define _SPI2CON1L_MSTEN_POSITION                0x00000005
#define _SPI2CON1L_MSTEN_MASK                    0x00000020
#define _SPI2CON1L_MSTEN_LENGTH                  0x00000001

#define _SPI2CON1L_CKP_POSITION                  0x00000006
#define _SPI2CON1L_CKP_MASK                      0x00000040
#define _SPI2CON1L_CKP_LENGTH                    0x00000001

#define _SPI2CON1L_SSEN_POSITION                 0x00000007
#define _SPI2CON1L_SSEN_MASK                     0x00000080
#define _SPI2CON1L_SSEN_LENGTH                   0x00000001

#define _SPI2CON1L_CKE_POSITION                  0x00000008
#define _SPI2CON1L_CKE_MASK                      0x00000100
#define _SPI2CON1L_CKE_LENGTH                    0x00000001

#define _SPI2CON1L_SMP_POSITION                  0x00000009
#define _SPI2CON1L_SMP_MASK                      0x00000200
#define _SPI2CON1L_SMP_LENGTH                    0x00000001

#define _SPI2CON1L_MODE16_POSITION               0x0000000A
#define _SPI2CON1L_MODE16_MASK                   0x00000400
#define _SPI2CON1L_MODE16_LENGTH                 0x00000001

#define _SPI2CON1L_MODE32_POSITION               0x0000000B
#define _SPI2CON1L_MODE32_MASK                   0x00000800
#define _SPI2CON1L_MODE32_LENGTH                 0x00000001

#define _SPI2CON1L_DISSDO_POSITION               0x0000000C
#define _SPI2CON1L_DISSDO_MASK                   0x00001000
#define _SPI2CON1L_DISSDO_LENGTH                 0x00000001

#define _SPI2CON1L_SPISIDL_POSITION              0x0000000D
#define _SPI2CON1L_SPISIDL_MASK                  0x00002000
#define _SPI2CON1L_SPISIDL_LENGTH                0x00000001

#define _SPI2CON1L_SPIEN_POSITION                0x0000000F
#define _SPI2CON1L_SPIEN_MASK                    0x00008000
#define _SPI2CON1L_SPIEN_LENGTH                  0x00000001

#define _SPI2CON1L_MODE_POSITION                 0x0000000A
#define _SPI2CON1L_MODE_MASK                     0x00000C00
#define _SPI2CON1L_MODE_LENGTH                   0x00000002

#define _SPI2CON1H_FRMCNT_POSITION               0x00000000
#define _SPI2CON1H_FRMCNT_MASK                   0x00000007
#define _SPI2CON1H_FRMCNT_LENGTH                 0x00000003

#define _SPI2CON1H_FRMSYPW_POSITION              0x00000003
#define _SPI2CON1H_FRMSYPW_MASK                  0x00000008
#define _SPI2CON1H_FRMSYPW_LENGTH                0x00000001

#define _SPI2CON1H_MSSEN_POSITION                0x00000004
#define _SPI2CON1H_MSSEN_MASK                    0x00000010
#define _SPI2CON1H_MSSEN_LENGTH                  0x00000001

#define _SPI2CON1H_FRMPOL_POSITION               0x00000005
#define _SPI2CON1H_FRMPOL_MASK                   0x00000020
#define _SPI2CON1H_FRMPOL_LENGTH                 0x00000001

#define _SPI2CON1H_FRMSYNC_POSITION              0x00000006
#define _SPI2CON1H_FRMSYNC_MASK                  0x00000040
#define _SPI2CON1H_FRMSYNC_LENGTH                0x00000001

