draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _SPI3IMSKH_TXMSK2_POSITION               0x00000002
#define _SPI3IMSKH_TXMSK2_MASK                   0x00000004
#define _SPI3IMSKH_TXMSK2_LENGTH                 0x00000001

#define _SPI3IMSKH_TXMSK3_POSITION               0x00000003
#define _SPI3IMSKH_TXMSK3_MASK                   0x00000008
#define _SPI3IMSKH_TXMSK3_LENGTH                 0x00000001

#define _SPI3IMSKH_TXMSK4_POSITION               0x00000004
#define _SPI3IMSKH_TXMSK4_MASK                   0x00000010
#define _SPI3IMSKH_TXMSK4_LENGTH                 0x00000001

#define _SPI3IMSKH_TXMSK5_POSITION               0x00000005
#define _SPI3IMSKH_TXMSK5_MASK                   0x00000020
#define _SPI3IMSKH_TXMSK5_LENGTH                 0x00000001

#define _SPI3IMSKH_RXMSK0_POSITION               0x00000008
#define _SPI3IMSKH_RXMSK0_MASK                   0x00000100
#define _SPI3IMSKH_RXMSK0_LENGTH                 0x00000001

#define _SPI3IMSKH_RXMSK1_POSITION               0x00000009
#define _SPI3IMSKH_RXMSK1_MASK                   0x00000200
#define _SPI3IMSKH_RXMSK1_LENGTH                 0x00000001

#define _SPI3IMSKH_RXMSK2_POSITION               0x0000000A
#define _SPI3IMSKH_RXMSK2_MASK                   0x00000400
#define _SPI3IMSKH_RXMSK2_LENGTH                 0x00000001

#define _SPI3IMSKH_RXMSK3_POSITION               0x0000000B
#define _SPI3IMSKH_RXMSK3_MASK                   0x00000800
#define _SPI3IMSKH_RXMSK3_LENGTH                 0x00000001

#define _SPI3IMSKH_RXMSK4_POSITION               0x0000000C
#define _SPI3IMSKH_RXMSK4_MASK                   0x00001000
#define _SPI3IMSKH_RXMSK4_LENGTH                 0x00000001

#define _SPI3IMSKH_RXMSK5_POSITION               0x0000000D
#define _SPI3IMSKH_RXMSK5_MASK                   0x00002000
#define _SPI3IMSKH_RXMSK5_LENGTH                 0x00000001

#define _SPI3URDTL_SPI3URDTL_POSITION            0x00000000
#define _SPI3URDTL_SPI3URDTL_MASK                0x0000FFFF
#define _SPI3URDTL_SPI3URDTL_LENGTH              0x00000010

#define _SPI3URDTL_URDATA_POSITION               0x00000000
#define _SPI3URDTL_URDATA_MASK                   0x0000FFFF
#define _SPI3URDTL_URDATA_LENGTH                 0x00000010

#define _SPI3URDTH_SPI3URDTH_POSITION            0x00000000
#define _SPI3URDTH_SPI3URDTH_MASK                0x0000FFFF
#define _SPI3URDTH_SPI3URDTH_LENGTH              0x00000010

#define _SPI3URDTH_URDATA_POSITION               0x00000000
#define _SPI3URDTH_URDATA_MASK                   0x0000FFFF
#define _SPI3URDTH_URDATA_LENGTH                 0x00000010

#define _PCLKCON_MCLKSEL_POSITION                0x00000000
#define _PCLKCON_MCLKSEL_MASK                    0x00000003
#define _PCLKCON_MCLKSEL_LENGTH                  0x00000002

#define _PCLKCON_DIVSEL_POSITION                 0x00000004
#define _PCLKCON_DIVSEL_MASK                     0x00000030
#define _PCLKCON_DIVSEL_LENGTH                   0x00000002

#define _PCLKCON_LOCK_POSITION                   0x00000008
#define _PCLKCON_LOCK_MASK                       0x00000100
#define _PCLKCON_LOCK_LENGTH                     0x00000001

#define _PCLKCON_HRERR_POSITION                  0x0000000E
#define _PCLKCON_HRERR_MASK                      0x00004000
#define _PCLKCON_HRERR_LENGTH                    0x00000001

#define _PCLKCON_HRRDY_POSITION                  0x0000000F
#define _PCLKCON_HRRDY_MASK                      0x00008000
#define _PCLKCON_HRRDY_LENGTH                    0x00000001

#define _LFSR_LFSR_POSITION                      0x00000000
#define _LFSR_LFSR_MASK                          0x00007FFF
#define _LFSR_LFSR_LENGTH                        0x0000000F

#define _CMBTRIGL_CTA1EN_POSITION                0x00000000
#define _CMBTRIGL_CTA1EN_MASK                    0x00000001
#define _CMBTRIGL_CTA1EN_LENGTH                  0x00000001

#define _CMBTRIGL_CTA2EN_POSITION                0x00000001
#define _CMBTRIGL_CTA2EN_MASK                    0x00000002
#define _CMBTRIGL_CTA2EN_LENGTH                  0x00000001

#define _CMBTRIGL_CTA3EN_POSITION                0x00000002
#define _CMBTRIGL_CTA3EN_MASK                    0x00000004
#define _CMBTRIGL_CTA3EN_LENGTH                  0x00000001

#define _CMBTRIGL_CTA4EN_POSITION                0x00000003
#define _CMBTRIGL_CTA4EN_MASK                    0x00000008
#define _CMBTRIGL_CTA4EN_LENGTH                  0x00000001

#define _CMBTRIGL_CTA5EN_POSITION                0x00000004
#define _CMBTRIGL_CTA5EN_MASK                    0x00000010
#define _CMBTRIGL_CTA5EN_LENGTH                  0x00000001

#define _CMBTRIGL_CTA6EN_POSITION                0x00000005
#define _CMBTRIGL_CTA6EN_MASK                    0x00000020
#define _CMBTRIGL_CTA6EN_LENGTH                  0x00000001

#define _CMBTRIGL_CTA7EN_POSITION                0x00000006
#define _CMBTRIGL_CTA7EN_MASK                    0x00000040
#define _CMBTRIGL_CTA7EN_LENGTH                  0x00000001

#define _CMBTRIGL_CTA8EN_POSITION                0x00000007
#define _CMBTRIGL_CTA8EN_MASK                    0x00000080
#define _CMBTRIGL_CTA8EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB1EN_POSITION                0x00000000
#define _CMBTRIGH_CTB1EN_MASK                    0x00000001
#define _CMBTRIGH_CTB1EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB2EN_POSITION                0x00000001
#define _CMBTRIGH_CTB2EN_MASK                    0x00000002
#define _CMBTRIGH_CTB2EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB3EN_POSITION                0x00000002
#define _CMBTRIGH_CTB3EN_MASK                    0x00000004
#define _CMBTRIGH_CTB3EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB4EN_POSITION                0x00000003
#define _CMBTRIGH_CTB4EN_MASK                    0x00000008
#define _CMBTRIGH_CTB4EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB5EN_POSITION                0x00000004
#define _CMBTRIGH_CTB5EN_MASK                    0x00000010
#define _CMBTRIGH_CTB5EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB6EN_POSITION                0x00000005
#define _CMBTRIGH_CTB6EN_MASK                    0x00000020
#define _CMBTRIGH_CTB6EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB7EN_POSITION                0x00000006
#define _CMBTRIGH_CTB7EN_MASK                    0x00000040
#define _CMBTRIGH_CTB7EN_LENGTH                  0x00000001

#define _CMBTRIGH_CTB8EN_POSITION                0x00000007
#define _CMBTRIGH_CTB8EN_MASK                    0x00000080
#define _CMBTRIGH_CTB8EN_LENGTH                  0x00000001

#define _LOGCONA_PWMLFAD_POSITION                0x00000000
#define _LOGCONA_PWMLFAD_MASK                    0x00000007
#define _LOGCONA_PWMLFAD_LENGTH                  0x00000003

#define _LOGCONA_PWMLFA_POSITION                 0x00000004
#define _LOGCONA_PWMLFA_MASK                     0x00000030
#define _LOGCONA_PWMLFA_LENGTH                   0x00000002

