draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _PG1FPCIH_ACP_POSITION                   0x00000008
#define _PG1FPCIH_ACP_MASK                       0x00000700
#define _PG1FPCIH_ACP_LENGTH                     0x00000003

#define _PG1FPCIH_BPSEL_POSITION                 0x0000000C
#define _PG1FPCIH_BPSEL_MASK                     0x00007000
#define _PG1FPCIH_BPSEL_LENGTH                   0x00000003

#define _PG1FPCIH_BPEN_POSITION                  0x0000000F
#define _PG1FPCIH_BPEN_MASK                      0x00008000
#define _PG1FPCIH_BPEN_LENGTH                    0x00000001

#define _PG1FPCIH_PCIGT_POSITION                 0x00000004
#define _PG1FPCIH_PCIGT_MASK                     0x00000010
#define _PG1FPCIH_PCIGT_LENGTH                   0x00000001

#define _PG1CLPCIL_PSS_POSITION                  0x00000000
#define _PG1CLPCIL_PSS_MASK                      0x0000001F
#define _PG1CLPCIL_PSS_LENGTH                    0x00000005

#define _PG1CLPCIL_PPS_POSITION                  0x00000005
#define _PG1CLPCIL_PPS_MASK                      0x00000020
#define _PG1CLPCIL_PPS_LENGTH                    0x00000001

#define _PG1CLPCIL_PSYNC_POSITION                0x00000006
#define _PG1CLPCIL_PSYNC_MASK                    0x00000040
#define _PG1CLPCIL_PSYNC_LENGTH                  0x00000001

#define _PG1CLPCIL_SWTERM_POSITION               0x00000007
#define _PG1CLPCIL_SWTERM_MASK                   0x00000080
#define _PG1CLPCIL_SWTERM_LENGTH                 0x00000001

#define _PG1CLPCIL_AQSS_POSITION                 0x00000008
#define _PG1CLPCIL_AQSS_MASK                     0x00000700
#define _PG1CLPCIL_AQSS_LENGTH                   0x00000003

#define _PG1CLPCIL_AQPS_POSITION                 0x0000000B
#define _PG1CLPCIL_AQPS_MASK                     0x00000800
#define _PG1CLPCIL_AQPS_LENGTH                   0x00000001

#define _PG1CLPCIL_TERM_POSITION                 0x0000000C
#define _PG1CLPCIL_TERM_MASK                     0x00007000
#define _PG1CLPCIL_TERM_LENGTH                   0x00000003

#define _PG1CLPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG1CLPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG1CLPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG1CLPCIH_TQSS_POSITION                 0x00000000
#define _PG1CLPCIH_TQSS_MASK                     0x00000007
#define _PG1CLPCIH_TQSS_LENGTH                   0x00000003

#define _PG1CLPCIH_TQPS_POSITION                 0x00000003
#define _PG1CLPCIH_TQPS_MASK                     0x00000008
#define _PG1CLPCIH_TQPS_LENGTH                   0x00000001

#define _PG1CLPCIH_LATMOD_POSITION               0x00000004
#define _PG1CLPCIH_LATMOD_MASK                   0x00000010
#define _PG1CLPCIH_LATMOD_LENGTH                 0x00000001

#define _PG1CLPCIH_SWPCIM_POSITION               0x00000005
#define _PG1CLPCIH_SWPCIM_MASK                   0x00000060
#define _PG1CLPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG1CLPCIH_SWPCI_POSITION                0x00000007
#define _PG1CLPCIH_SWPCI_MASK                    0x00000080
#define _PG1CLPCIH_SWPCI_LENGTH                  0x00000001

#define _PG1CLPCIH_ACP_POSITION                  0x00000008
#define _PG1CLPCIH_ACP_MASK                      0x00000700
#define _PG1CLPCIH_ACP_LENGTH                    0x00000003

#define _PG1CLPCIH_BPSEL_POSITION                0x0000000C
#define _PG1CLPCIH_BPSEL_MASK                    0x00007000
#define _PG1CLPCIH_BPSEL_LENGTH                  0x00000003

#define _PG1CLPCIH_BPEN_POSITION                 0x0000000F
#define _PG1CLPCIH_BPEN_MASK                     0x00008000
#define _PG1CLPCIH_BPEN_LENGTH                   0x00000001

#define _PG1CLPCIH_PCIGT_POSITION                0x00000004
#define _PG1CLPCIH_PCIGT_MASK                    0x00000010
#define _PG1CLPCIH_PCIGT_LENGTH                  0x00000001

#define _PG1FFPCIL_PSS_POSITION                  0x00000000
#define _PG1FFPCIL_PSS_MASK                      0x0000001F
#define _PG1FFPCIL_PSS_LENGTH                    0x00000005

#define _PG1FFPCIL_PPS_POSITION                  0x00000005
#define _PG1FFPCIL_PPS_MASK                      0x00000020
#define _PG1FFPCIL_PPS_LENGTH                    0x00000001

#define _PG1FFPCIL_PSYNC_POSITION                0x00000006
#define _PG1FFPCIL_PSYNC_MASK                    0x00000040
#define _PG1FFPCIL_PSYNC_LENGTH                  0x00000001

#define _PG1FFPCIL_SWTERM_POSITION               0x00000007
#define _PG1FFPCIL_SWTERM_MASK                   0x00000080
#define _PG1FFPCIL_SWTERM_LENGTH                 0x00000001

#define _PG1FFPCIL_AQSS_POSITION                 0x00000008
#define _PG1FFPCIL_AQSS_MASK                     0x00000700
#define _PG1FFPCIL_AQSS_LENGTH                   0x00000003

#define _PG1FFPCIL_AQPS_POSITION                 0x0000000B
#define _PG1FFPCIL_AQPS_MASK                     0x00000800
#define _PG1FFPCIL_AQPS_LENGTH                   0x00000001

#define _PG1FFPCIL_TERM_POSITION                 0x0000000C
#define _PG1FFPCIL_TERM_MASK                     0x00007000
#define _PG1FFPCIL_TERM_LENGTH                   0x00000003

#define _PG1FFPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG1FFPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG1FFPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG1FFPCIH_TQSS_POSITION                 0x00000000
#define _PG1FFPCIH_TQSS_MASK                     0x00000007
#define _PG1FFPCIH_TQSS_LENGTH                   0x00000003

#define _PG1FFPCIH_TQPS_POSITION                 0x00000003
#define _PG1FFPCIH_TQPS_MASK                     0x00000008
#define _PG1FFPCIH_TQPS_LENGTH                   0x00000001

#define _PG1FFPCIH_LATMOD_POSITION               0x00000004
#define _PG1FFPCIH_LATMOD_MASK                   0x00000010
#define _PG1FFPCIH_LATMOD_LENGTH                 0x00000001

#define _PG1FFPCIH_SWPCIM_POSITION               0x00000005
#define _PG1FFPCIH_SWPCIM_MASK                   0x00000060
#define _PG1FFPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG1FFPCIH_SWPCI_POSITION                0x00000007
#define _PG1FFPCIH_SWPCI_MASK                    0x00000080
#define _PG1FFPCIH_SWPCI_LENGTH                  0x00000001

#define _PG1FFPCIH_ACP_POSITION                  0x00000008
#define _PG1FFPCIH_ACP_MASK                      0x00000700
#define _PG1FFPCIH_ACP_LENGTH                    0x00000003

#define _PG1FFPCIH_BPSEL_POSITION                0x0000000C
#define _PG1FFPCIH_BPSEL_MASK                    0x00007000
#define _PG1FFPCIH_BPSEL_LENGTH                  0x00000003

#define _PG1FFPCIH_BPEN_POSITION                 0x0000000F
#define _PG1FFPCIH_BPEN_MASK                     0x00008000
#define _PG1FFPCIH_BPEN_LENGTH                   0x00000001

#define _PG1FFPCIH_PCIGT_POSITION                0x00000004
#define _PG1FFPCIH_PCIGT_MASK                    0x00000010
#define _PG1FFPCIH_PCIGT_LENGTH                  0x00000001

#define _PG1SPCIL_PSS_POSITION                   0x00000000
#define _PG1SPCIL_PSS_MASK                       0x0000001F
#define _PG1SPCIL_PSS_LENGTH                     0x00000005

#define _PG1SPCIL_PPS_POSITION                   0x00000005
#define _PG1SPCIL_PPS_MASK                       0x00000020
#define _PG1SPCIL_PPS_LENGTH                     0x00000001

#define _PG1SPCIL_PSYNC_POSITION                 0x00000006
#define _PG1SPCIL_PSYNC_MASK                     0x00000040
#define _PG1SPCIL_PSYNC_LENGTH                   0x00000001

#define _PG1SPCIL_SWTERM_POSITION                0x00000007
#define _PG1SPCIL_SWTERM_MASK                    0x00000080
#define _PG1SPCIL_SWTERM_LENGTH                  0x00000001

#define _PG1SPCIL_AQSS_POSITION                  0x00000008
#define _PG1SPCIL_AQSS_MASK                      0x00000700
#define _PG1SPCIL_AQSS_LENGTH                    0x00000003

#define _PG1SPCIL_AQPS_POSITION                  0x0000000B
#define _PG1SPCIL_AQPS_MASK                      0x00000800
#define _PG1SPCIL_AQPS_LENGTH                    0x00000001

#define _PG1SPCIL_TERM_POSITION                  0x0000000C
#define _PG1SPCIL_TERM_MASK                      0x00007000
#define _PG1SPCIL_TERM_LENGTH                    0x00000003

#define _PG1SPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG1SPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG1SPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG1SPCIH_TQSS_POSITION                  0x00000000
#define _PG1SPCIH_TQSS_MASK                      0x00000007
#define _PG1SPCIH_TQSS_LENGTH                    0x00000003

#define _PG1SPCIH_TQPS_POSITION                  0x00000003
#define _PG1SPCIH_TQPS_MASK                      0x00000008
#define _PG1SPCIH_TQPS_LENGTH                    0x00000001

