draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _PG2FPCIL_PPS_POSITION                   0x00000005
#define _PG2FPCIL_PPS_MASK                       0x00000020
#define _PG2FPCIL_PPS_LENGTH                     0x00000001

#define _PG2FPCIL_PSYNC_POSITION                 0x00000006
#define _PG2FPCIL_PSYNC_MASK                     0x00000040
#define _PG2FPCIL_PSYNC_LENGTH                   0x00000001

#define _PG2FPCIL_SWTERM_POSITION                0x00000007
#define _PG2FPCIL_SWTERM_MASK                    0x00000080
#define _PG2FPCIL_SWTERM_LENGTH                  0x00000001

#define _PG2FPCIL_AQSS_POSITION                  0x00000008
#define _PG2FPCIL_AQSS_MASK                      0x00000700
#define _PG2FPCIL_AQSS_LENGTH                    0x00000003

#define _PG2FPCIL_AQPS_POSITION                  0x0000000B
#define _PG2FPCIL_AQPS_MASK                      0x00000800
#define _PG2FPCIL_AQPS_LENGTH                    0x00000001

#define _PG2FPCIL_TERM_POSITION                  0x0000000C
#define _PG2FPCIL_TERM_MASK                      0x00007000
#define _PG2FPCIL_TERM_LENGTH                    0x00000003

#define _PG2FPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG2FPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG2FPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG2FPCIH_TQSS_POSITION                  0x00000000
#define _PG2FPCIH_TQSS_MASK                      0x00000007
#define _PG2FPCIH_TQSS_LENGTH                    0x00000003

#define _PG2FPCIH_TQPS_POSITION                  0x00000003
#define _PG2FPCIH_TQPS_MASK                      0x00000008
#define _PG2FPCIH_TQPS_LENGTH                    0x00000001

#define _PG2FPCIH_LATMOD_POSITION                0x00000004
#define _PG2FPCIH_LATMOD_MASK                    0x00000010
#define _PG2FPCIH_LATMOD_LENGTH                  0x00000001

#define _PG2FPCIH_SWPCIM_POSITION                0x00000005
#define _PG2FPCIH_SWPCIM_MASK                    0x00000060
#define _PG2FPCIH_SWPCIM_LENGTH                  0x00000002

#define _PG2FPCIH_SWPCI_POSITION                 0x00000007
#define _PG2FPCIH_SWPCI_MASK                     0x00000080
#define _PG2FPCIH_SWPCI_LENGTH                   0x00000001

#define _PG2FPCIH_ACP_POSITION                   0x00000008
#define _PG2FPCIH_ACP_MASK                       0x00000700
#define _PG2FPCIH_ACP_LENGTH                     0x00000003

#define _PG2FPCIH_BPSEL_POSITION                 0x0000000C
#define _PG2FPCIH_BPSEL_MASK                     0x00007000
#define _PG2FPCIH_BPSEL_LENGTH                   0x00000003

#define _PG2FPCIH_BPEN_POSITION                  0x0000000F
#define _PG2FPCIH_BPEN_MASK                      0x00008000
#define _PG2FPCIH_BPEN_LENGTH                    0x00000001

#define _PG2FPCIH_PCIGT_POSITION                 0x00000004
#define _PG2FPCIH_PCIGT_MASK                     0x00000010
#define _PG2FPCIH_PCIGT_LENGTH                   0x00000001

#define _PG2CLPCIL_PSS_POSITION                  0x00000000
#define _PG2CLPCIL_PSS_MASK                      0x0000001F
#define _PG2CLPCIL_PSS_LENGTH                    0x00000005

#define _PG2CLPCIL_PPS_POSITION                  0x00000005
#define _PG2CLPCIL_PPS_MASK                      0x00000020
#define _PG2CLPCIL_PPS_LENGTH                    0x00000001

#define _PG2CLPCIL_PSYNC_POSITION                0x00000006
#define _PG2CLPCIL_PSYNC_MASK                    0x00000040
#define _PG2CLPCIL_PSYNC_LENGTH                  0x00000001

#define _PG2CLPCIL_SWTERM_POSITION               0x00000007
#define _PG2CLPCIL_SWTERM_MASK                   0x00000080
#define _PG2CLPCIL_SWTERM_LENGTH                 0x00000001

#define _PG2CLPCIL_AQSS_POSITION                 0x00000008
#define _PG2CLPCIL_AQSS_MASK                     0x00000700
#define _PG2CLPCIL_AQSS_LENGTH                   0x00000003

#define _PG2CLPCIL_AQPS_POSITION                 0x0000000B
#define _PG2CLPCIL_AQPS_MASK                     0x00000800
#define _PG2CLPCIL_AQPS_LENGTH                   0x00000001

#define _PG2CLPCIL_TERM_POSITION                 0x0000000C
#define _PG2CLPCIL_TERM_MASK                     0x00007000
#define _PG2CLPCIL_TERM_LENGTH                   0x00000003

#define _PG2CLPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG2CLPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG2CLPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG2CLPCIH_TQSS_POSITION                 0x00000000
#define _PG2CLPCIH_TQSS_MASK                     0x00000007
#define _PG2CLPCIH_TQSS_LENGTH                   0x00000003

#define _PG2CLPCIH_TQPS_POSITION                 0x00000003
#define _PG2CLPCIH_TQPS_MASK                     0x00000008
#define _PG2CLPCIH_TQPS_LENGTH                   0x00000001

#define _PG2CLPCIH_LATMOD_POSITION               0x00000004
#define _PG2CLPCIH_LATMOD_MASK                   0x00000010
#define _PG2CLPCIH_LATMOD_LENGTH                 0x00000001

#define _PG2CLPCIH_SWPCIM_POSITION               0x00000005
#define _PG2CLPCIH_SWPCIM_MASK                   0x00000060
#define _PG2CLPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG2CLPCIH_SWPCI_POSITION                0x00000007
#define _PG2CLPCIH_SWPCI_MASK                    0x00000080
#define _PG2CLPCIH_SWPCI_LENGTH                  0x00000001

#define _PG2CLPCIH_ACP_POSITION                  0x00000008
#define _PG2CLPCIH_ACP_MASK                      0x00000700
#define _PG2CLPCIH_ACP_LENGTH                    0x00000003

#define _PG2CLPCIH_BPSEL_POSITION                0x0000000C
#define _PG2CLPCIH_BPSEL_MASK                    0x00007000
#define _PG2CLPCIH_BPSEL_LENGTH                  0x00000003

#define _PG2CLPCIH_BPEN_POSITION                 0x0000000F
#define _PG2CLPCIH_BPEN_MASK                     0x00008000
#define _PG2CLPCIH_BPEN_LENGTH                   0x00000001

#define _PG2CLPCIH_PCIGT_POSITION                0x00000004
#define _PG2CLPCIH_PCIGT_MASK                    0x00000010
#define _PG2CLPCIH_PCIGT_LENGTH                  0x00000001

#define _PG2FFPCIL_PSS_POSITION                  0x00000000
#define _PG2FFPCIL_PSS_MASK                      0x0000001F
#define _PG2FFPCIL_PSS_LENGTH                    0x00000005

