draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _PG7FPCIH_ACP_POSITION                   0x00000008
#define _PG7FPCIH_ACP_MASK                       0x00000700
#define _PG7FPCIH_ACP_LENGTH                     0x00000003

#define _PG7FPCIH_BPSEL_POSITION                 0x0000000C
#define _PG7FPCIH_BPSEL_MASK                     0x00007000
#define _PG7FPCIH_BPSEL_LENGTH                   0x00000003

#define _PG7FPCIH_BPEN_POSITION                  0x0000000F
#define _PG7FPCIH_BPEN_MASK                      0x00008000
#define _PG7FPCIH_BPEN_LENGTH                    0x00000001

#define _PG7FPCIH_PCIGT_POSITION                 0x00000004
#define _PG7FPCIH_PCIGT_MASK                     0x00000010
#define _PG7FPCIH_PCIGT_LENGTH                   0x00000001

#define _PG7CLPCIL_PSS_POSITION                  0x00000000
#define _PG7CLPCIL_PSS_MASK                      0x0000001F
#define _PG7CLPCIL_PSS_LENGTH                    0x00000005

#define _PG7CLPCIL_PPS_POSITION                  0x00000005
#define _PG7CLPCIL_PPS_MASK                      0x00000020
#define _PG7CLPCIL_PPS_LENGTH                    0x00000001

#define _PG7CLPCIL_PSYNC_POSITION                0x00000006
#define _PG7CLPCIL_PSYNC_MASK                    0x00000040
#define _PG7CLPCIL_PSYNC_LENGTH                  0x00000001

#define _PG7CLPCIL_SWTERM_POSITION               0x00000007
#define _PG7CLPCIL_SWTERM_MASK                   0x00000080
#define _PG7CLPCIL_SWTERM_LENGTH                 0x00000001

#define _PG7CLPCIL_AQSS_POSITION                 0x00000008
#define _PG7CLPCIL_AQSS_MASK                     0x00000700
#define _PG7CLPCIL_AQSS_LENGTH                   0x00000003

#define _PG7CLPCIL_AQPS_POSITION                 0x0000000B
#define _PG7CLPCIL_AQPS_MASK                     0x00000800
#define _PG7CLPCIL_AQPS_LENGTH                   0x00000001

#define _PG7CLPCIL_TERM_POSITION                 0x0000000C
#define _PG7CLPCIL_TERM_MASK                     0x00007000
#define _PG7CLPCIL_TERM_LENGTH                   0x00000003

#define _PG7CLPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG7CLPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG7CLPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG7CLPCIH_TQSS_POSITION                 0x00000000
#define _PG7CLPCIH_TQSS_MASK                     0x00000007
#define _PG7CLPCIH_TQSS_LENGTH                   0x00000003

#define _PG7CLPCIH_TQPS_POSITION                 0x00000003
#define _PG7CLPCIH_TQPS_MASK                     0x00000008
#define _PG7CLPCIH_TQPS_LENGTH                   0x00000001

#define _PG7CLPCIH_LATMOD_POSITION               0x00000004
#define _PG7CLPCIH_LATMOD_MASK                   0x00000010
#define _PG7CLPCIH_LATMOD_LENGTH                 0x00000001

#define _PG7CLPCIH_SWPCIM_POSITION               0x00000005
#define _PG7CLPCIH_SWPCIM_MASK                   0x00000060
#define _PG7CLPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG7CLPCIH_SWPCI_POSITION                0x00000007
#define _PG7CLPCIH_SWPCI_MASK                    0x00000080
#define _PG7CLPCIH_SWPCI_LENGTH                  0x00000001

#define _PG7CLPCIH_ACP_POSITION                  0x00000008
#define _PG7CLPCIH_ACP_MASK                      0x00000700
#define _PG7CLPCIH_ACP_LENGTH                    0x00000003

#define _PG7CLPCIH_BPSEL_POSITION                0x0000000C
#define _PG7CLPCIH_BPSEL_MASK                    0x00007000
#define _PG7CLPCIH_BPSEL_LENGTH                  0x00000003

#define _PG7CLPCIH_BPEN_POSITION                 0x0000000F
#define _PG7CLPCIH_BPEN_MASK                     0x00008000
#define _PG7CLPCIH_BPEN_LENGTH                   0x00000001

#define _PG7CLPCIH_PCIGT_POSITION                0x00000004
#define _PG7CLPCIH_PCIGT_MASK                    0x00000010
#define _PG7CLPCIH_PCIGT_LENGTH                  0x00000001

#define _PG7FFPCIL_PSS_POSITION                  0x00000000
#define _PG7FFPCIL_PSS_MASK                      0x0000001F
#define _PG7FFPCIL_PSS_LENGTH                    0x00000005

#define _PG7FFPCIL_PPS_POSITION                  0x00000005
#define _PG7FFPCIL_PPS_MASK                      0x00000020
#define _PG7FFPCIL_PPS_LENGTH                    0x00000001

#define _PG7FFPCIL_PSYNC_POSITION                0x00000006
#define _PG7FFPCIL_PSYNC_MASK                    0x00000040
#define _PG7FFPCIL_PSYNC_LENGTH                  0x00000001

#define _PG7FFPCIL_SWTERM_POSITION               0x00000007
#define _PG7FFPCIL_SWTERM_MASK                   0x00000080
#define _PG7FFPCIL_SWTERM_LENGTH                 0x00000001

#define _PG7FFPCIL_AQSS_POSITION                 0x00000008
#define _PG7FFPCIL_AQSS_MASK                     0x00000700
#define _PG7FFPCIL_AQSS_LENGTH                   0x00000003

#define _PG7FFPCIL_AQPS_POSITION                 0x0000000B
#define _PG7FFPCIL_AQPS_MASK                     0x00000800
#define _PG7FFPCIL_AQPS_LENGTH                   0x00000001

#define _PG7FFPCIL_TERM_POSITION                 0x0000000C
#define _PG7FFPCIL_TERM_MASK                     0x00007000
#define _PG7FFPCIL_TERM_LENGTH                   0x00000003

#define _PG7FFPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG7FFPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG7FFPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG7FFPCIH_TQSS_POSITION                 0x00000000
#define _PG7FFPCIH_TQSS_MASK                     0x00000007
#define _PG7FFPCIH_TQSS_LENGTH                   0x00000003

#define _PG7FFPCIH_TQPS_POSITION                 0x00000003
#define _PG7FFPCIH_TQPS_MASK                     0x00000008
#define _PG7FFPCIH_TQPS_LENGTH                   0x00000001

#define _PG7FFPCIH_LATMOD_POSITION               0x00000004
#define _PG7FFPCIH_LATMOD_MASK                   0x00000010
#define _PG7FFPCIH_LATMOD_LENGTH                 0x00000001

#define _PG7FFPCIH_SWPCIM_POSITION               0x00000005
#define _PG7FFPCIH_SWPCIM_MASK                   0x00000060
#define _PG7FFPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG7FFPCIH_SWPCI_POSITION                0x00000007
#define _PG7FFPCIH_SWPCI_MASK                    0x00000080
#define _PG7FFPCIH_SWPCI_LENGTH                  0x00000001

#define _PG7FFPCIH_ACP_POSITION                  0x00000008
#define _PG7FFPCIH_ACP_MASK                      0x00000700
#define _PG7FFPCIH_ACP_LENGTH                    0x00000003

#define _PG7FFPCIH_BPSEL_POSITION                0x0000000C
#define _PG7FFPCIH_BPSEL_MASK                    0x00007000
#define _PG7FFPCIH_BPSEL_LENGTH                  0x00000003

#define _PG7FFPCIH_BPEN_POSITION                 0x0000000F
#define _PG7FFPCIH_BPEN_MASK                     0x00008000
#define _PG7FFPCIH_BPEN_LENGTH                   0x00000001

#define _PG7FFPCIH_PCIGT_POSITION                0x00000004
#define _PG7FFPCIH_PCIGT_MASK                    0x00000010
#define _PG7FFPCIH_PCIGT_LENGTH                  0x00000001

#define _PG7SPCIL_PSS_POSITION                   0x00000000
#define _PG7SPCIL_PSS_MASK                       0x0000001F
#define _PG7SPCIL_PSS_LENGTH                     0x00000005

#define _PG7SPCIL_PPS_POSITION                   0x00000005
#define _PG7SPCIL_PPS_MASK                       0x00000020
#define _PG7SPCIL_PPS_LENGTH                     0x00000001

#define _PG7SPCIL_PSYNC_POSITION                 0x00000006
#define _PG7SPCIL_PSYNC_MASK                     0x00000040
#define _PG7SPCIL_PSYNC_LENGTH                   0x00000001

#define _PG7SPCIL_SWTERM_POSITION                0x00000007
#define _PG7SPCIL_SWTERM_MASK                    0x00000080
#define _PG7SPCIL_SWTERM_LENGTH                  0x00000001

#define _PG7SPCIL_AQSS_POSITION                  0x00000008
#define _PG7SPCIL_AQSS_MASK                      0x00000700
#define _PG7SPCIL_AQSS_LENGTH                    0x00000003

#define _PG7SPCIL_AQPS_POSITION                  0x0000000B
#define _PG7SPCIL_AQPS_MASK                      0x00000800
#define _PG7SPCIL_AQPS_LENGTH                    0x00000001

#define _PG7SPCIL_TERM_POSITION                  0x0000000C
#define _PG7SPCIL_TERM_MASK                      0x00007000
#define _PG7SPCIL_TERM_LENGTH                    0x00000003

#define _PG7SPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG7SPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG7SPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG7SPCIH_TQSS_POSITION                  0x00000000
#define _PG7SPCIH_TQSS_MASK                      0x00000007
#define _PG7SPCIH_TQSS_LENGTH                    0x00000003

#define _PG7SPCIH_TQPS_POSITION                  0x00000003
#define _PG7SPCIH_TQPS_MASK                      0x00000008
#define _PG7SPCIH_TQPS_LENGTH                    0x00000001

