draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _PG8STAT_TRSET_POSITION                  0x00000007
#define _PG8STAT_TRSET_MASK                      0x00000080
#define _PG8STAT_TRSET_LENGTH                    0x00000001

#define _PG8STAT_FFACT_POSITION                  0x00000008
#define _PG8STAT_FFACT_MASK                      0x00000100
#define _PG8STAT_FFACT_LENGTH                    0x00000001

#define _PG8STAT_CLACT_POSITION                  0x00000009
#define _PG8STAT_CLACT_MASK                      0x00000200
#define _PG8STAT_CLACT_LENGTH                    0x00000001

#define _PG8STAT_FLTACT_POSITION                 0x0000000A
#define _PG8STAT_FLTACT_MASK                     0x00000400
#define _PG8STAT_FLTACT_LENGTH                   0x00000001

#define _PG8STAT_SACT_POSITION                   0x0000000B
#define _PG8STAT_SACT_MASK                       0x00000800
#define _PG8STAT_SACT_LENGTH                     0x00000001

#define _PG8STAT_FFEVT_POSITION                  0x0000000C
#define _PG8STAT_FFEVT_MASK                      0x00001000
#define _PG8STAT_FFEVT_LENGTH                    0x00000001

#define _PG8STAT_CLEVT_POSITION                  0x0000000D
#define _PG8STAT_CLEVT_MASK                      0x00002000
#define _PG8STAT_CLEVT_LENGTH                    0x00000001

#define _PG8STAT_FLTEVT_POSITION                 0x0000000E
#define _PG8STAT_FLTEVT_MASK                     0x00004000
#define _PG8STAT_FLTEVT_LENGTH                   0x00000001

#define _PG8STAT_SEVT_POSITION                   0x0000000F
#define _PG8STAT_SEVT_MASK                       0x00008000
#define _PG8STAT_SEVT_LENGTH                     0x00000001

#define _PG8IOCONL_DBDAT_POSITION                0x00000000
#define _PG8IOCONL_DBDAT_MASK                    0x00000003
#define _PG8IOCONL_DBDAT_LENGTH                  0x00000002

#define _PG8IOCONL_FFDAT_POSITION                0x00000002
#define _PG8IOCONL_FFDAT_MASK                    0x0000000C
#define _PG8IOCONL_FFDAT_LENGTH                  0x00000002

#define _PG8IOCONL_CLDAT_POSITION                0x00000004
#define _PG8IOCONL_CLDAT_MASK                    0x00000030
#define _PG8IOCONL_CLDAT_LENGTH                  0x00000002

#define _PG8IOCONL_FLTDAT_POSITION               0x00000006
#define _PG8IOCONL_FLTDAT_MASK                   0x000000C0
#define _PG8IOCONL_FLTDAT_LENGTH                 0x00000002

#define _PG8IOCONL_OSYNC_POSITION                0x00000008
#define _PG8IOCONL_OSYNC_MASK                    0x00000300
#define _PG8IOCONL_OSYNC_LENGTH                  0x00000002

#define _PG8IOCONL_OVRDAT_POSITION               0x0000000A
#define _PG8IOCONL_OVRDAT_MASK                   0x00000C00
#define _PG8IOCONL_OVRDAT_LENGTH                 0x00000002

#define _PG8IOCONL_OVRENL_POSITION               0x0000000C
#define _PG8IOCONL_OVRENL_MASK                   0x00001000
#define _PG8IOCONL_OVRENL_LENGTH                 0x00000001

#define _PG8IOCONL_OVRENH_POSITION               0x0000000D
#define _PG8IOCONL_OVRENH_MASK                   0x00002000
#define _PG8IOCONL_OVRENH_LENGTH                 0x00000001

#define _PG8IOCONL_SWAP_POSITION                 0x0000000E
#define _PG8IOCONL_SWAP_MASK                     0x00004000
#define _PG8IOCONL_SWAP_LENGTH                   0x00000001

#define _PG8IOCONL_CLMOD_POSITION                0x0000000F
#define _PG8IOCONL_CLMOD_MASK                    0x00008000
#define _PG8IOCONL_CLMOD_LENGTH                  0x00000001

#define _PG8IOCONH_POLL_POSITION                 0x00000000
#define _PG8IOCONH_POLL_MASK                     0x00000001
#define _PG8IOCONH_POLL_LENGTH                   0x00000001

#define _PG8IOCONH_POLH_POSITION                 0x00000001
#define _PG8IOCONH_POLH_MASK                     0x00000002
#define _PG8IOCONH_POLH_LENGTH                   0x00000001

#define _PG8IOCONH_PENL_POSITION                 0x00000002
#define _PG8IOCONH_PENL_MASK                     0x00000004
#define _PG8IOCONH_PENL_LENGTH                   0x00000001

#define _PG8IOCONH_PENH_POSITION                 0x00000003
#define _PG8IOCONH_PENH_MASK                     0x00000008
#define _PG8IOCONH_PENH_LENGTH                   0x00000001

#define _PG8IOCONH_PMOD_POSITION                 0x00000004
#define _PG8IOCONH_PMOD_MASK                     0x00000030
#define _PG8IOCONH_PMOD_LENGTH                   0x00000002

#define _PG8IOCONH_DTCMPSEL_POSITION             0x00000008
#define _PG8IOCONH_DTCMPSEL_MASK                 0x00000100
#define _PG8IOCONH_DTCMPSEL_LENGTH               0x00000001

#define _PG8IOCONH_CAPSRC_POSITION               0x0000000C
#define _PG8IOCONH_CAPSRC_MASK                   0x00007000
#define _PG8IOCONH_CAPSRC_LENGTH                 0x00000003

#define _PG8EVTL_PGTRGSEL_POSITION               0x00000000
#define _PG8EVTL_PGTRGSEL_MASK                   0x00000007
#define _PG8EVTL_PGTRGSEL_LENGTH                 0x00000003

#define _PG8EVTL_UPDTRG_POSITION                 0x00000003
#define _PG8EVTL_UPDTRG_MASK                     0x00000018
#define _PG8EVTL_UPDTRG_LENGTH                   0x00000002

#define _PG8EVTL_ADTR1EN1_POSITION               0x00000008
#define _PG8EVTL_ADTR1EN1_MASK                   0x00000100
#define _PG8EVTL_ADTR1EN1_LENGTH                 0x00000001

#define _PG8EVTL_ADTR1EN2_POSITION               0x00000009
#define _PG8EVTL_ADTR1EN2_MASK                   0x00000200
#define _PG8EVTL_ADTR1EN2_LENGTH                 0x00000001

#define _PG8EVTL_ADTR1EN3_POSITION               0x0000000A
#define _PG8EVTL_ADTR1EN3_MASK                   0x00000400
#define _PG8EVTL_ADTR1EN3_LENGTH                 0x00000001

#define _PG8EVTL_ADTR1PS_POSITION                0x0000000B
#define _PG8EVTL_ADTR1PS_MASK                    0x0000F800
#define _PG8EVTL_ADTR1PS_LENGTH                  0x00000005

#define _PG8EVTH_ADTR1OFS_POSITION               0x00000000
#define _PG8EVTH_ADTR1OFS_MASK                   0x0000001F
#define _PG8EVTH_ADTR1OFS_LENGTH                 0x00000005

#define _PG8EVTH_ADTR2EN1_POSITION               0x00000005
#define _PG8EVTH_ADTR2EN1_MASK                   0x00000020
#define _PG8EVTH_ADTR2EN1_LENGTH                 0x00000001

