draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _PG8SPCIH_ACP_POSITION                   0x00000008
#define _PG8SPCIH_ACP_MASK                       0x00000700
#define _PG8SPCIH_ACP_LENGTH                     0x00000003

#define _PG8SPCIH_BPSEL_POSITION                 0x0000000C
#define _PG8SPCIH_BPSEL_MASK                     0x00007000
#define _PG8SPCIH_BPSEL_LENGTH                   0x00000003

#define _PG8SPCIH_BPEN_POSITION                  0x0000000F
#define _PG8SPCIH_BPEN_MASK                      0x00008000
#define _PG8SPCIH_BPEN_LENGTH                    0x00000001

#define _PG8SPCIH_PCIGT_POSITION                 0x00000004
#define _PG8SPCIH_PCIGT_MASK                     0x00000010
#define _PG8SPCIH_PCIGT_LENGTH                   0x00000001

#define _PG8LEBH_PLF_POSITION                    0x00000000
#define _PG8LEBH_PLF_MASK                        0x00000001
#define _PG8LEBH_PLF_LENGTH                      0x00000001

#define _PG8LEBH_PLR_POSITION                    0x00000001
#define _PG8LEBH_PLR_MASK                        0x00000002
#define _PG8LEBH_PLR_LENGTH                      0x00000001

#define _PG8LEBH_PHF_POSITION                    0x00000002
#define _PG8LEBH_PHF_MASK                        0x00000004
#define _PG8LEBH_PHF_LENGTH                      0x00000001

#define _PG8LEBH_PHR_POSITION                    0x00000003
#define _PG8LEBH_PHR_MASK                        0x00000008
#define _PG8LEBH_PHR_LENGTH                      0x00000001

#define _PG8LEBH_PWMPCI_POSITION                 0x00000008
#define _PG8LEBH_PWMPCI_MASK                     0x00000700
#define _PG8LEBH_PWMPCI_LENGTH                   0x00000003

#define _PG8DCA_DCA_POSITION                     0x00000000
#define _PG8DCA_DCA_MASK                         0x000000FF
#define _PG8DCA_DCA_LENGTH                       0x00000008

#define _PG8DTL_DTL_POSITION                     0x00000000
#define _PG8DTL_DTL_MASK                         0x00003FFF
#define _PG8DTL_DTL_LENGTH                       0x0000000E

#define _PG8DTH_DTH_POSITION                     0x00000000
#define _PG8DTH_DTH_MASK                         0x00003FFF
#define _PG8DTH_DTH_LENGTH                       0x0000000E

#define _IFS0_INT0IF_POSITION                    0x00000000
#define _IFS0_INT0IF_MASK                        0x00000001
#define _IFS0_INT0IF_LENGTH                      0x00000001

#define _IFS0_T1IF_POSITION                      0x00000001
#define _IFS0_T1IF_MASK                          0x00000002
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_CNAIF_POSITION                     0x00000002
#define _IFS0_CNAIF_MASK                         0x00000004
#define _IFS0_CNAIF_LENGTH                       0x00000001

#define _IFS0_CNBIF_POSITION                     0x00000003
#define _IFS0_CNBIF_MASK                         0x00000008
#define _IFS0_CNBIF_LENGTH                       0x00000001

#define _IFS0_DMA0IF_POSITION                    0x00000004
#define _IFS0_DMA0IF_MASK                        0x00000010
#define _IFS0_DMA0IF_LENGTH                      0x00000001

#define _IFS0_CCP1IF_POSITION                    0x00000006
#define _IFS0_CCP1IF_MASK                        0x00000040
#define _IFS0_CCP1IF_LENGTH                      0x00000001

#define _IFS0_CCT1IF_POSITION                    0x00000007
#define _IFS0_CCT1IF_MASK                        0x00000080
#define _IFS0_CCT1IF_LENGTH                      0x00000001

#define _IFS0_DMA1IF_POSITION                    0x00000008
#define _IFS0_DMA1IF_MASK                        0x00000100
#define _IFS0_DMA1IF_LENGTH                      0x00000001

#define _IFS0_SPI1RXIF_POSITION                  0x00000009
#define _IFS0_SPI1RXIF_MASK                      0x00000200
#define _IFS0_SPI1RXIF_LENGTH                    0x00000001

#define _IFS0_SPI1TXIF_POSITION                  0x0000000A
#define _IFS0_SPI1TXIF_MASK                      0x00000400
#define _IFS0_SPI1TXIF_LENGTH                    0x00000001

#define _IFS0_U1RXIF_POSITION                    0x0000000B
#define _IFS0_U1RXIF_MASK                        0x00000800
#define _IFS0_U1RXIF_LENGTH                      0x00000001

#define _IFS0_U1TXIF_POSITION                    0x0000000C
#define _IFS0_U1TXIF_MASK                        0x00001000
#define _IFS0_U1TXIF_LENGTH                      0x00000001

#define _IFS0_ECCSBEIF_POSITION                  0x0000000D
#define _IFS0_ECCSBEIF_MASK                      0x00002000
#define _IFS0_ECCSBEIF_LENGTH                    0x00000001

#define _IFS0_NVMIF_POSITION                     0x0000000E
#define _IFS0_NVMIF_MASK                         0x00004000
#define _IFS0_NVMIF_LENGTH                       0x00000001

#define _IFS0_INT1IF_POSITION                    0x0000000F
#define _IFS0_INT1IF_MASK                        0x00008000
#define _IFS0_INT1IF_LENGTH                      0x00000001

#define _IFS1_SI2C1IF_POSITION                   0x00000000
#define _IFS1_SI2C1IF_MASK                       0x00000001
#define _IFS1_SI2C1IF_LENGTH                     0x00000001

#define _IFS1_MI2C1IF_POSITION                   0x00000001
#define _IFS1_MI2C1IF_MASK                       0x00000002
#define _IFS1_MI2C1IF_LENGTH                     0x00000001

#define _IFS1_DMA2IF_POSITION                    0x00000002
#define _IFS1_DMA2IF_MASK                        0x00000004
#define _IFS1_DMA2IF_LENGTH                      0x00000001

#define _IFS1_CNCIF_POSITION                     0x00000003
#define _IFS1_CNCIF_MASK                         0x00000008
#define _IFS1_CNCIF_LENGTH                       0x00000001

#define _IFS1_INT2IF_POSITION                    0x00000004
#define _IFS1_INT2IF_MASK                        0x00000010
#define _IFS1_INT2IF_LENGTH                      0x00000001

#define _IFS1_DMA3IF_POSITION                    0x00000005
#define _IFS1_DMA3IF_MASK                        0x00000020
#define _IFS1_DMA3IF_LENGTH                      0x00000001

#define _IFS1_CCP2IF_POSITION                    0x00000007
#define _IFS1_CCP2IF_MASK                        0x00000080
#define _IFS1_CCP2IF_LENGTH                      0x00000001

#define _IFS1_CCT2IF_POSITION                    0x00000008
#define _IFS1_CCT2IF_MASK                        0x00000100
#define _IFS1_CCT2IF_LENGTH                      0x00000001

