draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _IEC1_SPI2RXIE_POSITION                  0x0000000D
#define _IEC1_SPI2RXIE_MASK                      0x00002000
#define _IEC1_SPI2RXIE_LENGTH                    0x00000001

#define _IEC1_SPI2TXIE_POSITION                  0x0000000E
#define _IEC1_SPI2TXIE_MASK                      0x00004000
#define _IEC1_SPI2TXIE_LENGTH                    0x00000001

#define _IEC2_CCP3IE_POSITION                    0x00000003
#define _IEC2_CCP3IE_MASK                        0x00000008
#define _IEC2_CCP3IE_LENGTH                      0x00000001

#define _IEC2_CCT3IE_POSITION                    0x00000004
#define _IEC2_CCT3IE_MASK                        0x00000010
#define _IEC2_CCT3IE_LENGTH                      0x00000001

#define _IEC2_SI2C2IE_POSITION                   0x00000005
#define _IEC2_SI2C2IE_MASK                       0x00000020
#define _IEC2_SI2C2IE_LENGTH                     0x00000001

#define _IEC2_MI2C2IE_POSITION                   0x00000006
#define _IEC2_MI2C2IE_MASK                       0x00000040
#define _IEC2_MI2C2IE_LENGTH                     0x00000001

#define _IEC2_CCP4IE_POSITION                    0x00000008
#define _IEC2_CCP4IE_MASK                        0x00000100
#define _IEC2_CCP4IE_LENGTH                      0x00000001

#define _IEC2_CCT4IE_POSITION                    0x00000009
#define _IEC2_CCT4IE_MASK                        0x00000200
#define _IEC2_CCT4IE_LENGTH                      0x00000001

#define _IEC2_CCP5IE_POSITION                    0x0000000B
#define _IEC2_CCP5IE_MASK                        0x00000800
#define _IEC2_CCP5IE_LENGTH                      0x00000001

#define _IEC2_CCT5IE_POSITION                    0x0000000C
#define _IEC2_CCT5IE_MASK                        0x00001000
#define _IEC2_CCT5IE_LENGTH                      0x00000001

#define _IEC2_DMTIE_POSITION                     0x0000000D
#define _IEC2_DMTIE_MASK                         0x00002000
#define _IEC2_DMTIE_LENGTH                       0x00000001

#define _IEC2_CCP6IE_POSITION                    0x0000000E
#define _IEC2_CCP6IE_MASK                        0x00004000
#define _IEC2_CCP6IE_LENGTH                      0x00000001

#define _IEC2_CCT6IE_POSITION                    0x0000000F
#define _IEC2_CCT6IE_MASK                        0x00008000
#define _IEC2_CCT6IE_LENGTH                      0x00000001

#define _IEC3_QEI1IE_POSITION                    0x00000000
#define _IEC3_QEI1IE_MASK                        0x00000001
#define _IEC3_QEI1IE_LENGTH                      0x00000001

#define _IEC3_U1EIE_POSITION                     0x00000001
#define _IEC3_U1EIE_MASK                         0x00000002
#define _IEC3_U1EIE_LENGTH                       0x00000001

#define _IEC3_U2EIE_POSITION                     0x00000002
#define _IEC3_U2EIE_MASK                         0x00000004
#define _IEC3_U2EIE_LENGTH                       0x00000001

#define _IEC3_CRCIE_POSITION                     0x00000003
#define _IEC3_CRCIE_MASK                         0x00000008
#define _IEC3_CRCIE_LENGTH                       0x00000001

#define _IEC3_QEI2IE_POSITION                    0x00000006
#define _IEC3_QEI2IE_MASK                        0x00000040
#define _IEC3_QEI2IE_LENGTH                      0x00000001

#define _IEC3_U3EIE_POSITION                     0x00000008
#define _IEC3_U3EIE_MASK                         0x00000100
#define _IEC3_U3EIE_LENGTH                       0x00000001

#define _IEC3_U3RXIE_POSITION                    0x00000009
#define _IEC3_U3RXIE_MASK                        0x00000200
#define _IEC3_U3RXIE_LENGTH                      0x00000001

#define _IEC3_U3TXIE_POSITION                    0x0000000A
#define _IEC3_U3TXIE_MASK                        0x00000400
#define _IEC3_U3TXIE_LENGTH                      0x00000001

#define _IEC3_SPI3RXIE_POSITION                  0x0000000B
#define _IEC3_SPI3RXIE_MASK                      0x00000800
#define _IEC3_SPI3RXIE_LENGTH                    0x00000001

#define _IEC3_SPI3TXIE_POSITION                  0x0000000C
#define _IEC3_SPI3TXIE_MASK                      0x00001000
#define _IEC3_SPI3TXIE_LENGTH                    0x00000001

#define _IEC3_JTAGIE_POSITION                    0x0000000E
#define _IEC3_JTAGIE_MASK                        0x00004000
#define _IEC3_JTAGIE_LENGTH                      0x00000001

#define _IEC3_PTGSTEPIE_POSITION                 0x0000000F
#define _IEC3_PTGSTEPIE_MASK                     0x00008000
#define _IEC3_PTGSTEPIE_LENGTH                   0x00000001

#define _IEC4_I2C1BCIE_POSITION                  0x00000000
#define _IEC4_I2C1BCIE_MASK                      0x00000001
#define _IEC4_I2C1BCIE_LENGTH                    0x00000001

#define _IEC4_I2C2BCIE_POSITION                  0x00000001
#define _IEC4_I2C2BCIE_MASK                      0x00000002
#define _IEC4_I2C2BCIE_LENGTH                    0x00000001

#define _IEC4_PWM1IE_POSITION                    0x00000003
#define _IEC4_PWM1IE_MASK                        0x00000008
#define _IEC4_PWM1IE_LENGTH                      0x00000001

#define _IEC4_PWM2IE_POSITION                    0x00000004
#define _IEC4_PWM2IE_MASK                        0x00000010
#define _IEC4_PWM2IE_LENGTH                      0x00000001

#define _IEC4_PWM3IE_POSITION                    0x00000005
#define _IEC4_PWM3IE_MASK                        0x00000020
#define _IEC4_PWM3IE_LENGTH                      0x00000001

#define _IEC4_PWM4IE_POSITION                    0x00000006
#define _IEC4_PWM4IE_MASK                        0x00000040
#define _IEC4_PWM4IE_LENGTH                      0x00000001

#define _IEC4_PWM5IE_POSITION                    0x00000007
#define _IEC4_PWM5IE_MASK                        0x00000080
#define _IEC4_PWM5IE_LENGTH                      0x00000001

#define _IEC4_PWM6IE_POSITION                    0x00000008
#define _IEC4_PWM6IE_MASK                        0x00000100
#define _IEC4_PWM6IE_LENGTH                      0x00000001

#define _IEC4_PWM7IE_POSITION                    0x00000009
#define _IEC4_PWM7IE_MASK                        0x00000200
#define _IEC4_PWM7IE_LENGTH                      0x00000001

#define _IEC4_PWM8IE_POSITION                    0x0000000A
#define _IEC4_PWM8IE_MASK                        0x00000400
#define _IEC4_PWM8IE_LENGTH                      0x00000001

#define _IEC4_CNDIE_POSITION                     0x0000000B
#define _IEC4_CNDIE_MASK                         0x00000800
#define _IEC4_CNDIE_LENGTH                       0x00000001

#define _IEC4_CMP1IE_POSITION                    0x0000000D
#define _IEC4_CMP1IE_MASK                        0x00002000
#define _IEC4_CMP1IE_LENGTH                      0x00000001

