draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _IEC4_CMP2IE_POSITION                    0x0000000E
#define _IEC4_CMP2IE_MASK                        0x00004000
#define _IEC4_CMP2IE_LENGTH                      0x00000001

#define _IEC4_CMP3IE_POSITION                    0x0000000F
#define _IEC4_CMP3IE_MASK                        0x00008000
#define _IEC4_CMP3IE_LENGTH                      0x00000001

#define _IEC5_PTGWDTIE_POSITION                  0x00000001
#define _IEC5_PTGWDTIE_MASK                      0x00000002
#define _IEC5_PTGWDTIE_LENGTH                    0x00000001

#define _IEC5_PTG0IE_POSITION                    0x00000002
#define _IEC5_PTG0IE_MASK                        0x00000004
#define _IEC5_PTG0IE_LENGTH                      0x00000001

#define _IEC5_PTG1IE_POSITION                    0x00000003
#define _IEC5_PTG1IE_MASK                        0x00000008
#define _IEC5_PTG1IE_LENGTH                      0x00000001

#define _IEC5_PTG2IE_POSITION                    0x00000004
#define _IEC5_PTG2IE_MASK                        0x00000010
#define _IEC5_PTG2IE_LENGTH                      0x00000001

#define _IEC5_PTG3IE_POSITION                    0x00000005
#define _IEC5_PTG3IE_MASK                        0x00000020
#define _IEC5_PTG3IE_LENGTH                      0x00000001

#define _IEC5_SENT1IE_POSITION                   0x00000006
#define _IEC5_SENT1IE_MASK                       0x00000040
#define _IEC5_SENT1IE_LENGTH                     0x00000001

#define _IEC5_SENT1EIE_POSITION                  0x00000007
#define _IEC5_SENT1EIE_MASK                      0x00000080
#define _IEC5_SENT1EIE_LENGTH                    0x00000001

#define _IEC5_SENT2IE_POSITION                   0x00000008
#define _IEC5_SENT2IE_MASK                       0x00000100
#define _IEC5_SENT2IE_LENGTH                     0x00000001

#define _IEC5_SENT2EIE_POSITION                  0x00000009
#define _IEC5_SENT2EIE_MASK                      0x00000200
#define _IEC5_SENT2EIE_LENGTH                    0x00000001

#define _IEC5_ADCIE_POSITION                     0x0000000A
#define _IEC5_ADCIE_MASK                         0x00000400
#define _IEC5_ADCIE_LENGTH                       0x00000001

#define _IEC5_ADCAN0IE_POSITION                  0x0000000B
#define _IEC5_ADCAN0IE_MASK                      0x00000800
#define _IEC5_ADCAN0IE_LENGTH                    0x00000001

#define _IEC5_ADCAN1IE_POSITION                  0x0000000C
#define _IEC5_ADCAN1IE_MASK                      0x00001000
#define _IEC5_ADCAN1IE_LENGTH                    0x00000001

#define _IEC5_ADCAN2IE_POSITION                  0x0000000D
#define _IEC5_ADCAN2IE_MASK                      0x00002000
#define _IEC5_ADCAN2IE_LENGTH                    0x00000001

#define _IEC5_ADCAN3IE_POSITION                  0x0000000E
#define _IEC5_ADCAN3IE_MASK                      0x00004000
#define _IEC5_ADCAN3IE_LENGTH                    0x00000001

#define _IEC5_ADCAN4IE_POSITION                  0x0000000F
#define _IEC5_ADCAN4IE_MASK                      0x00008000
#define _IEC5_ADCAN4IE_LENGTH                    0x00000001

#define _IEC6_ADCAN5IE_POSITION                  0x00000000
#define _IEC6_ADCAN5IE_MASK                      0x00000001
#define _IEC6_ADCAN5IE_LENGTH                    0x00000001

#define _IEC6_ADCAN6IE_POSITION                  0x00000001
#define _IEC6_ADCAN6IE_MASK                      0x00000002
#define _IEC6_ADCAN6IE_LENGTH                    0x00000001

#define _IEC6_ADCAN7IE_POSITION                  0x00000002
#define _IEC6_ADCAN7IE_MASK                      0x00000004
#define _IEC6_ADCAN7IE_LENGTH                    0x00000001

#define _IEC6_ADCAN8IE_POSITION                  0x00000003
#define _IEC6_ADCAN8IE_MASK                      0x00000008
#define _IEC6_ADCAN8IE_LENGTH                    0x00000001

#define _IEC6_ADCAN9IE_POSITION                  0x00000004
#define _IEC6_ADCAN9IE_MASK                      0x00000010
#define _IEC6_ADCAN9IE_LENGTH                    0x00000001

#define _IEC6_ADCAN10IE_POSITION                 0x00000005
#define _IEC6_ADCAN10IE_MASK                     0x00000020
#define _IEC6_ADCAN10IE_LENGTH                   0x00000001

#define _IEC6_ADCAN11IE_POSITION                 0x00000006
#define _IEC6_ADCAN11IE_MASK                     0x00000040
#define _IEC6_ADCAN11IE_LENGTH                   0x00000001

#define _IEC6_ADCAN12IE_POSITION                 0x00000007
#define _IEC6_ADCAN12IE_MASK                     0x00000080
#define _IEC6_ADCAN12IE_LENGTH                   0x00000001

#define _IEC6_ADCAN13IE_POSITION                 0x00000008
#define _IEC6_ADCAN13IE_MASK                     0x00000100
#define _IEC6_ADCAN13IE_LENGTH                   0x00000001

#define _IEC6_ADCAN14IE_POSITION                 0x00000009
#define _IEC6_ADCAN14IE_MASK                     0x00000200
#define _IEC6_ADCAN14IE_LENGTH                   0x00000001

#define _IEC6_ADCAN15IE_POSITION                 0x0000000A
#define _IEC6_ADCAN15IE_MASK                     0x00000400
#define _IEC6_ADCAN15IE_LENGTH                   0x00000001

#define _IEC6_ADCAN16IE_POSITION                 0x0000000B
#define _IEC6_ADCAN16IE_MASK                     0x00000800
#define _IEC6_ADCAN16IE_LENGTH                   0x00000001

#define _IEC6_ADCAN17IE_POSITION                 0x0000000C
#define _IEC6_ADCAN17IE_MASK                     0x00001000
#define _IEC6_ADCAN17IE_LENGTH                   0x00000001

#define _IEC6_ADCAN18IE_POSITION                 0x0000000D
#define _IEC6_ADCAN18IE_MASK                     0x00002000
#define _IEC6_ADCAN18IE_LENGTH                   0x00000001

#define _IEC6_ADCAN19IE_POSITION                 0x0000000E
#define _IEC6_ADCAN19IE_MASK                     0x00004000
#define _IEC6_ADCAN19IE_LENGTH                   0x00000001

#define _IEC7_ADFLTIE_POSITION                   0x00000003
#define _IEC7_ADFLTIE_MASK                       0x00000008
#define _IEC7_ADFLTIE_LENGTH                     0x00000001

#define _IEC7_ADCMP0IE_POSITION                  0x00000004
#define _IEC7_ADCMP0IE_MASK                      0x00000010
#define _IEC7_ADCMP0IE_LENGTH                    0x00000001

#define _IEC7_ADCMP1IE_POSITION                  0x00000005
#define _IEC7_ADCMP1IE_MASK                      0x00000020
#define _IEC7_ADCMP1IE_LENGTH                    0x00000001

#define _IEC7_ADCMP2IE_POSITION                  0x00000006
#define _IEC7_ADCMP2IE_MASK                      0x00000040
#define _IEC7_ADCMP2IE_LENGTH                    0x00000001

#define _IEC7_ADCMP3IE_POSITION                  0x00000007
#define _IEC7_ADCMP3IE_MASK                      0x00000080
#define _IEC7_ADCMP3IE_LENGTH                    0x00000001

#define _IEC7_ADFLTR0IE_POSITION                 0x00000008
#define _IEC7_ADFLTR0IE_MASK                     0x00000100
#define _IEC7_ADFLTR0IE_LENGTH                   0x00000001

