draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _IEC7_ADFLTR1IE_POSITION                 0x00000009
#define _IEC7_ADFLTR1IE_MASK                     0x00000200
#define _IEC7_ADFLTR1IE_LENGTH                   0x00000001

#define _IEC7_ADFLTR2IE_POSITION                 0x0000000A
#define _IEC7_ADFLTR2IE_MASK                     0x00000400
#define _IEC7_ADFLTR2IE_LENGTH                   0x00000001

#define _IEC7_ADFLTR3IE_POSITION                 0x0000000B
#define _IEC7_ADFLTR3IE_MASK                     0x00000800
#define _IEC7_ADFLTR3IE_LENGTH                   0x00000001

#define _IEC7_CLC1PIE_POSITION                   0x0000000C
#define _IEC7_CLC1PIE_MASK                       0x00001000
#define _IEC7_CLC1PIE_LENGTH                     0x00000001

#define _IEC7_CLC2PIE_POSITION                   0x0000000D
#define _IEC7_CLC2PIE_MASK                       0x00002000
#define _IEC7_CLC2PIE_LENGTH                     0x00000001

#define _IEC7_SPI1IE_POSITION                    0x0000000E
#define _IEC7_SPI1IE_MASK                        0x00004000
#define _IEC7_SPI1IE_LENGTH                      0x00000001

#define _IEC7_SPI2IE_POSITION                    0x0000000F
#define _IEC7_SPI2IE_MASK                        0x00008000
#define _IEC7_SPI2IE_LENGTH                      0x00000001

#define _IEC8_SPI3IE_POSITION                    0x00000000
#define _IEC8_SPI3IE_MASK                        0x00000001
#define _IEC8_SPI3IE_LENGTH                      0x00000001

#define _IEC8_SI2C3IE_POSITION                   0x0000000E
#define _IEC8_SI2C3IE_MASK                       0x00004000
#define _IEC8_SI2C3IE_LENGTH                     0x00000001

#define _IEC8_MI2C3IE_POSITION                   0x0000000F
#define _IEC8_MI2C3IE_MASK                       0x00008000
#define _IEC8_MI2C3IE_LENGTH                     0x00000001

#define _IEC9_I2C3BCIE_POSITION                  0x00000000
#define _IEC9_I2C3BCIE_MASK                      0x00000001
#define _IEC9_I2C3BCIE_LENGTH                    0x00000001

#define _IEC9_CCP7IE_POSITION                    0x00000005
#define _IEC9_CCP7IE_MASK                        0x00000020
#define _IEC9_CCP7IE_LENGTH                      0x00000001

#define _IEC9_CCT7IE_POSITION                    0x00000006
#define _IEC9_CCT7IE_MASK                        0x00000040
#define _IEC9_CCT7IE_LENGTH                      0x00000001

#define _IEC9_CCP8IE_POSITION                    0x00000008
#define _IEC9_CCP8IE_MASK                        0x00000100
#define _IEC9_CCP8IE_LENGTH                      0x00000001

#define _IEC9_CCT8IE_POSITION                    0x00000009
#define _IEC9_CCT8IE_MASK                        0x00000200
#define _IEC9_CCT8IE_LENGTH                      0x00000001

#define _IEC10_ADC0EIE_POSITION                  0x00000000
#define _IEC10_ADC0EIE_MASK                      0x00000001
#define _IEC10_ADC0EIE_LENGTH                    0x00000001

#define _IEC10_ADC1EIE_POSITION                  0x00000001
#define _IEC10_ADC1EIE_MASK                      0x00000002
#define _IEC10_ADC1EIE_LENGTH                    0x00000001

#define _IEC10_ADFIFOIE_POSITION                 0x00000008
#define _IEC10_ADFIFOIE_MASK                     0x00000100
#define _IEC10_ADFIFOIE_LENGTH                   0x00000001

#define _IEC10_PEVTAIE_POSITION                  0x00000009
#define _IEC10_PEVTAIE_MASK                      0x00000200
#define _IEC10_PEVTAIE_LENGTH                    0x00000001

#define _IEC10_PEVTBIE_POSITION                  0x0000000A
#define _IEC10_PEVTBIE_MASK                      0x00000400
#define _IEC10_PEVTBIE_LENGTH                    0x00000001

#define _IEC10_PEVTCIE_POSITION                  0x0000000B
#define _IEC10_PEVTCIE_MASK                      0x00000800
#define _IEC10_PEVTCIE_LENGTH                    0x00000001

#define _IEC10_PEVTDIE_POSITION                  0x0000000C
#define _IEC10_PEVTDIE_MASK                      0x00001000
#define _IEC10_PEVTDIE_LENGTH                    0x00000001

#define _IEC10_PEVTEIE_POSITION                  0x0000000D
#define _IEC10_PEVTEIE_MASK                      0x00002000
#define _IEC10_PEVTEIE_LENGTH                    0x00000001

#define _IEC10_PEVTFIE_POSITION                  0x0000000E
#define _IEC10_PEVTFIE_MASK                      0x00004000
#define _IEC10_PEVTFIE_LENGTH                    0x00000001

#define _IEC10_CLC3PIE_POSITION                  0x0000000F
#define _IEC10_CLC3PIE_MASK                      0x00008000
#define _IEC10_CLC3PIE_LENGTH                    0x00000001

#define _IEC11_CLC4PIE_POSITION                  0x00000000
#define _IEC11_CLC4PIE_MASK                      0x00000001
#define _IEC11_CLC4PIE_LENGTH                    0x00000001

#define _IEC11_CLC1NIE_POSITION                  0x00000001
#define _IEC11_CLC1NIE_MASK                      0x00000002
#define _IEC11_CLC1NIE_LENGTH                    0x00000001

#define _IEC11_CLC2NIE_POSITION                  0x00000002
#define _IEC11_CLC2NIE_MASK                      0x00000004
#define _IEC11_CLC2NIE_LENGTH                    0x00000001

#define _IEC11_CLC3NIE_POSITION                  0x00000003
#define _IEC11_CLC3NIE_MASK                      0x00000008
#define _IEC11_CLC3NIE_LENGTH                    0x00000001

#define _IEC11_CLC4NIE_POSITION                  0x00000004
#define _IEC11_CLC4NIE_MASK                      0x00000010
#define _IEC11_CLC4NIE_LENGTH                    0x00000001

#define _IEC11_CCP9IE_POSITION                   0x00000005
#define _IEC11_CCP9IE_MASK                       0x00000020
#define _IEC11_CCP9IE_LENGTH                     0x00000001

#define _IEC11_CCT9IE_POSITION                   0x00000006
#define _IEC11_CCT9IE_MASK                       0x00000040
#define _IEC11_CCT9IE_LENGTH                     0x00000001

#define _IEC11_U1EVTIE_POSITION                  0x0000000D
#define _IEC11_U1EVTIE_MASK                      0x00002000
#define _IEC11_U1EVTIE_LENGTH                    0x00000001

#define _IEC11_U2EVTIE_POSITION                  0x0000000E
#define _IEC11_U2EVTIE_MASK                      0x00004000
#define _IEC11_U2EVTIE_LENGTH                    0x00000001

