draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _IPC19_CMP2IP_POSITION                   0x00000008
#define _IPC19_CMP2IP_MASK                       0x00000700
#define _IPC19_CMP2IP_LENGTH                     0x00000003

#define _IPC19_CMP3IP_POSITION                   0x0000000C
#define _IPC19_CMP3IP_MASK                       0x00007000
#define _IPC19_CMP3IP_LENGTH                     0x00000003

#define _IPC20_PTGWDTIP_POSITION                 0x00000004
#define _IPC20_PTGWDTIP_MASK                     0x00000070
#define _IPC20_PTGWDTIP_LENGTH                   0x00000003

#define _IPC20_PTG0IP_POSITION                   0x00000008
#define _IPC20_PTG0IP_MASK                       0x00000700
#define _IPC20_PTG0IP_LENGTH                     0x00000003

#define _IPC20_PTG1IP_POSITION                   0x0000000C
#define _IPC20_PTG1IP_MASK                       0x00007000
#define _IPC20_PTG1IP_LENGTH                     0x00000003

#define _IPC21_PTG2IP_POSITION                   0x00000000
#define _IPC21_PTG2IP_MASK                       0x00000007
#define _IPC21_PTG2IP_LENGTH                     0x00000003

#define _IPC21_PTG3IP_POSITION                   0x00000004
#define _IPC21_PTG3IP_MASK                       0x00000070
#define _IPC21_PTG3IP_LENGTH                     0x00000003

#define _IPC21_SENT1IP_POSITION                  0x00000008
#define _IPC21_SENT1IP_MASK                      0x00000700
#define _IPC21_SENT1IP_LENGTH                    0x00000003

#define _IPC21_SENT1EIP_POSITION                 0x0000000C
#define _IPC21_SENT1EIP_MASK                     0x00007000
#define _IPC21_SENT1EIP_LENGTH                   0x00000003

#define _IPC22_SENT2IP_POSITION                  0x00000000
#define _IPC22_SENT2IP_MASK                      0x00000007
#define _IPC22_SENT2IP_LENGTH                    0x00000003

#define _IPC22_SENT2EIP_POSITION                 0x00000004
#define _IPC22_SENT2EIP_MASK                     0x00000070
#define _IPC22_SENT2EIP_LENGTH                   0x00000003

#define _IPC22_ADCIP_POSITION                    0x00000008
#define _IPC22_ADCIP_MASK                        0x00000700
#define _IPC22_ADCIP_LENGTH                      0x00000003

#define _IPC22_ADCAN0IP_POSITION                 0x0000000C
#define _IPC22_ADCAN0IP_MASK                     0x00007000
#define _IPC22_ADCAN0IP_LENGTH                   0x00000003

#define _IPC23_ADCAN1IP_POSITION                 0x00000000
#define _IPC23_ADCAN1IP_MASK                     0x00000007
#define _IPC23_ADCAN1IP_LENGTH                   0x00000003

#define _IPC23_ADCAN2IP_POSITION                 0x00000004
#define _IPC23_ADCAN2IP_MASK                     0x00000070
#define _IPC23_ADCAN2IP_LENGTH                   0x00000003

#define _IPC23_ADCAN3IP_POSITION                 0x00000008
#define _IPC23_ADCAN3IP_MASK                     0x00000700
#define _IPC23_ADCAN3IP_LENGTH                   0x00000003

#define _IPC23_ADCAN4IP_POSITION                 0x0000000C
#define _IPC23_ADCAN4IP_MASK                     0x00007000
#define _IPC23_ADCAN4IP_LENGTH                   0x00000003

#define _IPC24_ADCAN5IP_POSITION                 0x00000000
#define _IPC24_ADCAN5IP_MASK                     0x00000007
#define _IPC24_ADCAN5IP_LENGTH                   0x00000003

#define _IPC24_ADCAN6IP_POSITION                 0x00000004
#define _IPC24_ADCAN6IP_MASK                     0x00000070
#define _IPC24_ADCAN6IP_LENGTH                   0x00000003

#define _IPC24_ADCAN7IP_POSITION                 0x00000008
#define _IPC24_ADCAN7IP_MASK                     0x00000700
#define _IPC24_ADCAN7IP_LENGTH                   0x00000003

#define _IPC24_ADCAN8IP_POSITION                 0x0000000C
#define _IPC24_ADCAN8IP_MASK                     0x00007000
#define _IPC24_ADCAN8IP_LENGTH                   0x00000003

#define _IPC25_ADCAN9IP_POSITION                 0x00000000
#define _IPC25_ADCAN9IP_MASK                     0x00000007
#define _IPC25_ADCAN9IP_LENGTH                   0x00000003

#define _IPC25_ADCAN10IP_POSITION                0x00000004
#define _IPC25_ADCAN10IP_MASK                    0x00000070
#define _IPC25_ADCAN10IP_LENGTH                  0x00000003

#define _IPC25_ADCAN11IP_POSITION                0x00000008
#define _IPC25_ADCAN11IP_MASK                    0x00000700
#define _IPC25_ADCAN11IP_LENGTH                  0x00000003

#define _IPC25_ADCAN12IP_POSITION                0x0000000C
#define _IPC25_ADCAN12IP_MASK                    0x00007000
#define _IPC25_ADCAN12IP_LENGTH                  0x00000003

#define _IPC26_ADCAN13IP_POSITION                0x00000000
#define _IPC26_ADCAN13IP_MASK                    0x00000007
#define _IPC26_ADCAN13IP_LENGTH                  0x00000003

#define _IPC26_ADCAN14IP_POSITION                0x00000004
#define _IPC26_ADCAN14IP_MASK                    0x00000070
#define _IPC26_ADCAN14IP_LENGTH                  0x00000003

#define _IPC26_ADCAN15IP_POSITION                0x00000008
#define _IPC26_ADCAN15IP_MASK                    0x00000700
#define _IPC26_ADCAN15IP_LENGTH                  0x00000003

#define _IPC26_ADCAN16IP_POSITION                0x0000000C
#define _IPC26_ADCAN16IP_MASK                    0x00007000
#define _IPC26_ADCAN16IP_LENGTH                  0x00000003

#define _IPC27_ADCAN17IP_POSITION                0x00000000
#define _IPC27_ADCAN17IP_MASK                    0x00000007
#define _IPC27_ADCAN17IP_LENGTH                  0x00000003

#define _IPC27_ADCAN18IP_POSITION                0x00000004
#define _IPC27_ADCAN18IP_MASK                    0x00000070
#define _IPC27_ADCAN18IP_LENGTH                  0x00000003

#define _IPC27_ADCAN19IP_POSITION                0x00000008
#define _IPC27_ADCAN19IP_MASK                    0x00000700
#define _IPC27_ADCAN19IP_LENGTH                  0x00000003

#define _IPC28_ADFLTIP_POSITION                  0x0000000C
#define _IPC28_ADFLTIP_MASK                      0x00007000
#define _IPC28_ADFLTIP_LENGTH                    0x00000003

#define _IPC29_ADCMP0IP_POSITION                 0x00000000
#define _IPC29_ADCMP0IP_MASK                     0x00000007
#define _IPC29_ADCMP0IP_LENGTH                   0x00000003

#define _IPC29_ADCMP1IP_POSITION                 0x00000004
#define _IPC29_ADCMP1IP_MASK                     0x00000070
#define _IPC29_ADCMP1IP_LENGTH                   0x00000003

#define _IPC29_ADCMP2IP_POSITION                 0x00000008
#define _IPC29_ADCMP2IP_MASK                     0x00000700
#define _IPC29_ADCMP2IP_LENGTH                   0x00000003

#define _IPC29_ADCMP3IP_POSITION                 0x0000000C
#define _IPC29_ADCMP3IP_MASK                     0x00007000
#define _IPC29_ADCMP3IP_LENGTH                   0x00000003

