draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _IBIASCONH_SHRSRCEN3_POSITION            0x0000000D
#define _IBIASCONH_SHRSRCEN3_MASK                0x00002000
#define _IBIASCONH_SHRSRCEN3_LENGTH              0x00000001

#define _PTGCST_PTGITM_POSITION                  0x00000000
#define _PTGCST_PTGITM_MASK                      0x00000003
#define _PTGCST_PTGITM_LENGTH                    0x00000002

#define _PTGCST_PTGBUSY_POSITION                 0x00000005
#define _PTGCST_PTGBUSY_MASK                     0x00000020
#define _PTGCST_PTGBUSY_LENGTH                   0x00000001

#define _PTGCST_PTGWTO_POSITION                  0x00000006
#define _PTGCST_PTGWTO_MASK                      0x00000040
#define _PTGCST_PTGWTO_LENGTH                    0x00000001

#define _PTGCST_PTGSTRT_POSITION                 0x00000007
#define _PTGCST_PTGSTRT_MASK                     0x00000080
#define _PTGCST_PTGSTRT_LENGTH                   0x00000001

#define _PTGCST_PTGIVIS_POSITION                 0x00000008
#define _PTGCST_PTGIVIS_MASK                     0x00000100
#define _PTGCST_PTGIVIS_LENGTH                   0x00000001

#define _PTGCST_PTGSSEN_POSITION                 0x00000009
#define _PTGCST_PTGSSEN_MASK                     0x00000200
#define _PTGCST_PTGSSEN_LENGTH                   0x00000001

#define _PTGCST_PTGSWT_POSITION                  0x0000000A
#define _PTGCST_PTGSWT_MASK                      0x00000400
#define _PTGCST_PTGSWT_LENGTH                    0x00000001

#define _PTGCST_PTGTOGL_POSITION                 0x0000000C
#define _PTGCST_PTGTOGL_MASK                     0x00001000
#define _PTGCST_PTGTOGL_LENGTH                   0x00000001

#define _PTGCST_PTGSIDL_POSITION                 0x0000000D
#define _PTGCST_PTGSIDL_MASK                     0x00002000
#define _PTGCST_PTGSIDL_LENGTH                   0x00000001

#define _PTGCST_PTGEN_POSITION                   0x0000000F
#define _PTGCST_PTGEN_MASK                       0x00008000
#define _PTGCST_PTGEN_LENGTH                     0x00000001

#define _PTGCON_PTGWDT_POSITION                  0x00000000
#define _PTGCON_PTGWDT_MASK                      0x00000007
#define _PTGCON_PTGWDT_LENGTH                    0x00000003

#define _PTGCON_PTGPWD_POSITION                  0x00000004
#define _PTGCON_PTGPWD_MASK                      0x000000F0
#define _PTGCON_PTGPWD_LENGTH                    0x00000004

#define _PTGCON_PTGDIV_POSITION                  0x00000008
#define _PTGCON_PTGDIV_MASK                      0x00001F00
#define _PTGCON_PTGDIV_LENGTH                    0x00000005

#define _PTGCON_PTGCLK_POSITION                  0x0000000D
#define _PTGCON_PTGCLK_MASK                      0x0000E000
#define _PTGCON_PTGCLK_LENGTH                    0x00000003

#define _PTGBTE_PTGBTE0_POSITION                 0x00000000
#define _PTGBTE_PTGBTE0_MASK                     0x00000001
#define _PTGBTE_PTGBTE0_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE1_POSITION                 0x00000001
#define _PTGBTE_PTGBTE1_MASK                     0x00000002
#define _PTGBTE_PTGBTE1_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE2_POSITION                 0x00000002
#define _PTGBTE_PTGBTE2_MASK                     0x00000004
#define _PTGBTE_PTGBTE2_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE3_POSITION                 0x00000003
#define _PTGBTE_PTGBTE3_MASK                     0x00000008
#define _PTGBTE_PTGBTE3_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE4_POSITION                 0x00000004
#define _PTGBTE_PTGBTE4_MASK                     0x00000010
#define _PTGBTE_PTGBTE4_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE5_POSITION                 0x00000005
#define _PTGBTE_PTGBTE5_MASK                     0x00000020
#define _PTGBTE_PTGBTE5_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE6_POSITION                 0x00000006
#define _PTGBTE_PTGBTE6_MASK                     0x00000040
#define _PTGBTE_PTGBTE6_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE7_POSITION                 0x00000007
#define _PTGBTE_PTGBTE7_MASK                     0x00000080
#define _PTGBTE_PTGBTE7_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE8_POSITION                 0x00000008
#define _PTGBTE_PTGBTE8_MASK                     0x00000100
#define _PTGBTE_PTGBTE8_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE9_POSITION                 0x00000009
#define _PTGBTE_PTGBTE9_MASK                     0x00000200
#define _PTGBTE_PTGBTE9_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE10_POSITION                0x0000000A
#define _PTGBTE_PTGBTE10_MASK                    0x00000400
#define _PTGBTE_PTGBTE10_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE11_POSITION                0x0000000B
#define _PTGBTE_PTGBTE11_MASK                    0x00000800
#define _PTGBTE_PTGBTE11_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE12_POSITION                0x0000000C
#define _PTGBTE_PTGBTE12_MASK                    0x00001000
#define _PTGBTE_PTGBTE12_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE13_POSITION                0x0000000D
#define _PTGBTE_PTGBTE13_MASK                    0x00002000
#define _PTGBTE_PTGBTE13_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE14_POSITION                0x0000000E
#define _PTGBTE_PTGBTE14_MASK                    0x00004000
#define _PTGBTE_PTGBTE14_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE15_POSITION                0x0000000F
#define _PTGBTE_PTGBTE15_MASK                    0x00008000
#define _PTGBTE_PTGBTE15_LENGTH                  0x00000001

#define _PTGBTEH_PTGBTE16_POSITION               0x00000000
#define _PTGBTEH_PTGBTE16_MASK                   0x00000001
#define _PTGBTEH_PTGBTE16_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE17_POSITION               0x00000001
#define _PTGBTEH_PTGBTE17_MASK                   0x00000002
#define _PTGBTEH_PTGBTE17_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE18_POSITION               0x00000002
#define _PTGBTEH_PTGBTE18_MASK                   0x00000004
#define _PTGBTEH_PTGBTE18_LENGTH                 0x00000001

