draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _CCP5CON2H_AUXOUT_POSITION               0x00000003
#define _CCP5CON2H_AUXOUT_MASK                   0x00000018
#define _CCP5CON2H_AUXOUT_LENGTH                 0x00000002

#define _CCP5CON2H_ICGSM_POSITION                0x00000006
#define _CCP5CON2H_ICGSM_MASK                    0x000000C0
#define _CCP5CON2H_ICGSM_LENGTH                  0x00000002

#define _CCP5CON2H_OCAEN_POSITION                0x00000008
#define _CCP5CON2H_OCAEN_MASK                    0x00000100
#define _CCP5CON2H_OCAEN_LENGTH                  0x00000001

#define _CCP5CON2H_OENSYNC_POSITION              0x0000000F
#define _CCP5CON2H_OENSYNC_MASK                  0x00008000
#define _CCP5CON2H_OENSYNC_LENGTH                0x00000001

#define _CCP5CON2H_ICS0_POSITION                 0x00000000
#define _CCP5CON2H_ICS0_MASK                     0x00000001
#define _CCP5CON2H_ICS0_LENGTH                   0x00000001

#define _CCP5CON2H_ICS1_POSITION                 0x00000001
#define _CCP5CON2H_ICS1_MASK                     0x00000002
#define _CCP5CON2H_ICS1_LENGTH                   0x00000001

#define _CCP5CON2H_ICS2_POSITION                 0x00000002
#define _CCP5CON2H_ICS2_MASK                     0x00000004
#define _CCP5CON2H_ICS2_LENGTH                   0x00000001

#define _CCP5CON2H_AUXOUT0_POSITION              0x00000003
#define _CCP5CON2H_AUXOUT0_MASK                  0x00000008
#define _CCP5CON2H_AUXOUT0_LENGTH                0x00000001

#define _CCP5CON2H_AUXOUT1_POSITION              0x00000004
#define _CCP5CON2H_AUXOUT1_MASK                  0x00000010
#define _CCP5CON2H_AUXOUT1_LENGTH                0x00000001

#define _CCP5CON2H_ICGSM0_POSITION               0x00000006
#define _CCP5CON2H_ICGSM0_MASK                   0x00000040
#define _CCP5CON2H_ICGSM0_LENGTH                 0x00000001

#define _CCP5CON2H_ICGSM1_POSITION               0x00000007
#define _CCP5CON2H_ICGSM1_MASK                   0x00000080
#define _CCP5CON2H_ICGSM1_LENGTH                 0x00000001

#define _CCP5CON2H_ICSEL_POSITION                0x00000000
#define _CCP5CON2H_ICSEL_MASK                    0x00000007
#define _CCP5CON2H_ICSEL_LENGTH                  0x00000003

#define _CCP5CON2H_ICSEL0_POSITION               0x00000000
#define _CCP5CON2H_ICSEL0_MASK                   0x00000001
#define _CCP5CON2H_ICSEL0_LENGTH                 0x00000001

#define _CCP5CON2H_ICSEL1_POSITION               0x00000001
#define _CCP5CON2H_ICSEL1_MASK                   0x00000002
#define _CCP5CON2H_ICSEL1_LENGTH                 0x00000001

#define _CCP5CON2H_ICSEL2_POSITION               0x00000002
#define _CCP5CON2H_ICSEL2_MASK                   0x00000004
#define _CCP5CON2H_ICSEL2_LENGTH                 0x00000001

#define _CCP5CON3H_PSSACE_POSITION               0x00000002
#define _CCP5CON3H_PSSACE_MASK                   0x0000000C
#define _CCP5CON3H_PSSACE_LENGTH                 0x00000002

#define _CCP5CON3H_POLACE_POSITION               0x00000005
#define _CCP5CON3H_POLACE_MASK                   0x00000020
#define _CCP5CON3H_POLACE_LENGTH                 0x00000001

#define _CCP5CON3H_OSCNT_POSITION                0x0000000C
#define _CCP5CON3H_OSCNT_MASK                    0x00007000
#define _CCP5CON3H_OSCNT_LENGTH                  0x00000003

#define _CCP5CON3H_OETRIG_POSITION               0x0000000F
#define _CCP5CON3H_OETRIG_MASK                   0x00008000
#define _CCP5CON3H_OETRIG_LENGTH                 0x00000001

#define _CCP5CON3H_PSSACE0_POSITION              0x00000002
#define _CCP5CON3H_PSSACE0_MASK                  0x00000004
#define _CCP5CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP5CON3H_PSSACE1_POSITION              0x00000003
#define _CCP5CON3H_PSSACE1_MASK                  0x00000008
#define _CCP5CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP5CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP5CON3H_OSCNT0_MASK                   0x00001000
#define _CCP5CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP5CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP5CON3H_OSCNT1_MASK                   0x00002000
#define _CCP5CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP5CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP5CON3H_OSCNT2_MASK                   0x00004000
#define _CCP5CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP5STAT_ICBNE_POSITION                 0x00000000
#define _CCP5STAT_ICBNE_MASK                     0x00000001
#define _CCP5STAT_ICBNE_LENGTH                   0x00000001

#define _CCP5STAT_ICOV_POSITION                  0x00000001
#define _CCP5STAT_ICOV_MASK                      0x00000002
#define _CCP5STAT_ICOV_LENGTH                    0x00000001

#define _CCP5STAT_ICDIS_POSITION                 0x00000002
#define _CCP5STAT_ICDIS_MASK                     0x00000004
#define _CCP5STAT_ICDIS_LENGTH                   0x00000001

#define _CCP5STAT_SCEVT_POSITION                 0x00000003
#define _CCP5STAT_SCEVT_MASK                     0x00000008
#define _CCP5STAT_SCEVT_LENGTH                   0x00000001

#define _CCP5STAT_ASEVT_POSITION                 0x00000004
#define _CCP5STAT_ASEVT_MASK                     0x00000010
#define _CCP5STAT_ASEVT_LENGTH                   0x00000001

#define _CCP5STAT_TRCLR_POSITION                 0x00000005
#define _CCP5STAT_TRCLR_MASK                     0x00000020
#define _CCP5STAT_TRCLR_LENGTH                   0x00000001

#define _CCP5STAT_TRSET_POSITION                 0x00000006
#define _CCP5STAT_TRSET_MASK                     0x00000040
#define _CCP5STAT_TRSET_LENGTH                   0x00000001

#define _CCP5STAT_CCPTRIG_POSITION               0x00000007
#define _CCP5STAT_CCPTRIG_MASK                   0x00000080
#define _CCP5STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP5STAT_ICGARM_POSITION                0x0000000A
#define _CCP5STAT_ICGARM_MASK                    0x00000400
#define _CCP5STAT_ICGARM_LENGTH                  0x00000001

#define _CCP5STAT_TRIG_POSITION                  0x00000007
#define _CCP5STAT_TRIG_MASK                      0x00000080
#define _CCP5STAT_TRIG_LENGTH                    0x00000001

#define _CCP5STATL_ICBNE_POSITION                0x00000000
#define _CCP5STATL_ICBNE_MASK                    0x00000001
#define _CCP5STATL_ICBNE_LENGTH                  0x00000001

#define _CCP5STATL_ICOV_POSITION                 0x00000001
#define _CCP5STATL_ICOV_MASK                     0x00000002
#define _CCP5STATL_ICOV_LENGTH                   0x00000001

