draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _CCP9CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP9CON3H_OSCNT1_MASK                   0x00002000
#define _CCP9CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP9CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP9CON3H_OSCNT2_MASK                   0x00004000
#define _CCP9CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP9STAT_ICBNE_POSITION                 0x00000000
#define _CCP9STAT_ICBNE_MASK                     0x00000001
#define _CCP9STAT_ICBNE_LENGTH                   0x00000001

#define _CCP9STAT_ICOV_POSITION                  0x00000001
#define _CCP9STAT_ICOV_MASK                      0x00000002
#define _CCP9STAT_ICOV_LENGTH                    0x00000001

#define _CCP9STAT_ICDIS_POSITION                 0x00000002
#define _CCP9STAT_ICDIS_MASK                     0x00000004
#define _CCP9STAT_ICDIS_LENGTH                   0x00000001

#define _CCP9STAT_SCEVT_POSITION                 0x00000003
#define _CCP9STAT_SCEVT_MASK                     0x00000008
#define _CCP9STAT_SCEVT_LENGTH                   0x00000001

#define _CCP9STAT_ASEVT_POSITION                 0x00000004
#define _CCP9STAT_ASEVT_MASK                     0x00000010
#define _CCP9STAT_ASEVT_LENGTH                   0x00000001

#define _CCP9STAT_TRCLR_POSITION                 0x00000005
#define _CCP9STAT_TRCLR_MASK                     0x00000020
#define _CCP9STAT_TRCLR_LENGTH                   0x00000001

#define _CCP9STAT_TRSET_POSITION                 0x00000006
#define _CCP9STAT_TRSET_MASK                     0x00000040
#define _CCP9STAT_TRSET_LENGTH                   0x00000001

#define _CCP9STAT_CCPTRIG_POSITION               0x00000007
#define _CCP9STAT_CCPTRIG_MASK                   0x00000080
#define _CCP9STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP9STAT_ICGARM_POSITION                0x0000000A
#define _CCP9STAT_ICGARM_MASK                    0x00000400
#define _CCP9STAT_ICGARM_LENGTH                  0x00000001

#define _CCP9STAT_TRIG_POSITION                  0x00000007
#define _CCP9STAT_TRIG_MASK                      0x00000080
#define _CCP9STAT_TRIG_LENGTH                    0x00000001

#define _CCP9STATL_ICBNE_POSITION                0x00000000
#define _CCP9STATL_ICBNE_MASK                    0x00000001
#define _CCP9STATL_ICBNE_LENGTH                  0x00000001

#define _CCP9STATL_ICOV_POSITION                 0x00000001
#define _CCP9STATL_ICOV_MASK                     0x00000002
#define _CCP9STATL_ICOV_LENGTH                   0x00000001

#define _CCP9STATL_ICDIS_POSITION                0x00000002
#define _CCP9STATL_ICDIS_MASK                    0x00000004
#define _CCP9STATL_ICDIS_LENGTH                  0x00000001

#define _CCP9STATL_SCEVT_POSITION                0x00000003
#define _CCP9STATL_SCEVT_MASK                    0x00000008
#define _CCP9STATL_SCEVT_LENGTH                  0x00000001

#define _CCP9STATL_ASEVT_POSITION                0x00000004
#define _CCP9STATL_ASEVT_MASK                    0x00000010
#define _CCP9STATL_ASEVT_LENGTH                  0x00000001

#define _CCP9STATL_TRCLR_POSITION                0x00000005
#define _CCP9STATL_TRCLR_MASK                    0x00000020
#define _CCP9STATL_TRCLR_LENGTH                  0x00000001

#define _CCP9STATL_TRSET_POSITION                0x00000006
#define _CCP9STATL_TRSET_MASK                    0x00000040
#define _CCP9STATL_TRSET_LENGTH                  0x00000001

#define _CCP9STATL_CCPTRIG_POSITION              0x00000007
#define _CCP9STATL_CCPTRIG_MASK                  0x00000080
#define _CCP9STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP9STATL_ICGARM_POSITION               0x0000000A
#define _CCP9STATL_ICGARM_MASK                   0x00000400
#define _CCP9STATL_ICGARM_LENGTH                 0x00000001

#define _CCP9STATL_TRIG_POSITION                 0x00000007
#define _CCP9STATL_TRIG_MASK                     0x00000080
#define _CCP9STATL_TRIG_LENGTH                   0x00000001

#define _DMACON_PRSSEL_POSITION                  0x00000000
#define _DMACON_PRSSEL_MASK                      0x00000001
#define _DMACON_PRSSEL_LENGTH                    0x00000001

#define _DMACON_DMASIDL_POSITION                 0x0000000D
#define _DMACON_DMASIDL_MASK                     0x00002000
#define _DMACON_DMASIDL_LENGTH                   0x00000001

#define _DMACON_DMAEN_POSITION                   0x0000000F
#define _DMACON_DMAEN_MASK                       0x00008000
#define _DMACON_DMAEN_LENGTH                     0x00000001

#define _DMACH0_CHEN_POSITION                    0x00000000
#define _DMACH0_CHEN_MASK                        0x00000001
#define _DMACH0_CHEN_LENGTH                      0x00000001

#define _DMACH0_SIZE_POSITION                    0x00000001
#define _DMACH0_SIZE_MASK                        0x00000002
#define _DMACH0_SIZE_LENGTH                      0x00000001

#define _DMACH0_TRMODE_POSITION                  0x00000002
#define _DMACH0_TRMODE_MASK                      0x0000000C
#define _DMACH0_TRMODE_LENGTH                    0x00000002

#define _DMACH0_DAMODE_POSITION                  0x00000004
#define _DMACH0_DAMODE_MASK                      0x00000030
#define _DMACH0_DAMODE_LENGTH                    0x00000002

#define _DMACH0_SAMODE_POSITION                  0x00000006
#define _DMACH0_SAMODE_MASK                      0x000000C0
#define _DMACH0_SAMODE_LENGTH                    0x00000002

#define _DMACH0_CHREQ_POSITION                   0x00000008
#define _DMACH0_CHREQ_MASK                       0x00000100
#define _DMACH0_CHREQ_LENGTH                     0x00000001

#define _DMACH0_RELOAD_POSITION                  0x00000009
#define _DMACH0_RELOAD_MASK                      0x00000200
#define _DMACH0_RELOAD_LENGTH                    0x00000001

#define _DMACH0_NULLW_POSITION                   0x0000000A
#define _DMACH0_NULLW_MASK                       0x00000400
#define _DMACH0_NULLW_LENGTH                     0x00000001

#define _DMACH0_TRMODE0_POSITION                 0x00000002
#define _DMACH0_TRMODE0_MASK                     0x00000004
#define _DMACH0_TRMODE0_LENGTH                   0x00000001

#define _DMACH0_TRMODE1_POSITION                 0x00000003
#define _DMACH0_TRMODE1_MASK                     0x00000008
#define _DMACH0_TRMODE1_LENGTH                   0x00000001

#define _DMACH0_DAMODE0_POSITION                 0x00000004
#define _DMACH0_DAMODE0_MASK                     0x00000010
#define _DMACH0_DAMODE0_LENGTH                   0x00000001

#define _DMACH0_DAMODE1_POSITION                 0x00000005
#define _DMACH0_DAMODE1_MASK                     0x00000020
#define _DMACH0_DAMODE1_LENGTH                   0x00000001

