draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _ADTRIG4H_TRGSRC183_POSITION             0x00000003
#define _ADTRIG4H_TRGSRC183_MASK                 0x00000008
#define _ADTRIG4H_TRGSRC183_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC184_POSITION             0x00000004
#define _ADTRIG4H_TRGSRC184_MASK                 0x00000010
#define _ADTRIG4H_TRGSRC184_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC24_POSITION              0x00000000
#define _ADTRIG6L_TRGSRC24_MASK                  0x0000001F
#define _ADTRIG6L_TRGSRC24_LENGTH                0x00000005

#define _ADTRIG6L_TRGSRC25_POSITION              0x00000008
#define _ADTRIG6L_TRGSRC25_MASK                  0x00001F00
#define _ADTRIG6L_TRGSRC25_LENGTH                0x00000005

#define _ADTRIG6L_TRIGSRC240_POSITION            0x00000000
#define _ADTRIG6L_TRIGSRC240_MASK                0x00000001
#define _ADTRIG6L_TRIGSRC240_LENGTH              0x00000001

#define _ADTRIG6L_TRIGSRC241_POSITION            0x00000001
#define _ADTRIG6L_TRIGSRC241_MASK                0x00000002
#define _ADTRIG6L_TRIGSRC241_LENGTH              0x00000001

#define _ADTRIG6L_TRIGSRC242_POSITION            0x00000002
#define _ADTRIG6L_TRIGSRC242_MASK                0x00000004
#define _ADTRIG6L_TRIGSRC242_LENGTH              0x00000001

#define _ADTRIG6L_TRIGSRC243_POSITION            0x00000003
#define _ADTRIG6L_TRIGSRC243_MASK                0x00000008
#define _ADTRIG6L_TRIGSRC243_LENGTH              0x00000001

#define _ADTRIG6L_TRIGSRC244_POSITION            0x00000004
#define _ADTRIG6L_TRIGSRC244_MASK                0x00000010
#define _ADTRIG6L_TRIGSRC244_LENGTH              0x00000001

#define _ADTRIG6L_TRGSRC250_POSITION             0x00000008
#define _ADTRIG6L_TRGSRC250_MASK                 0x00000100
#define _ADTRIG6L_TRGSRC250_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC251_POSITION             0x00000009
#define _ADTRIG6L_TRGSRC251_MASK                 0x00000200
#define _ADTRIG6L_TRGSRC251_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC252_POSITION             0x0000000A
#define _ADTRIG6L_TRGSRC252_MASK                 0x00000400
#define _ADTRIG6L_TRGSRC252_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC253_POSITION             0x0000000B
#define _ADTRIG6L_TRGSRC253_MASK                 0x00000800
#define _ADTRIG6L_TRGSRC253_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC254_POSITION             0x0000000C
#define _ADTRIG6L_TRGSRC254_MASK                 0x00001000
#define _ADTRIG6L_TRGSRC254_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC240_POSITION             0x00000000
#define _ADTRIG6L_TRGSRC240_MASK                 0x00000001
#define _ADTRIG6L_TRGSRC240_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC241_POSITION             0x00000001
#define _ADTRIG6L_TRGSRC241_MASK                 0x00000002
#define _ADTRIG6L_TRGSRC241_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC242_POSITION             0x00000002
#define _ADTRIG6L_TRGSRC242_MASK                 0x00000004
#define _ADTRIG6L_TRGSRC242_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC243_POSITION             0x00000003
#define _ADTRIG6L_TRGSRC243_MASK                 0x00000008
#define _ADTRIG6L_TRGSRC243_LENGTH               0x00000001

#define _ADTRIG6L_TRGSRC244_POSITION             0x00000004
#define _ADTRIG6L_TRGSRC244_MASK                 0x00000010
#define _ADTRIG6L_TRGSRC244_LENGTH               0x00000001

#define _ADCMP0CON_LOLO_POSITION                 0x00000000
#define _ADCMP0CON_LOLO_MASK                     0x00000001
#define _ADCMP0CON_LOLO_LENGTH                   0x00000001

#define _ADCMP0CON_LOHI_POSITION                 0x00000001
#define _ADCMP0CON_LOHI_MASK                     0x00000002
#define _ADCMP0CON_LOHI_LENGTH                   0x00000001

#define _ADCMP0CON_HILO_POSITION                 0x00000002
#define _ADCMP0CON_HILO_MASK                     0x00000004
#define _ADCMP0CON_HILO_LENGTH                   0x00000001

#define _ADCMP0CON_HIHI_POSITION                 0x00000003
#define _ADCMP0CON_HIHI_MASK                     0x00000008
#define _ADCMP0CON_HIHI_LENGTH                   0x00000001

#define _ADCMP0CON_BTWN_POSITION                 0x00000004
#define _ADCMP0CON_BTWN_MASK                     0x00000010
#define _ADCMP0CON_BTWN_LENGTH                   0x00000001

#define _ADCMP0CON_STAT_POSITION                 0x00000005
#define _ADCMP0CON_STAT_MASK                     0x00000020
#define _ADCMP0CON_STAT_LENGTH                   0x00000001

#define _ADCMP0CON_IE_POSITION                   0x00000006
#define _ADCMP0CON_IE_MASK                       0x00000040
#define _ADCMP0CON_IE_LENGTH                     0x00000001

#define _ADCMP0CON_CMPEN_POSITION                0x00000007
#define _ADCMP0CON_CMPEN_MASK                    0x00000080
#define _ADCMP0CON_CMPEN_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL_POSITION                 0x00000008
#define _ADCMP0CON_CHNL_MASK                     0x00001F00
#define _ADCMP0CON_CHNL_LENGTH                   0x00000005

#define _ADCMP0CON_CHNL0_POSITION                0x00000008
#define _ADCMP0CON_CHNL0_MASK                    0x00000100
#define _ADCMP0CON_CHNL0_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL1_POSITION                0x00000009
#define _ADCMP0CON_CHNL1_MASK                    0x00000200
#define _ADCMP0CON_CHNL1_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL2_POSITION                0x0000000A
#define _ADCMP0CON_CHNL2_MASK                    0x00000400
#define _ADCMP0CON_CHNL2_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL3_POSITION                0x0000000B
#define _ADCMP0CON_CHNL3_MASK                    0x00000800
#define _ADCMP0CON_CHNL3_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL4_POSITION                0x0000000C
#define _ADCMP0CON_CHNL4_MASK                    0x00001000
#define _ADCMP0CON_CHNL4_LENGTH                  0x00000001

#define _ADCMP1CON_LOLO_POSITION                 0x00000000
#define _ADCMP1CON_LOLO_MASK                     0x00000001
#define _ADCMP1CON_LOLO_LENGTH                   0x00000001

#define _ADCMP1CON_LOHI_POSITION                 0x00000001
#define _ADCMP1CON_LOHI_MASK                     0x00000002
#define _ADCMP1CON_LOHI_LENGTH                   0x00000001

