draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _ADCMP3CON_CHNL_POSITION                 0x00000008
#define _ADCMP3CON_CHNL_MASK                     0x00001F00
#define _ADCMP3CON_CHNL_LENGTH                   0x00000005

#define _ADCMP3CON_CHNL0_POSITION                0x00000008
#define _ADCMP3CON_CHNL0_MASK                    0x00000100
#define _ADCMP3CON_CHNL0_LENGTH                  0x00000001

#define _ADCMP3CON_CHNL1_POSITION                0x00000009
#define _ADCMP3CON_CHNL1_MASK                    0x00000200
#define _ADCMP3CON_CHNL1_LENGTH                  0x00000001

#define _ADCMP3CON_CHNL2_POSITION                0x0000000A
#define _ADCMP3CON_CHNL2_MASK                    0x00000400
#define _ADCMP3CON_CHNL2_LENGTH                  0x00000001

#define _ADCMP3CON_CHNL3_POSITION                0x0000000B
#define _ADCMP3CON_CHNL3_MASK                    0x00000800
#define _ADCMP3CON_CHNL3_LENGTH                  0x00000001

#define _ADCMP3CON_CHNL4_POSITION                0x0000000C
#define _ADCMP3CON_CHNL4_MASK                    0x00001000
#define _ADCMP3CON_CHNL4_LENGTH                  0x00000001

#define _ADLVLTRGL_LVLEN0_POSITION               0x00000000
#define _ADLVLTRGL_LVLEN0_MASK                   0x00000001
#define _ADLVLTRGL_LVLEN0_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN1_POSITION               0x00000001
#define _ADLVLTRGL_LVLEN1_MASK                   0x00000002
#define _ADLVLTRGL_LVLEN1_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN2_POSITION               0x00000002
#define _ADLVLTRGL_LVLEN2_MASK                   0x00000004
#define _ADLVLTRGL_LVLEN2_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN3_POSITION               0x00000003
#define _ADLVLTRGL_LVLEN3_MASK                   0x00000008
#define _ADLVLTRGL_LVLEN3_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN4_POSITION               0x00000004
#define _ADLVLTRGL_LVLEN4_MASK                   0x00000010
#define _ADLVLTRGL_LVLEN4_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN5_POSITION               0x00000005
#define _ADLVLTRGL_LVLEN5_MASK                   0x00000020
#define _ADLVLTRGL_LVLEN5_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN6_POSITION               0x00000006
#define _ADLVLTRGL_LVLEN6_MASK                   0x00000040
#define _ADLVLTRGL_LVLEN6_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN7_POSITION               0x00000007
#define _ADLVLTRGL_LVLEN7_MASK                   0x00000080
#define _ADLVLTRGL_LVLEN7_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN8_POSITION               0x00000008
#define _ADLVLTRGL_LVLEN8_MASK                   0x00000100
#define _ADLVLTRGL_LVLEN8_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN9_POSITION               0x00000009
#define _ADLVLTRGL_LVLEN9_MASK                   0x00000200
#define _ADLVLTRGL_LVLEN9_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN10_POSITION              0x0000000A
#define _ADLVLTRGL_LVLEN10_MASK                  0x00000400
#define _ADLVLTRGL_LVLEN10_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN11_POSITION              0x0000000B
#define _ADLVLTRGL_LVLEN11_MASK                  0x00000800
#define _ADLVLTRGL_LVLEN11_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN12_POSITION              0x0000000C
#define _ADLVLTRGL_LVLEN12_MASK                  0x00001000
#define _ADLVLTRGL_LVLEN12_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN13_POSITION              0x0000000D
#define _ADLVLTRGL_LVLEN13_MASK                  0x00002000
#define _ADLVLTRGL_LVLEN13_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN14_POSITION              0x0000000E
#define _ADLVLTRGL_LVLEN14_MASK                  0x00004000
#define _ADLVLTRGL_LVLEN14_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN15_POSITION              0x0000000F
#define _ADLVLTRGL_LVLEN15_MASK                  0x00008000
#define _ADLVLTRGL_LVLEN15_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN16_POSITION              0x00000000
#define _ADLVLTRGH_LVLEN16_MASK                  0x00000001
#define _ADLVLTRGH_LVLEN16_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN17_POSITION              0x00000001
#define _ADLVLTRGH_LVLEN17_MASK                  0x00000002
#define _ADLVLTRGH_LVLEN17_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN18_POSITION              0x00000002
#define _ADLVLTRGH_LVLEN18_MASK                  0x00000004
#define _ADLVLTRGH_LVLEN18_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN19_POSITION              0x00000003
#define _ADLVLTRGH_LVLEN19_MASK                  0x00000008
#define _ADLVLTRGH_LVLEN19_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN24_POSITION              0x00000008
#define _ADLVLTRGH_LVLEN24_MASK                  0x00000100
#define _ADLVLTRGH_LVLEN24_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN25_POSITION              0x00000009
#define _ADLVLTRGH_LVLEN25_MASK                  0x00000200
#define _ADLVLTRGH_LVLEN25_LENGTH                0x00000001

#define _ADCORE0L_SAMC_POSITION                  0x00000000
#define _ADCORE0L_SAMC_MASK                      0x000003FF
#define _ADCORE0L_SAMC_LENGTH                    0x0000000A

#define _ADCORE0L_SAMC0_POSITION                 0x00000000
#define _ADCORE0L_SAMC0_MASK                     0x00000001
#define _ADCORE0L_SAMC0_LENGTH                   0x00000001

#define _ADCORE0L_SAMC1_POSITION                 0x00000001
#define _ADCORE0L_SAMC1_MASK                     0x00000002
#define _ADCORE0L_SAMC1_LENGTH                   0x00000001

#define _ADCORE0L_SAMC2_POSITION                 0x00000002
#define _ADCORE0L_SAMC2_MASK                     0x00000004
#define _ADCORE0L_SAMC2_LENGTH                   0x00000001

#define _ADCORE0L_SAMC3_POSITION                 0x00000003
#define _ADCORE0L_SAMC3_MASK                     0x00000008
#define _ADCORE0L_SAMC3_LENGTH                   0x00000001

#define _ADCORE0L_SAMC4_POSITION                 0x00000004
#define _ADCORE0L_SAMC4_MASK                     0x00000010
#define _ADCORE0L_SAMC4_LENGTH                   0x00000001

#define _ADCORE0L_SAMC5_POSITION                 0x00000005
#define _ADCORE0L_SAMC5_MASK                     0x00000020
#define _ADCORE0L_SAMC5_LENGTH                   0x00000001

#define _ADCORE0L_SAMC6_POSITION                 0x00000006
#define _ADCORE0L_SAMC6_MASK                     0x00000040
#define _ADCORE0L_SAMC6_LENGTH                   0x00000001

#define _ADCORE0L_SAMC7_POSITION                 0x00000007
#define _ADCORE0L_SAMC7_MASK                     0x00000080
#define _ADCORE0L_SAMC7_LENGTH                   0x00000001

#define _ADCORE0L_SAMC8_POSITION                 0x00000008
#define _ADCORE0L_SAMC8_MASK                     0x00000100
#define _ADCORE0L_SAMC8_LENGTH                   0x00000001

#define _ADCORE0L_SAMC9_POSITION                 0x00000009
#define _ADCORE0L_SAMC9_MASK                     0x00000200
#define _ADCORE0L_SAMC9_LENGTH                   0x00000001

