draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _ADEISTATH_EISTAT16_POSITION             0x00000000
#define _ADEISTATH_EISTAT16_MASK                 0x00000001
#define _ADEISTATH_EISTAT16_LENGTH               0x00000001

#define _ADEISTATH_EISTAT17_POSITION             0x00000001
#define _ADEISTATH_EISTAT17_MASK                 0x00000002
#define _ADEISTATH_EISTAT17_LENGTH               0x00000001

#define _ADEISTATH_EISTAT18_POSITION             0x00000002
#define _ADEISTATH_EISTAT18_MASK                 0x00000004
#define _ADEISTATH_EISTAT18_LENGTH               0x00000001

#define _ADEISTATH_EISTAT19_POSITION             0x00000003
#define _ADEISTATH_EISTAT19_MASK                 0x00000008
#define _ADEISTATH_EISTAT19_LENGTH               0x00000001

#define _ADEISTATH_EISTAT24_POSITION             0x00000008
#define _ADEISTATH_EISTAT24_MASK                 0x00000100
#define _ADEISTATH_EISTAT24_LENGTH               0x00000001

#define _ADEISTATH_EISTAT25_POSITION             0x00000009
#define _ADEISTATH_EISTAT25_MASK                 0x00000200
#define _ADEISTATH_EISTAT25_LENGTH               0x00000001

#define _ADCON5L_C0PWR_POSITION                  0x00000000
#define _ADCON5L_C0PWR_MASK                      0x00000001
#define _ADCON5L_C0PWR_LENGTH                    0x00000001

#define _ADCON5L_C1PWR_POSITION                  0x00000001
#define _ADCON5L_C1PWR_MASK                      0x00000002
#define _ADCON5L_C1PWR_LENGTH                    0x00000001

#define _ADCON5L_SHRPWR_POSITION                 0x00000007
#define _ADCON5L_SHRPWR_MASK                     0x00000080
#define _ADCON5L_SHRPWR_LENGTH                   0x00000001

#define _ADCON5L_C0RDY_POSITION                  0x00000008
#define _ADCON5L_C0RDY_MASK                      0x00000100
#define _ADCON5L_C0RDY_LENGTH                    0x00000001

#define _ADCON5L_C1RDY_POSITION                  0x00000009
#define _ADCON5L_C1RDY_MASK                      0x00000200
#define _ADCON5L_C1RDY_LENGTH                    0x00000001

#define _ADCON5L_SHRRDY_POSITION                 0x0000000F
#define _ADCON5L_SHRRDY_MASK                     0x00008000
#define _ADCON5L_SHRRDY_LENGTH                   0x00000001

#define _ADCON5H_C0CIE_POSITION                  0x00000000
#define _ADCON5H_C0CIE_MASK                      0x00000001
#define _ADCON5H_C0CIE_LENGTH                    0x00000001

#define _ADCON5H_C1CIE_POSITION                  0x00000001
#define _ADCON5H_C1CIE_MASK                      0x00000002
#define _ADCON5H_C1CIE_LENGTH                    0x00000001

#define _ADCON5H_SHRCIE_POSITION                 0x00000007
#define _ADCON5H_SHRCIE_MASK                     0x00000080
#define _ADCON5H_SHRCIE_LENGTH                   0x00000001

#define _ADCON5H_WARMTIME_POSITION               0x00000008
#define _ADCON5H_WARMTIME_MASK                   0x00000F00
#define _ADCON5H_WARMTIME_LENGTH                 0x00000004

#define _ADCON5H_C0C1E_POSITION                  0x00000000
#define _ADCON5H_C0C1E_MASK                      0x00000001
#define _ADCON5H_C0C1E_LENGTH                    0x00000001

#define _ADCON5H_C1C1E_POSITION                  0x00000001
#define _ADCON5H_C1C1E_MASK                      0x00000002
#define _ADCON5H_C1C1E_LENGTH                    0x00000001

#define _DACCTRL1L_FCLKDIV_POSITION              0x00000000
#define _DACCTRL1L_FCLKDIV_MASK                  0x00000007
#define _DACCTRL1L_FCLKDIV_LENGTH                0x00000003

#define _DACCTRL1L_CLKDIV_POSITION               0x00000004
#define _DACCTRL1L_CLKDIV_MASK                   0x00000030
#define _DACCTRL1L_CLKDIV_LENGTH                 0x00000002

#define _DACCTRL1L_CLKSEL_POSITION               0x00000006
#define _DACCTRL1L_CLKSEL_MASK                   0x000000C0
#define _DACCTRL1L_CLKSEL_LENGTH                 0x00000002

#define _DACCTRL1L_DACSIDL_POSITION              0x0000000D
#define _DACCTRL1L_DACSIDL_MASK                  0x00002000
#define _DACCTRL1L_DACSIDL_LENGTH                0x00000001

#define _DACCTRL1L_DACON_POSITION                0x0000000F
#define _DACCTRL1L_DACON_MASK                    0x00008000
#define _DACCTRL1L_DACON_LENGTH                  0x00000001

#define _DACCTRL1L_FCLKDIV0_POSITION             0x00000000
#define _DACCTRL1L_FCLKDIV0_MASK                 0x00000001
#define _DACCTRL1L_FCLKDIV0_LENGTH               0x00000001

#define _DACCTRL1L_FCLKDIV1_POSITION             0x00000001
#define _DACCTRL1L_FCLKDIV1_MASK                 0x00000002
#define _DACCTRL1L_FCLKDIV1_LENGTH               0x00000001

#define _DACCTRL1L_FCLKDIV2_POSITION             0x00000002
#define _DACCTRL1L_FCLKDIV2_MASK                 0x00000004
#define _DACCTRL1L_FCLKDIV2_LENGTH               0x00000001

#define _DACCTRL1L_CLKDIV0_POSITION              0x00000004
#define _DACCTRL1L_CLKDIV0_MASK                  0x00000010
#define _DACCTRL1L_CLKDIV0_LENGTH                0x00000001

#define _DACCTRL1L_CLKDIV1_POSITION              0x00000005
#define _DACCTRL1L_CLKDIV1_MASK                  0x00000020
#define _DACCTRL1L_CLKDIV1_LENGTH                0x00000001

#define _DACCTRL1L_CLKSEL0_POSITION              0x00000006
#define _DACCTRL1L_CLKSEL0_MASK                  0x00000040
#define _DACCTRL1L_CLKSEL0_LENGTH                0x00000001

#define _DACCTRL1L_CLKSEL1_POSITION              0x00000007
#define _DACCTRL1L_CLKSEL1_MASK                  0x00000080
#define _DACCTRL1L_CLKSEL1_LENGTH                0x00000001

#define _DACCTRL2L_TMODTIME_POSITION             0x00000000
#define _DACCTRL2L_TMODTIME_MASK                 0x000003FF
#define _DACCTRL2L_TMODTIME_LENGTH               0x0000000A

#define _DACCTRL2L_TMODTIME0_POSITION            0x00000000
#define _DACCTRL2L_TMODTIME0_MASK                0x00000001
#define _DACCTRL2L_TMODTIME0_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME1_POSITION            0x00000001
#define _DACCTRL2L_TMODTIME1_MASK                0x00000002
#define _DACCTRL2L_TMODTIME1_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME2_POSITION            0x00000002
#define _DACCTRL2L_TMODTIME2_MASK                0x00000004
#define _DACCTRL2L_TMODTIME2_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME3_POSITION            0x00000003
#define _DACCTRL2L_TMODTIME3_MASK                0x00000008
#define _DACCTRL2L_TMODTIME3_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME4_POSITION            0x00000004
#define _DACCTRL2L_TMODTIME4_MASK                0x00000010
#define _DACCTRL2L_TMODTIME4_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME5_POSITION            0x00000005
#define _DACCTRL2L_TMODTIME5_MASK                0x00000020
#define _DACCTRL2L_TMODTIME5_LENGTH              0x00000001

