draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _DACCTRL2L_TMODTIME6_POSITION            0x00000006
#define _DACCTRL2L_TMODTIME6_MASK                0x00000040
#define _DACCTRL2L_TMODTIME6_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME7_POSITION            0x00000007
#define _DACCTRL2L_TMODTIME7_MASK                0x00000080
#define _DACCTRL2L_TMODTIME7_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME8_POSITION            0x00000008
#define _DACCTRL2L_TMODTIME8_MASK                0x00000100
#define _DACCTRL2L_TMODTIME8_LENGTH              0x00000001

#define _DACCTRL2L_TMODTIME9_POSITION            0x00000009
#define _DACCTRL2L_TMODTIME9_MASK                0x00000200
#define _DACCTRL2L_TMODTIME9_LENGTH              0x00000001

#define _DACCTRL2H_SSTIME_POSITION               0x00000000
#define _DACCTRL2H_SSTIME_MASK                   0x000003FF
#define _DACCTRL2H_SSTIME_LENGTH                 0x0000000A

#define _DACCTRL2H_SSTIME0_POSITION              0x00000000
#define _DACCTRL2H_SSTIME0_MASK                  0x00000001
#define _DACCTRL2H_SSTIME0_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME1_POSITION              0x00000001
#define _DACCTRL2H_SSTIME1_MASK                  0x00000002
#define _DACCTRL2H_SSTIME1_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME2_POSITION              0x00000002
#define _DACCTRL2H_SSTIME2_MASK                  0x00000004
#define _DACCTRL2H_SSTIME2_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME3_POSITION              0x00000003
#define _DACCTRL2H_SSTIME3_MASK                  0x00000008
#define _DACCTRL2H_SSTIME3_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME4_POSITION              0x00000004
#define _DACCTRL2H_SSTIME4_MASK                  0x00000010
#define _DACCTRL2H_SSTIME4_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME5_POSITION              0x00000005
#define _DACCTRL2H_SSTIME5_MASK                  0x00000020
#define _DACCTRL2H_SSTIME5_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME6_POSITION              0x00000006
#define _DACCTRL2H_SSTIME6_MASK                  0x00000040
#define _DACCTRL2H_SSTIME6_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME7_POSITION              0x00000007
#define _DACCTRL2H_SSTIME7_MASK                  0x00000080
#define _DACCTRL2H_SSTIME7_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME8_POSITION              0x00000008
#define _DACCTRL2H_SSTIME8_MASK                  0x00000100
#define _DACCTRL2H_SSTIME8_LENGTH                0x00000001

#define _DACCTRL2H_SSTIME9_POSITION              0x00000009
#define _DACCTRL2H_SSTIME9_MASK                  0x00000200
#define _DACCTRL2H_SSTIME9_LENGTH                0x00000001

#define _DAC1CONL_HYSSEL_POSITION                0x00000000
#define _DAC1CONL_HYSSEL_MASK                    0x00000003
#define _DAC1CONL_HYSSEL_LENGTH                  0x00000002

#define _DAC1CONL_HYSPOL_POSITION                0x00000002
#define _DAC1CONL_HYSPOL_MASK                    0x00000004
#define _DAC1CONL_HYSPOL_LENGTH                  0x00000001

#define _DAC1CONL_INSEL_POSITION                 0x00000003
#define _DAC1CONL_INSEL_MASK                     0x00000038
#define _DAC1CONL_INSEL_LENGTH                   0x00000003

#define _DAC1CONL_CMPPOL_POSITION                0x00000006
#define _DAC1CONL_CMPPOL_MASK                    0x00000040
#define _DAC1CONL_CMPPOL_LENGTH                  0x00000001

#define _DAC1CONL_CMPSTAT_POSITION               0x00000007
#define _DAC1CONL_CMPSTAT_MASK                   0x00000080
#define _DAC1CONL_CMPSTAT_LENGTH                 0x00000001

#define _DAC1CONL_FLTREN_POSITION                0x00000008
#define _DAC1CONL_FLTREN_MASK                    0x00000100
#define _DAC1CONL_FLTREN_LENGTH                  0x00000001

#define _DAC1CONL_DACOEN_POSITION                0x00000009
#define _DAC1CONL_DACOEN_MASK                    0x00000200
#define _DAC1CONL_DACOEN_LENGTH                  0x00000001

#define _DAC1CONL_CBE_POSITION                   0x0000000A
#define _DAC1CONL_CBE_MASK                       0x00000400
#define _DAC1CONL_CBE_LENGTH                     0x00000001

#define _DAC1CONL_IRQM_POSITION                  0x0000000D
#define _DAC1CONL_IRQM_MASK                      0x00006000
#define _DAC1CONL_IRQM_LENGTH                    0x00000002

#define _DAC1CONL_DACEN_POSITION                 0x0000000F
#define _DAC1CONL_DACEN_MASK                     0x00008000
#define _DAC1CONL_DACEN_LENGTH                   0x00000001

#define _DAC1CONL_HYSSEL0_POSITION               0x00000000
#define _DAC1CONL_HYSSEL0_MASK                   0x00000001
#define _DAC1CONL_HYSSEL0_LENGTH                 0x00000001

#define _DAC1CONL_HYSSEL1_POSITION               0x00000001
#define _DAC1CONL_HYSSEL1_MASK                   0x00000002
#define _DAC1CONL_HYSSEL1_LENGTH                 0x00000001

#define _DAC1CONL_IRQM0_POSITION                 0x0000000D
#define _DAC1CONL_IRQM0_MASK                     0x00002000
#define _DAC1CONL_IRQM0_LENGTH                   0x00000001

#define _DAC1CONL_IRQM1_POSITION                 0x0000000E
#define _DAC1CONL_IRQM1_MASK                     0x00004000
#define _DAC1CONL_IRQM1_LENGTH                   0x00000001

#define _DAC1CONH_TMCB_POSITION                  0x00000000
#define _DAC1CONH_TMCB_MASK                      0x000003FF
#define _DAC1CONH_TMCB_LENGTH                    0x0000000A

#define _DAC1CONH_TMCB0_POSITION                 0x00000000
#define _DAC1CONH_TMCB0_MASK                     0x00000001
#define _DAC1CONH_TMCB0_LENGTH                   0x00000001

#define _DAC1CONH_TMCB1_POSITION                 0x00000001
#define _DAC1CONH_TMCB1_MASK                     0x00000002
#define _DAC1CONH_TMCB1_LENGTH                   0x00000001

#define _DAC1CONH_TMCB2_POSITION                 0x00000002
#define _DAC1CONH_TMCB2_MASK                     0x00000004
#define _DAC1CONH_TMCB2_LENGTH                   0x00000001

#define _DAC1CONH_TMCB3_POSITION                 0x00000003
#define _DAC1CONH_TMCB3_MASK                     0x00000008
#define _DAC1CONH_TMCB3_LENGTH                   0x00000001

#define _DAC1CONH_TMCB4_POSITION                 0x00000004
#define _DAC1CONH_TMCB4_MASK                     0x00000010
#define _DAC1CONH_TMCB4_LENGTH                   0x00000001

