draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _DAC1CONH_TMCB5_POSITION                 0x00000005
#define _DAC1CONH_TMCB5_MASK                     0x00000020
#define _DAC1CONH_TMCB5_LENGTH                   0x00000001

#define _DAC1CONH_TMCB6_POSITION                 0x00000006
#define _DAC1CONH_TMCB6_MASK                     0x00000040
#define _DAC1CONH_TMCB6_LENGTH                   0x00000001

#define _DAC1CONH_TMCB7_POSITION                 0x00000007
#define _DAC1CONH_TMCB7_MASK                     0x00000080
#define _DAC1CONH_TMCB7_LENGTH                   0x00000001

#define _DAC1CONH_TMCB8_POSITION                 0x00000008
#define _DAC1CONH_TMCB8_MASK                     0x00000100
#define _DAC1CONH_TMCB8_LENGTH                   0x00000001

#define _DAC1CONH_TMCB9_POSITION                 0x00000009
#define _DAC1CONH_TMCB9_MASK                     0x00000200
#define _DAC1CONH_TMCB9_LENGTH                   0x00000001

#define _DAC1DATL_DACLOW_POSITION                0x00000000
#define _DAC1DATL_DACLOW_MASK                    0x00000FFF
#define _DAC1DATL_DACLOW_LENGTH                  0x0000000C

#define _DAC1DATL_DACDATL_POSITION               0x00000000
#define _DAC1DATL_DACDATL_MASK                   0x00000FFF
#define _DAC1DATL_DACDATL_LENGTH                 0x0000000C

#define _DAC1DATL_DACDATL0_POSITION              0x00000000
#define _DAC1DATL_DACDATL0_MASK                  0x00000001
#define _DAC1DATL_DACDATL0_LENGTH                0x00000001

#define _DAC1DATL_DACDATL1_POSITION              0x00000001
#define _DAC1DATL_DACDATL1_MASK                  0x00000002
#define _DAC1DATL_DACDATL1_LENGTH                0x00000001

#define _DAC1DATL_DACDATL2_POSITION              0x00000002
#define _DAC1DATL_DACDATL2_MASK                  0x00000004
#define _DAC1DATL_DACDATL2_LENGTH                0x00000001

#define _DAC1DATL_DACDATL3_POSITION              0x00000003
#define _DAC1DATL_DACDATL3_MASK                  0x00000008
#define _DAC1DATL_DACDATL3_LENGTH                0x00000001

#define _DAC1DATL_DACDATL4_POSITION              0x00000004
#define _DAC1DATL_DACDATL4_MASK                  0x00000010
#define _DAC1DATL_DACDATL4_LENGTH                0x00000001

#define _DAC1DATL_DACDATL5_POSITION              0x00000005
#define _DAC1DATL_DACDATL5_MASK                  0x00000020
#define _DAC1DATL_DACDATL5_LENGTH                0x00000001

#define _DAC1DATL_DACDATL6_POSITION              0x00000006
#define _DAC1DATL_DACDATL6_MASK                  0x00000040
#define _DAC1DATL_DACDATL6_LENGTH                0x00000001

#define _DAC1DATL_DACDATL7_POSITION              0x00000007
#define _DAC1DATL_DACDATL7_MASK                  0x00000080
#define _DAC1DATL_DACDATL7_LENGTH                0x00000001

#define _DAC1DATL_DACDATL8_POSITION              0x00000008
#define _DAC1DATL_DACDATL8_MASK                  0x00000100
#define _DAC1DATL_DACDATL8_LENGTH                0x00000001

#define _DAC1DATL_DACDATL9_POSITION              0x00000009
#define _DAC1DATL_DACDATL9_MASK                  0x00000200
#define _DAC1DATL_DACDATL9_LENGTH                0x00000001

#define _DAC1DATL_DACDATL10_POSITION             0x0000000A
#define _DAC1DATL_DACDATL10_MASK                 0x00000400
#define _DAC1DATL_DACDATL10_LENGTH               0x00000001

#define _DAC1DATL_DACDATL11_POSITION             0x0000000B
#define _DAC1DATL_DACDATL11_MASK                 0x00000800
#define _DAC1DATL_DACDATL11_LENGTH               0x00000001

#define _DAC1DATH_DACDAT_POSITION                0x00000000
#define _DAC1DATH_DACDAT_MASK                    0x00000FFF
#define _DAC1DATH_DACDAT_LENGTH                  0x0000000C

#define _DAC1DATH_DACDATH_POSITION               0x00000000
#define _DAC1DATH_DACDATH_MASK                   0x00000FFF
#define _DAC1DATH_DACDATH_LENGTH                 0x0000000C

#define _DAC1DATH_DACDATH0_POSITION              0x00000000
#define _DAC1DATH_DACDATH0_MASK                  0x00000001
#define _DAC1DATH_DACDATH0_LENGTH                0x00000001

#define _DAC1DATH_DACDATH1_POSITION              0x00000001
#define _DAC1DATH_DACDATH1_MASK                  0x00000002
#define _DAC1DATH_DACDATH1_LENGTH                0x00000001

#define _DAC1DATH_DACDATH2_POSITION              0x00000002
#define _DAC1DATH_DACDATH2_MASK                  0x00000004
#define _DAC1DATH_DACDATH2_LENGTH                0x00000001

#define _DAC1DATH_DACDATH3_POSITION              0x00000003
#define _DAC1DATH_DACDATH3_MASK                  0x00000008
#define _DAC1DATH_DACDATH3_LENGTH                0x00000001

#define _DAC1DATH_DACDATH4_POSITION              0x00000004
#define _DAC1DATH_DACDATH4_MASK                  0x00000010
#define _DAC1DATH_DACDATH4_LENGTH                0x00000001

#define _DAC1DATH_DACDATH5_POSITION              0x00000005
#define _DAC1DATH_DACDATH5_MASK                  0x00000020
#define _DAC1DATH_DACDATH5_LENGTH                0x00000001

#define _DAC1DATH_DACDATH6_POSITION              0x00000006
#define _DAC1DATH_DACDATH6_MASK                  0x00000040
#define _DAC1DATH_DACDATH6_LENGTH                0x00000001

#define _DAC1DATH_DACDATH7_POSITION              0x00000007
#define _DAC1DATH_DACDATH7_MASK                  0x00000080
#define _DAC1DATH_DACDATH7_LENGTH                0x00000001

#define _DAC1DATH_DACDATH8_POSITION              0x00000008
#define _DAC1DATH_DACDATH8_MASK                  0x00000100
#define _DAC1DATH_DACDATH8_LENGTH                0x00000001

#define _DAC1DATH_DACDATH9_POSITION              0x00000009
#define _DAC1DATH_DACDATH9_MASK                  0x00000200
#define _DAC1DATH_DACDATH9_LENGTH                0x00000001

#define _DAC1DATH_DACDATH10_POSITION             0x0000000A
#define _DAC1DATH_DACDATH10_MASK                 0x00000400
#define _DAC1DATH_DACDATH10_LENGTH               0x00000001

#define _DAC1DATH_DACDATH11_POSITION             0x0000000B
#define _DAC1DATH_DACDATH11_MASK                 0x00000800
#define _DAC1DATH_DACDATH11_LENGTH               0x00000001

#define _SLP1CONL_SLPSTRT_POSITION               0x00000000
#define _SLP1CONL_SLPSTRT_MASK                   0x0000000F
#define _SLP1CONL_SLPSTRT_LENGTH                 0x00000004

