draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _RPINR46_CLCINCR_POSITION                0x00000008
#define _RPINR46_CLCINCR_MASK                    0x0000FF00
#define _RPINR46_CLCINCR_LENGTH                  0x00000008

#define _RPINR47_CLCINDR_POSITION                0x00000000
#define _RPINR47_CLCINDR_MASK                    0x000000FF
#define _RPINR47_CLCINDR_LENGTH                  0x00000008

#define _RPINR47_ADCTRGR_POSITION                0x00000008
#define _RPINR47_ADCTRGR_MASK                    0x0000FF00
#define _RPINR47_ADCTRGR_LENGTH                  0x00000008

#define _RPINR48_OCFDR_POSITION                  0x00000000
#define _RPINR48_OCFDR_MASK                      0x000000FF
#define _RPINR48_OCFDR_LENGTH                    0x00000008

#define _RPINR48_U1CTSR_POSITION                 0x00000008
#define _RPINR48_U1CTSR_MASK                     0x0000FF00
#define _RPINR48_U1CTSR_LENGTH                   0x00000008

#define _RPINR49_U2CTSR_POSITION                 0x00000000
#define _RPINR49_U2CTSR_MASK                     0x000000FF
#define _RPINR49_U2CTSR_LENGTH                   0x00000008

#define _RPINR49_U3CTSR_POSITION                 0x00000008
#define _RPINR49_U3CTSR_MASK                     0x0000FF00
#define _RPINR49_U3CTSR_LENGTH                   0x00000008

#define _RPOR0_RP32R_POSITION                    0x00000000
#define _RPOR0_RP32R_MASK                        0x0000003F
#define _RPOR0_RP32R_LENGTH                      0x00000006

#define _RPOR0_RP33R_POSITION                    0x00000008
#define _RPOR0_RP33R_MASK                        0x00003F00
#define _RPOR0_RP33R_LENGTH                      0x00000006

#define _RPOR1_RP34R_POSITION                    0x00000000
#define _RPOR1_RP34R_MASK                        0x0000003F
#define _RPOR1_RP34R_LENGTH                      0x00000006

#define _RPOR1_RP35R_POSITION                    0x00000008
#define _RPOR1_RP35R_MASK                        0x00003F00
#define _RPOR1_RP35R_LENGTH                      0x00000006

#define _RPOR2_RP36R_POSITION                    0x00000000
#define _RPOR2_RP36R_MASK                        0x0000003F
#define _RPOR2_RP36R_LENGTH                      0x00000006

#define _RPOR2_RP37R_POSITION                    0x00000008
#define _RPOR2_RP37R_MASK                        0x00003F00
#define _RPOR2_RP37R_LENGTH                      0x00000006

#define _RPOR3_RP38R_POSITION                    0x00000000
#define _RPOR3_RP38R_MASK                        0x0000003F
#define _RPOR3_RP38R_LENGTH                      0x00000006

#define _RPOR3_RP39R_POSITION                    0x00000008
#define _RPOR3_RP39R_MASK                        0x00003F00
#define _RPOR3_RP39R_LENGTH                      0x00000006

#define _RPOR4_RP40R_POSITION                    0x00000000
#define _RPOR4_RP40R_MASK                        0x0000003F
#define _RPOR4_RP40R_LENGTH                      0x00000006

#define _RPOR4_RP41R_POSITION                    0x00000008
#define _RPOR4_RP41R_MASK                        0x00003F00
#define _RPOR4_RP41R_LENGTH                      0x00000006

#define _RPOR5_RP42R_POSITION                    0x00000000
#define _RPOR5_RP42R_MASK                        0x0000003F
#define _RPOR5_RP42R_LENGTH                      0x00000006

#define _RPOR5_RP43R_POSITION                    0x00000008
#define _RPOR5_RP43R_MASK                        0x00003F00
#define _RPOR5_RP43R_LENGTH                      0x00000006

#define _RPOR6_RP44R_POSITION                    0x00000000
#define _RPOR6_RP44R_MASK                        0x0000003F
#define _RPOR6_RP44R_LENGTH                      0x00000006

#define _RPOR6_RP45R_POSITION                    0x00000008
#define _RPOR6_RP45R_MASK                        0x00003F00
#define _RPOR6_RP45R_LENGTH                      0x00000006

#define _RPOR7_RP46R_POSITION                    0x00000000
#define _RPOR7_RP46R_MASK                        0x0000003F
#define _RPOR7_RP46R_LENGTH                      0x00000006

#define _RPOR7_RP47R_POSITION                    0x00000008
#define _RPOR7_RP47R_MASK                        0x00003F00
#define _RPOR7_RP47R_LENGTH                      0x00000006

#define _RPOR8_RP48R_POSITION                    0x00000000
#define _RPOR8_RP48R_MASK                        0x0000003F
#define _RPOR8_RP48R_LENGTH                      0x00000006

#define _RPOR8_RP49R_POSITION                    0x00000008
#define _RPOR8_RP49R_MASK                        0x00003F00
#define _RPOR8_RP49R_LENGTH                      0x00000006

#define _RPOR9_RP50R_POSITION                    0x00000000
#define _RPOR9_RP50R_MASK                        0x0000003F
#define _RPOR9_RP50R_LENGTH                      0x00000006

#define _RPOR9_RP51R_POSITION                    0x00000008
#define _RPOR9_RP51R_MASK                        0x00003F00
#define _RPOR9_RP51R_LENGTH                      0x00000006

#define _RPOR10_RP52R_POSITION                   0x00000000
#define _RPOR10_RP52R_MASK                       0x0000003F
#define _RPOR10_RP52R_LENGTH                     0x00000006

#define _RPOR10_RP53R_POSITION                   0x00000008
#define _RPOR10_RP53R_MASK                       0x00003F00
#define _RPOR10_RP53R_LENGTH                     0x00000006

#define _RPOR11_RP54R_POSITION                   0x00000000
#define _RPOR11_RP54R_MASK                       0x0000003F
#define _RPOR11_RP54R_LENGTH                     0x00000006

#define _RPOR11_RP55R_POSITION                   0x00000008
#define _RPOR11_RP55R_MASK                       0x00003F00
#define _RPOR11_RP55R_LENGTH                     0x00000006

#define _RPOR12_RP56R_POSITION                   0x00000000
#define _RPOR12_RP56R_MASK                       0x0000003F
#define _RPOR12_RP56R_LENGTH                     0x00000006

#define _RPOR12_RP57R_POSITION                   0x00000008
#define _RPOR12_RP57R_MASK                       0x00003F00
#define _RPOR12_RP57R_LENGTH                     0x00000006

#define _RPOR13_RP58R_POSITION                   0x00000000
#define _RPOR13_RP58R_MASK                       0x0000003F
#define _RPOR13_RP58R_LENGTH                     0x00000006

#define _RPOR13_RP59R_POSITION                   0x00000008
#define _RPOR13_RP59R_MASK                       0x00003F00
#define _RPOR13_RP59R_LENGTH                     0x00000006

#define _RPOR14_RP60R_POSITION                   0x00000000
#define _RPOR14_RP60R_MASK                       0x0000003F
#define _RPOR14_RP60R_LENGTH                     0x00000006

