draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _RPOR14_RP61R_POSITION                   0x00000008
#define _RPOR14_RP61R_MASK                       0x00003F00
#define _RPOR14_RP61R_LENGTH                     0x00000006

#define _RPOR15_RP62R_POSITION                   0x00000000
#define _RPOR15_RP62R_MASK                       0x0000003F
#define _RPOR15_RP62R_LENGTH                     0x00000006

#define _RPOR15_RP63R_POSITION                   0x00000008
#define _RPOR15_RP63R_MASK                       0x00003F00
#define _RPOR15_RP63R_LENGTH                     0x00000006

#define _RPOR16_RP64R_POSITION                   0x00000000
#define _RPOR16_RP64R_MASK                       0x0000003F
#define _RPOR16_RP64R_LENGTH                     0x00000006

#define _RPOR16_RP65R_POSITION                   0x00000008
#define _RPOR16_RP65R_MASK                       0x00003F00
#define _RPOR16_RP65R_LENGTH                     0x00000006

#define _RPOR17_RP66R_POSITION                   0x00000000
#define _RPOR17_RP66R_MASK                       0x0000003F
#define _RPOR17_RP66R_LENGTH                     0x00000006

#define _RPOR17_RP67R_POSITION                   0x00000008
#define _RPOR17_RP67R_MASK                       0x00003F00
#define _RPOR17_RP67R_LENGTH                     0x00000006

#define _RPOR18_RP68R_POSITION                   0x00000000
#define _RPOR18_RP68R_MASK                       0x0000003F
#define _RPOR18_RP68R_LENGTH                     0x00000006

#define _RPOR18_RP69R_POSITION                   0x00000008
#define _RPOR18_RP69R_MASK                       0x00003F00
#define _RPOR18_RP69R_LENGTH                     0x00000006

#define _RPOR19_RP70R_POSITION                   0x00000000
#define _RPOR19_RP70R_MASK                       0x0000003F
#define _RPOR19_RP70R_LENGTH                     0x00000006

#define _RPOR19_RP71R_POSITION                   0x00000008
#define _RPOR19_RP71R_MASK                       0x00003F00
#define _RPOR19_RP71R_LENGTH                     0x00000006

#define _RPOR20_RP72R_POSITION                   0x00000000
#define _RPOR20_RP72R_MASK                       0x0000003F
#define _RPOR20_RP72R_LENGTH                     0x00000006

#define _RPOR20_RP73R_POSITION                   0x00000008
#define _RPOR20_RP73R_MASK                       0x00003F00
#define _RPOR20_RP73R_LENGTH                     0x00000006

#define _RPOR21_RP74R_POSITION                   0x00000000
#define _RPOR21_RP74R_MASK                       0x0000003F
#define _RPOR21_RP74R_LENGTH                     0x00000006

#define _RPOR21_RP75R_POSITION                   0x00000008
#define _RPOR21_RP75R_MASK                       0x00003F00
#define _RPOR21_RP75R_LENGTH                     0x00000006

#define _RPOR22_RP76R_POSITION                   0x00000000
#define _RPOR22_RP76R_MASK                       0x0000003F
#define _RPOR22_RP76R_LENGTH                     0x00000006

#define _RPOR22_RP77R_POSITION                   0x00000008
#define _RPOR22_RP77R_MASK                       0x00003F00
#define _RPOR22_RP77R_LENGTH                     0x00000006

#define _RPOR23_RP78R_POSITION                   0x00000000
#define _RPOR23_RP78R_MASK                       0x0000003F
#define _RPOR23_RP78R_LENGTH                     0x00000006

#define _RPOR23_RP79R_POSITION                   0x00000008
#define _RPOR23_RP79R_MASK                       0x00003F00
#define _RPOR23_RP79R_LENGTH                     0x00000006

#define _RPOR24_RP176R_POSITION                  0x00000000
#define _RPOR24_RP176R_MASK                      0x0000003F
#define _RPOR24_RP176R_LENGTH                    0x00000006

#define _RPOR24_RP177R_POSITION                  0x00000008
#define _RPOR24_RP177R_MASK                      0x00003F00
#define _RPOR24_RP177R_LENGTH                    0x00000006

#define _RPOR25_RP178R_POSITION                  0x00000000
#define _RPOR25_RP178R_MASK                      0x0000003F
#define _RPOR25_RP178R_LENGTH                    0x00000006

#define _RPOR25_RP179R_POSITION                  0x00000008
#define _RPOR25_RP179R_MASK                      0x00003F00
#define _RPOR25_RP179R_LENGTH                    0x00000006

#define _RPOR26_RP180R_POSITION                  0x00000000
#define _RPOR26_RP180R_MASK                      0x0000003F
#define _RPOR26_RP180R_LENGTH                    0x00000006

#define _RPOR26_RP181R_POSITION                  0x00000008
#define _RPOR26_RP181R_MASK                      0x00003F00
#define _RPOR26_RP181R_LENGTH                    0x00000006

#define _ANSELA_ANSELA0_POSITION                 0x00000000
#define _ANSELA_ANSELA0_MASK                     0x00000001
#define _ANSELA_ANSELA0_LENGTH                   0x00000001

#define _ANSELA_ANSELA1_POSITION                 0x00000001
#define _ANSELA_ANSELA1_MASK                     0x00000002
#define _ANSELA_ANSELA1_LENGTH                   0x00000001

#define _ANSELA_ANSELA2_POSITION                 0x00000002
#define _ANSELA_ANSELA2_MASK                     0x00000004
#define _ANSELA_ANSELA2_LENGTH                   0x00000001

#define _ANSELA_ANSELA3_POSITION                 0x00000003
#define _ANSELA_ANSELA3_MASK                     0x00000008
#define _ANSELA_ANSELA3_LENGTH                   0x00000001

#define _ANSELA_ANSELA4_POSITION                 0x00000004
#define _ANSELA_ANSELA4_MASK                     0x00000010
#define _ANSELA_ANSELA4_LENGTH                   0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _PORTA_RA0_POSITION                      0x00000000
#define _PORTA_RA0_MASK                          0x00000001
#define _PORTA_RA0_LENGTH                        0x00000001

#define _PORTA_RA1_POSITION                      0x00000001
#define _PORTA_RA1_MASK                          0x00000002
#define _PORTA_RA1_LENGTH                        0x00000001

#define _PORTA_RA2_POSITION                      0x00000002
#define _PORTA_RA2_MASK                          0x00000004
#define _PORTA_RA2_LENGTH                        0x00000001

#define _PORTA_RA3_POSITION                      0x00000003
#define _PORTA_RA3_MASK                          0x00000008
#define _PORTA_RA3_LENGTH                        0x00000001

#define _PORTA_RA4_POSITION                      0x00000004
#define _PORTA_RA4_MASK                          0x00000010
#define _PORTA_RA4_LENGTH                        0x00000001

#define _LATA_LATA0_POSITION                     0x00000000
#define _LATA_LATA0_MASK                         0x00000001
#define _LATA_LATA0_LENGTH                       0x00000001

