draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _CNPDC_CNPDC2_POSITION                   0x00000002
#define _CNPDC_CNPDC2_MASK                       0x00000004
#define _CNPDC_CNPDC2_LENGTH                     0x00000001

#define _CNPDC_CNPDC3_POSITION                   0x00000003
#define _CNPDC_CNPDC3_MASK                       0x00000008
#define _CNPDC_CNPDC3_LENGTH                     0x00000001

#define _CNPDC_CNPDC4_POSITION                   0x00000004
#define _CNPDC_CNPDC4_MASK                       0x00000010
#define _CNPDC_CNPDC4_LENGTH                     0x00000001

#define _CNPDC_CNPDC5_POSITION                   0x00000005
#define _CNPDC_CNPDC5_MASK                       0x00000020
#define _CNPDC_CNPDC5_LENGTH                     0x00000001

#define _CNPDC_CNPDC6_POSITION                   0x00000006
#define _CNPDC_CNPDC6_MASK                       0x00000040
#define _CNPDC_CNPDC6_LENGTH                     0x00000001

#define _CNPDC_CNPDC7_POSITION                   0x00000007
#define _CNPDC_CNPDC7_MASK                       0x00000080
#define _CNPDC_CNPDC7_LENGTH                     0x00000001

#define _CNPDC_CNPDC8_POSITION                   0x00000008
#define _CNPDC_CNPDC8_MASK                       0x00000100
#define _CNPDC_CNPDC8_LENGTH                     0x00000001

#define _CNPDC_CNPDC9_POSITION                   0x00000009
#define _CNPDC_CNPDC9_MASK                       0x00000200
#define _CNPDC_CNPDC9_LENGTH                     0x00000001

#define _CNPDC_CNPDC10_POSITION                  0x0000000A
#define _CNPDC_CNPDC10_MASK                      0x00000400
#define _CNPDC_CNPDC10_LENGTH                    0x00000001

#define _CNPDC_CNPDC11_POSITION                  0x0000000B
#define _CNPDC_CNPDC11_MASK                      0x00000800
#define _CNPDC_CNPDC11_LENGTH                    0x00000001

#define _CNPDC_CNPDC12_POSITION                  0x0000000C
#define _CNPDC_CNPDC12_MASK                      0x00001000
#define _CNPDC_CNPDC12_LENGTH                    0x00000001

#define _CNPDC_CNPDC13_POSITION                  0x0000000D
#define _CNPDC_CNPDC13_MASK                      0x00002000
#define _CNPDC_CNPDC13_LENGTH                    0x00000001

#define _CNPDC_CNPDC14_POSITION                  0x0000000E
#define _CNPDC_CNPDC14_MASK                      0x00004000
#define _CNPDC_CNPDC14_LENGTH                    0x00000001

#define _CNPDC_CNPDC15_POSITION                  0x0000000F
#define _CNPDC_CNPDC15_MASK                      0x00008000
#define _CNPDC_CNPDC15_LENGTH                    0x00000001

#define _CNCONC_CNSTYLE_POSITION                 0x0000000B
#define _CNCONC_CNSTYLE_MASK                     0x00000800
#define _CNCONC_CNSTYLE_LENGTH                   0x00000001

#define _CNCONC_ON_POSITION                      0x0000000F
#define _CNCONC_ON_MASK                          0x00008000
#define _CNCONC_ON_LENGTH                        0x00000001

#define _CNEN0C_CNEN0C0_POSITION                 0x00000000
#define _CNEN0C_CNEN0C0_MASK                     0x00000001
#define _CNEN0C_CNEN0C0_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C1_POSITION                 0x00000001
#define _CNEN0C_CNEN0C1_MASK                     0x00000002
#define _CNEN0C_CNEN0C1_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C2_POSITION                 0x00000002
#define _CNEN0C_CNEN0C2_MASK                     0x00000004
#define _CNEN0C_CNEN0C2_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C3_POSITION                 0x00000003
#define _CNEN0C_CNEN0C3_MASK                     0x00000008
#define _CNEN0C_CNEN0C3_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C4_POSITION                 0x00000004
#define _CNEN0C_CNEN0C4_MASK                     0x00000010
#define _CNEN0C_CNEN0C4_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C5_POSITION                 0x00000005
#define _CNEN0C_CNEN0C5_MASK                     0x00000020
#define _CNEN0C_CNEN0C5_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C6_POSITION                 0x00000006
#define _CNEN0C_CNEN0C6_MASK                     0x00000040
#define _CNEN0C_CNEN0C6_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C7_POSITION                 0x00000007
#define _CNEN0C_CNEN0C7_MASK                     0x00000080
#define _CNEN0C_CNEN0C7_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C8_POSITION                 0x00000008
#define _CNEN0C_CNEN0C8_MASK                     0x00000100
#define _CNEN0C_CNEN0C8_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C9_POSITION                 0x00000009
#define _CNEN0C_CNEN0C9_MASK                     0x00000200
#define _CNEN0C_CNEN0C9_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C10_POSITION                0x0000000A
#define _CNEN0C_CNEN0C10_MASK                    0x00000400
#define _CNEN0C_CNEN0C10_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C11_POSITION                0x0000000B
#define _CNEN0C_CNEN0C11_MASK                    0x00000800
#define _CNEN0C_CNEN0C11_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C12_POSITION                0x0000000C
#define _CNEN0C_CNEN0C12_MASK                    0x00001000
#define _CNEN0C_CNEN0C12_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C13_POSITION                0x0000000D
#define _CNEN0C_CNEN0C13_MASK                    0x00002000
#define _CNEN0C_CNEN0C13_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C14_POSITION                0x0000000E
#define _CNEN0C_CNEN0C14_MASK                    0x00004000
#define _CNEN0C_CNEN0C14_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C15_POSITION                0x0000000F
#define _CNEN0C_CNEN0C15_MASK                    0x00008000
#define _CNEN0C_CNEN0C15_LENGTH                  0x00000001

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

