draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _CNSTATC_CNSTATC3_POSITION               0x00000003
#define _CNSTATC_CNSTATC3_MASK                   0x00000008
#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC4_POSITION               0x00000004
#define _CNSTATC_CNSTATC4_MASK                   0x00000010
#define _CNSTATC_CNSTATC4_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC5_POSITION               0x00000005
#define _CNSTATC_CNSTATC5_MASK                   0x00000020
#define _CNSTATC_CNSTATC5_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC6_POSITION               0x00000006
#define _CNSTATC_CNSTATC6_MASK                   0x00000040
#define _CNSTATC_CNSTATC6_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC7_POSITION               0x00000007
#define _CNSTATC_CNSTATC7_MASK                   0x00000080
#define _CNSTATC_CNSTATC7_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC10_POSITION              0x0000000A
#define _CNSTATC_CNSTATC10_MASK                  0x00000400
#define _CNSTATC_CNSTATC10_LENGTH                0x00000001

#define _CNSTATC_CNSTATC11_POSITION              0x0000000B
#define _CNSTATC_CNSTATC11_MASK                  0x00000800
#define _CNSTATC_CNSTATC11_LENGTH                0x00000001

#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
#define _CNSTATC_CNSTATC12_MASK                  0x00001000
#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

#define _CNSTATC_CNSTATC13_POSITION              0x0000000D
#define _CNSTATC_CNSTATC13_MASK                  0x00002000
#define _CNSTATC_CNSTATC13_LENGTH                0x00000001

#define _CNSTATC_CNSTATC14_POSITION              0x0000000E
#define _CNSTATC_CNSTATC14_MASK                  0x00004000
#define _CNSTATC_CNSTATC14_LENGTH                0x00000001

#define _CNSTATC_CNSTATC15_POSITION              0x0000000F
#define _CNSTATC_CNSTATC15_MASK                  0x00008000
#define _CNSTATC_CNSTATC15_LENGTH                0x00000001

#define _CNEN1C_CNEN1C0_POSITION                 0x00000000
#define _CNEN1C_CNEN1C0_MASK                     0x00000001
#define _CNEN1C_CNEN1C0_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C1_POSITION                 0x00000001
#define _CNEN1C_CNEN1C1_MASK                     0x00000002
#define _CNEN1C_CNEN1C1_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C2_POSITION                 0x00000002
#define _CNEN1C_CNEN1C2_MASK                     0x00000004
#define _CNEN1C_CNEN1C2_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C3_POSITION                 0x00000003
#define _CNEN1C_CNEN1C3_MASK                     0x00000008
#define _CNEN1C_CNEN1C3_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C4_POSITION                 0x00000004
#define _CNEN1C_CNEN1C4_MASK                     0x00000010
#define _CNEN1C_CNEN1C4_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C5_POSITION                 0x00000005
#define _CNEN1C_CNEN1C5_MASK                     0x00000020
#define _CNEN1C_CNEN1C5_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C6_POSITION                 0x00000006
#define _CNEN1C_CNEN1C6_MASK                     0x00000040
#define _CNEN1C_CNEN1C6_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C7_POSITION                 0x00000007
#define _CNEN1C_CNEN1C7_MASK                     0x00000080
#define _CNEN1C_CNEN1C7_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C8_POSITION                 0x00000008
#define _CNEN1C_CNEN1C8_MASK                     0x00000100
#define _CNEN1C_CNEN1C8_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C9_POSITION                 0x00000009
#define _CNEN1C_CNEN1C9_MASK                     0x00000200
#define _CNEN1C_CNEN1C9_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C10_POSITION                0x0000000A
#define _CNEN1C_CNEN1C10_MASK                    0x00000400
#define _CNEN1C_CNEN1C10_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C11_POSITION                0x0000000B
#define _CNEN1C_CNEN1C11_MASK                    0x00000800
#define _CNEN1C_CNEN1C11_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C12_POSITION                0x0000000C
#define _CNEN1C_CNEN1C12_MASK                    0x00001000
#define _CNEN1C_CNEN1C12_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C13_POSITION                0x0000000D
#define _CNEN1C_CNEN1C13_MASK                    0x00002000
#define _CNEN1C_CNEN1C13_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C14_POSITION                0x0000000E
#define _CNEN1C_CNEN1C14_MASK                    0x00004000
#define _CNEN1C_CNEN1C14_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C15_POSITION                0x0000000F
#define _CNEN1C_CNEN1C15_MASK                    0x00008000
#define _CNEN1C_CNEN1C15_LENGTH                  0x00000001

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC3_POSITION                     0x00000003
#define _CNFC_CNFC3_MASK                         0x00000008
#define _CNFC_CNFC3_LENGTH                       0x00000001

#define _CNFC_CNFC4_POSITION                     0x00000004
#define _CNFC_CNFC4_MASK                         0x00000010
#define _CNFC_CNFC4_LENGTH                       0x00000001

#define _CNFC_CNFC5_POSITION                     0x00000005
#define _CNFC_CNFC5_MASK                         0x00000020
#define _CNFC_CNFC5_LENGTH                       0x00000001

#define _CNFC_CNFC6_POSITION                     0x00000006
#define _CNFC_CNFC6_MASK                         0x00000040
#define _CNFC_CNFC6_LENGTH                       0x00000001

#define _CNFC_CNFC7_POSITION                     0x00000007
#define _CNFC_CNFC7_MASK                         0x00000080
#define _CNFC_CNFC7_LENGTH                       0x00000001

