draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _CNPDD_CNPDD13_POSITION                  0x0000000D
#define _CNPDD_CNPDD13_MASK                      0x00002000
#define _CNPDD_CNPDD13_LENGTH                    0x00000001

#define _CNPDD_CNPDD14_POSITION                  0x0000000E
#define _CNPDD_CNPDD14_MASK                      0x00004000
#define _CNPDD_CNPDD14_LENGTH                    0x00000001

#define _CNPDD_CNPDD15_POSITION                  0x0000000F
#define _CNPDD_CNPDD15_MASK                      0x00008000
#define _CNPDD_CNPDD15_LENGTH                    0x00000001

#define _CNCOND_CNSTYLE_POSITION                 0x0000000B
#define _CNCOND_CNSTYLE_MASK                     0x00000800
#define _CNCOND_CNSTYLE_LENGTH                   0x00000001

#define _CNCOND_ON_POSITION                      0x0000000F
#define _CNCOND_ON_MASK                          0x00008000
#define _CNCOND_ON_LENGTH                        0x00000001

#define _CNEN0D_CNEN0D0_POSITION                 0x00000000
#define _CNEN0D_CNEN0D0_MASK                     0x00000001
#define _CNEN0D_CNEN0D0_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D1_POSITION                 0x00000001
#define _CNEN0D_CNEN0D1_MASK                     0x00000002
#define _CNEN0D_CNEN0D1_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D2_POSITION                 0x00000002
#define _CNEN0D_CNEN0D2_MASK                     0x00000004
#define _CNEN0D_CNEN0D2_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D3_POSITION                 0x00000003
#define _CNEN0D_CNEN0D3_MASK                     0x00000008
#define _CNEN0D_CNEN0D3_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D4_POSITION                 0x00000004
#define _CNEN0D_CNEN0D4_MASK                     0x00000010
#define _CNEN0D_CNEN0D4_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D5_POSITION                 0x00000005
#define _CNEN0D_CNEN0D5_MASK                     0x00000020
#define _CNEN0D_CNEN0D5_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D6_POSITION                 0x00000006
#define _CNEN0D_CNEN0D6_MASK                     0x00000040
#define _CNEN0D_CNEN0D6_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D7_POSITION                 0x00000007
#define _CNEN0D_CNEN0D7_MASK                     0x00000080
#define _CNEN0D_CNEN0D7_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D8_POSITION                 0x00000008
#define _CNEN0D_CNEN0D8_MASK                     0x00000100
#define _CNEN0D_CNEN0D8_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D9_POSITION                 0x00000009
#define _CNEN0D_CNEN0D9_MASK                     0x00000200
#define _CNEN0D_CNEN0D9_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D10_POSITION                0x0000000A
#define _CNEN0D_CNEN0D10_MASK                    0x00000400
#define _CNEN0D_CNEN0D10_LENGTH                  0x00000001

#define _CNEN0D_CNEN0D11_POSITION                0x0000000B
#define _CNEN0D_CNEN0D11_MASK                    0x00000800
#define _CNEN0D_CNEN0D11_LENGTH                  0x00000001

#define _CNEN0D_CNEN0D12_POSITION                0x0000000C
#define _CNEN0D_CNEN0D12_MASK                    0x00001000
#define _CNEN0D_CNEN0D12_LENGTH                  0x00000001

#define _CNEN0D_CNEN0D13_POSITION                0x0000000D
#define _CNEN0D_CNEN0D13_MASK                    0x00002000
#define _CNEN0D_CNEN0D13_LENGTH                  0x00000001

#define _CNEN0D_CNEN0D14_POSITION                0x0000000E
#define _CNEN0D_CNEN0D14_MASK                    0x00004000
#define _CNEN0D_CNEN0D14_LENGTH                  0x00000001

#define _CNEN0D_CNEN0D15_POSITION                0x0000000F
#define _CNEN0D_CNEN0D15_MASK                    0x00008000
#define _CNEN0D_CNEN0D15_LENGTH                  0x00000001

#define _CNSTATD_CNSTATD0_POSITION               0x00000000
#define _CNSTATD_CNSTATD0_MASK                   0x00000001
#define _CNSTATD_CNSTATD0_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD1_POSITION               0x00000001
#define _CNSTATD_CNSTATD1_MASK                   0x00000002
#define _CNSTATD_CNSTATD1_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD2_POSITION               0x00000002
#define _CNSTATD_CNSTATD2_MASK                   0x00000004
#define _CNSTATD_CNSTATD2_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD3_POSITION               0x00000003
#define _CNSTATD_CNSTATD3_MASK                   0x00000008
#define _CNSTATD_CNSTATD3_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD4_POSITION               0x00000004
#define _CNSTATD_CNSTATD4_MASK                   0x00000010
#define _CNSTATD_CNSTATD4_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD5_POSITION               0x00000005
#define _CNSTATD_CNSTATD5_MASK                   0x00000020
#define _CNSTATD_CNSTATD5_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD6_POSITION               0x00000006
#define _CNSTATD_CNSTATD6_MASK                   0x00000040
#define _CNSTATD_CNSTATD6_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD7_POSITION               0x00000007
#define _CNSTATD_CNSTATD7_MASK                   0x00000080
#define _CNSTATD_CNSTATD7_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD8_POSITION               0x00000008
#define _CNSTATD_CNSTATD8_MASK                   0x00000100
#define _CNSTATD_CNSTATD8_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD9_POSITION               0x00000009
#define _CNSTATD_CNSTATD9_MASK                   0x00000200
#define _CNSTATD_CNSTATD9_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD10_POSITION              0x0000000A
#define _CNSTATD_CNSTATD10_MASK                  0x00000400
#define _CNSTATD_CNSTATD10_LENGTH                0x00000001

#define _CNSTATD_CNSTATD11_POSITION              0x0000000B
#define _CNSTATD_CNSTATD11_MASK                  0x00000800
#define _CNSTATD_CNSTATD11_LENGTH                0x00000001

#define _CNSTATD_CNSTATD12_POSITION              0x0000000C
#define _CNSTATD_CNSTATD12_MASK                  0x00001000
#define _CNSTATD_CNSTATD12_LENGTH                0x00000001

#define _CNSTATD_CNSTATD13_POSITION              0x0000000D
#define _CNSTATD_CNSTATD13_MASK                  0x00002000
#define _CNSTATD_CNSTATD13_LENGTH                0x00000001

#define _CNSTATD_CNSTATD14_POSITION              0x0000000E
#define _CNSTATD_CNSTATD14_MASK                  0x00004000
#define _CNSTATD_CNSTATD14_LENGTH                0x00000001

#define _CNSTATD_CNSTATD15_POSITION              0x0000000F
#define _CNSTATD_CNSTATD15_MASK                  0x00008000
#define _CNSTATD_CNSTATD15_LENGTH                0x00000001

#define _CNEN1D_CNEN1D0_POSITION                 0x00000000
#define _CNEN1D_CNEN1D0_MASK                     0x00000001
#define _CNEN1D_CNEN1D0_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D1_POSITION                 0x00000001
#define _CNEN1D_CNEN1D1_MASK                     0x00000002
#define _CNEN1D_CNEN1D1_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D2_POSITION                 0x00000002
#define _CNEN1D_CNEN1D2_MASK                     0x00000004
#define _CNEN1D_CNEN1D2_LENGTH                   0x00000001

