draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _U3STA_TXCIE_POSITION                    0x00000008
#define _U3STA_TXCIE_MASK                        0x00000100
#define _U3STA_TXCIE_LENGTH                      0x00000001

#define _U3STA_OERIE_POSITION                    0x00000009
#define _U3STA_OERIE_MASK                        0x00000200
#define _U3STA_OERIE_LENGTH                      0x00000001

#define _U3STA_RXBKIE_POSITION                   0x0000000A
#define _U3STA_RXBKIE_MASK                       0x00000400
#define _U3STA_RXBKIE_LENGTH                     0x00000001

#define _U3STA_FERIE_POSITION                    0x0000000B
#define _U3STA_FERIE_MASK                        0x00000800
#define _U3STA_FERIE_LENGTH                      0x00000001

#define _U3STA_CERIE_POSITION                    0x0000000C
#define _U3STA_CERIE_MASK                        0x00001000
#define _U3STA_CERIE_LENGTH                      0x00000001

#define _U3STA_ABDOVE_POSITION                   0x0000000D
#define _U3STA_ABDOVE_MASK                       0x00002000
#define _U3STA_ABDOVE_LENGTH                     0x00000001

#define _U3STA_PERIE_POSITION                    0x0000000E
#define _U3STA_PERIE_MASK                        0x00004000
#define _U3STA_PERIE_LENGTH                      0x00000001

#define _U3STA_TXMTIE_POSITION                   0x0000000F
#define _U3STA_TXMTIE_MASK                       0x00008000
#define _U3STA_TXMTIE_LENGTH                     0x00000001

#define _U3STAH_URXBF_POSITION                   0x00000000
#define _U3STAH_URXBF_MASK                       0x00000001
#define _U3STAH_URXBF_LENGTH                     0x00000001

#define _U3STAH_URXBE_POSITION                   0x00000001
#define _U3STAH_URXBE_MASK                       0x00000002
#define _U3STAH_URXBE_LENGTH                     0x00000001

#define _U3STAH_XON_POSITION                     0x00000002
#define _U3STAH_XON_MASK                         0x00000004
#define _U3STAH_XON_LENGTH                       0x00000001

#define _U3STAH_RIDLE_POSITION                   0x00000003
#define _U3STAH_RIDLE_MASK                       0x00000008
#define _U3STAH_RIDLE_LENGTH                     0x00000001

#define _U3STAH_UTXBF_POSITION                   0x00000004
#define _U3STAH_UTXBF_MASK                       0x00000010
#define _U3STAH_UTXBF_LENGTH                     0x00000001

#define _U3STAH_UTXBE_POSITION                   0x00000005
#define _U3STAH_UTXBE_MASK                       0x00000020
#define _U3STAH_UTXBE_LENGTH                     0x00000001

#define _U3STAH_STPMD_POSITION                   0x00000006
#define _U3STAH_STPMD_MASK                       0x00000040
#define _U3STAH_STPMD_LENGTH                     0x00000001

#define _U3STAH_TXWRE_POSITION                   0x00000007
#define _U3STAH_TXWRE_MASK                       0x00000080
#define _U3STAH_TXWRE_LENGTH                     0x00000001

#define _U3STAH_URXISEL_POSITION                 0x00000008
#define _U3STAH_URXISEL_MASK                     0x00000700
#define _U3STAH_URXISEL_LENGTH                   0x00000003

#define _U3STAH_UTXISEL_POSITION                 0x0000000C
#define _U3STAH_UTXISEL_MASK                     0x00007000
#define _U3STAH_UTXISEL_LENGTH                   0x00000003

#define _U3STAH_URXISEL0_POSITION                0x00000008
#define _U3STAH_URXISEL0_MASK                    0x00000100
#define _U3STAH_URXISEL0_LENGTH                  0x00000001

#define _U3STAH_URXISEL1_POSITION                0x00000009
#define _U3STAH_URXISEL1_MASK                    0x00000200
#define _U3STAH_URXISEL1_LENGTH                  0x00000001

#define _U3STAH_URXISEL2_POSITION                0x0000000A
#define _U3STAH_URXISEL2_MASK                    0x00000400
#define _U3STAH_URXISEL2_LENGTH                  0x00000001

#define _U3STAH_UTXISEL0_POSITION                0x0000000C
#define _U3STAH_UTXISEL0_MASK                    0x00001000
#define _U3STAH_UTXISEL0_LENGTH                  0x00000001

#define _U3STAH_UTXISEL1_POSITION                0x0000000D
#define _U3STAH_UTXISEL1_MASK                    0x00002000
#define _U3STAH_UTXISEL1_LENGTH                  0x00000001

#define _U3STAH_UTXISEL2_POSITION                0x0000000E
#define _U3STAH_UTXISEL2_MASK                    0x00004000
#define _U3STAH_UTXISEL2_LENGTH                  0x00000001

#define _U3BRG_BRG_POSITION                      0x00000000
#define _U3BRG_BRG_MASK                          0x0000FFFF
#define _U3BRG_BRG_LENGTH                        0x00000010

#define _U3BRG_BRG0_POSITION                     0x00000000
#define _U3BRG_BRG0_MASK                         0x00000001
#define _U3BRG_BRG0_LENGTH                       0x00000001

#define _U3BRG_BRG1_POSITION                     0x00000001
#define _U3BRG_BRG1_MASK                         0x00000002
#define _U3BRG_BRG1_LENGTH                       0x00000001

#define _U3BRG_BRG2_POSITION                     0x00000002
#define _U3BRG_BRG2_MASK                         0x00000004
#define _U3BRG_BRG2_LENGTH                       0x00000001

#define _U3BRG_BRG3_POSITION                     0x00000003
#define _U3BRG_BRG3_MASK                         0x00000008
#define _U3BRG_BRG3_LENGTH                       0x00000001

#define _U3BRG_BRG4_POSITION                     0x00000004
#define _U3BRG_BRG4_MASK                         0x00000010
#define _U3BRG_BRG4_LENGTH                       0x00000001

#define _U3BRG_BRG5_POSITION                     0x00000005
#define _U3BRG_BRG5_MASK                         0x00000020
#define _U3BRG_BRG5_LENGTH                       0x00000001

#define _U3BRG_BRG6_POSITION                     0x00000006
#define _U3BRG_BRG6_MASK                         0x00000040
#define _U3BRG_BRG6_LENGTH                       0x00000001

#define _U3BRG_BRG7_POSITION                     0x00000007
#define _U3BRG_BRG7_MASK                         0x00000080
#define _U3BRG_BRG7_LENGTH                       0x00000001

#define _U3BRG_BRG8_POSITION                     0x00000008
#define _U3BRG_BRG8_MASK                         0x00000100
#define _U3BRG_BRG8_LENGTH                       0x00000001

