draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _U3BRG_BRG9_POSITION                     0x00000009
#define _U3BRG_BRG9_MASK                         0x00000200
#define _U3BRG_BRG9_LENGTH                       0x00000001

#define _U3BRG_BRG10_POSITION                    0x0000000A
#define _U3BRG_BRG10_MASK                        0x00000400
#define _U3BRG_BRG10_LENGTH                      0x00000001

#define _U3BRG_BRG11_POSITION                    0x0000000B
#define _U3BRG_BRG11_MASK                        0x00000800
#define _U3BRG_BRG11_LENGTH                      0x00000001

#define _U3BRG_BRG12_POSITION                    0x0000000C
#define _U3BRG_BRG12_MASK                        0x00001000
#define _U3BRG_BRG12_LENGTH                      0x00000001

#define _U3BRG_BRG13_POSITION                    0x0000000D
#define _U3BRG_BRG13_MASK                        0x00002000
#define _U3BRG_BRG13_LENGTH                      0x00000001

#define _U3BRG_BRG14_POSITION                    0x0000000E
#define _U3BRG_BRG14_MASK                        0x00004000
#define _U3BRG_BRG14_LENGTH                      0x00000001

#define _U3BRG_BRG15_POSITION                    0x0000000F
#define _U3BRG_BRG15_MASK                        0x00008000
#define _U3BRG_BRG15_LENGTH                      0x00000001

#define _U3BRGH_BRG_POSITION                     0x00000000
#define _U3BRGH_BRG_MASK                         0x0000000F
#define _U3BRGH_BRG_LENGTH                       0x00000004

#define _U3BRGH_BRG16_POSITION                   0x00000000
#define _U3BRGH_BRG16_MASK                       0x00000001
#define _U3BRGH_BRG16_LENGTH                     0x00000001

#define _U3BRGH_BRG1_POSITION                    0x00000001
#define _U3BRGH_BRG1_MASK                        0x00000002
#define _U3BRGH_BRG1_LENGTH                      0x00000001

#define _U3BRGH_BRG18_POSITION                   0x00000002
#define _U3BRGH_BRG18_MASK                       0x00000004
#define _U3BRGH_BRG18_LENGTH                     0x00000001

#define _U3BRGH_BRG19_POSITION                   0x00000003
#define _U3BRGH_BRG19_MASK                       0x00000008
#define _U3BRGH_BRG19_LENGTH                     0x00000001

#define _U3RXREG_RXREG_POSITION                  0x00000000
#define _U3RXREG_RXREG_MASK                      0x000000FF
#define _U3RXREG_RXREG_LENGTH                    0x00000008

#define _U3RXREG_RXREG0_POSITION                 0x00000000
#define _U3RXREG_RXREG0_MASK                     0x00000001
#define _U3RXREG_RXREG0_LENGTH                   0x00000001

#define _U3RXREG_RXREG1_POSITION                 0x00000001
#define _U3RXREG_RXREG1_MASK                     0x00000002
#define _U3RXREG_RXREG1_LENGTH                   0x00000001

#define _U3RXREG_RXREG2_POSITION                 0x00000002
#define _U3RXREG_RXREG2_MASK                     0x00000004
#define _U3RXREG_RXREG2_LENGTH                   0x00000001

#define _U3RXREG_RXREG3_POSITION                 0x00000003
#define _U3RXREG_RXREG3_MASK                     0x00000008
#define _U3RXREG_RXREG3_LENGTH                   0x00000001

#define _U3RXREG_RXREG4_POSITION                 0x00000004
#define _U3RXREG_RXREG4_MASK                     0x00000010
#define _U3RXREG_RXREG4_LENGTH                   0x00000001

#define _U3RXREG_RXREG5_POSITION                 0x00000005
#define _U3RXREG_RXREG5_MASK                     0x00000020
#define _U3RXREG_RXREG5_LENGTH                   0x00000001

#define _U3RXREG_RXREG6_POSITION                 0x00000006
#define _U3RXREG_RXREG6_MASK                     0x00000040
#define _U3RXREG_RXREG6_LENGTH                   0x00000001

#define _U3RXREG_RXREG7_POSITION                 0x00000007
#define _U3RXREG_RXREG7_MASK                     0x00000080
#define _U3RXREG_RXREG7_LENGTH                   0x00000001

#define _U3TXREG_TXREG_POSITION                  0x00000000
#define _U3TXREG_TXREG_MASK                      0x000000FF
#define _U3TXREG_TXREG_LENGTH                    0x00000008

#define _U3TXREG_LAST_POSITION                   0x0000000F
#define _U3TXREG_LAST_MASK                       0x00008000
#define _U3TXREG_LAST_LENGTH                     0x00000001

#define _U3TXREG_TXREG0_POSITION                 0x00000000
#define _U3TXREG_TXREG0_MASK                     0x00000001
#define _U3TXREG_TXREG0_LENGTH                   0x00000001

#define _U3TXREG_TXREG1_POSITION                 0x00000001
#define _U3TXREG_TXREG1_MASK                     0x00000002
#define _U3TXREG_TXREG1_LENGTH                   0x00000001

#define _U3TXREG_TXREG2_POSITION                 0x00000002
#define _U3TXREG_TXREG2_MASK                     0x00000004
#define _U3TXREG_TXREG2_LENGTH                   0x00000001

#define _U3TXREG_TXREG3_POSITION                 0x00000003
#define _U3TXREG_TXREG3_MASK                     0x00000008
#define _U3TXREG_TXREG3_LENGTH                   0x00000001

#define _U3TXREG_TXREG4_POSITION                 0x00000004
#define _U3TXREG_TXREG4_MASK                     0x00000010
#define _U3TXREG_TXREG4_LENGTH                   0x00000001

#define _U3TXREG_TXREG5_POSITION                 0x00000005
#define _U3TXREG_TXREG5_MASK                     0x00000020
#define _U3TXREG_TXREG5_LENGTH                   0x00000001

#define _U3TXREG_TXREG6_POSITION                 0x00000006
#define _U3TXREG_TXREG6_MASK                     0x00000040
#define _U3TXREG_TXREG6_LENGTH                   0x00000001

#define _U3TXREG_TXREG7_POSITION                 0x00000007
#define _U3TXREG_TXREG7_MASK                     0x00000080
#define _U3TXREG_TXREG7_LENGTH                   0x00000001

#define _U3P1_P1_POSITION                        0x00000000
#define _U3P1_P1_MASK                            0x000001FF
#define _U3P1_P1_LENGTH                          0x00000009

#define _U3P1_P10_POSITION                       0x00000000
#define _U3P1_P10_MASK                           0x00000001
#define _U3P1_P10_LENGTH                         0x00000001

#define _U3P1_P11_POSITION                       0x00000001
#define _U3P1_P11_MASK                           0x00000002
#define _U3P1_P11_LENGTH                         0x00000001

