draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _DCOTUN_STOR_POSITION                    0x00000009
#define _DCOTUN_STOR_MASK                        0x00000200
#define _DCOTUN_STOR_LENGTH                      0x00000001

#define _DCOTUN_STPOL_POSITION                   0x0000000A
#define _DCOTUN_STPOL_MASK                       0x00000400
#define _DCOTUN_STPOL_LENGTH                     0x00000001

#define _DCOTUN_STLOCK_POSITION                  0x0000000B
#define _DCOTUN_STLOCK_MASK                      0x00000800
#define _DCOTUN_STLOCK_LENGTH                    0x00000001

#define _DCOTUN_STSRC_POSITION                   0x0000000C
#define _DCOTUN_STSRC_MASK                       0x00001000
#define _DCOTUN_STSRC_LENGTH                     0x00000001

#define _DCOTUN_STSIDL_POSITION                  0x0000000D
#define _DCOTUN_STSIDL_MASK                      0x00002000
#define _DCOTUN_STSIDL_LENGTH                    0x00000001

#define _DCOTUN_STON_POSITION                    0x0000000F
#define _DCOTUN_STON_MASK                        0x00008000
#define _DCOTUN_STON_LENGTH                      0x00000001

#define _DCOCON_DCOFSEL_POSITION                 0x00000008
#define _DCOCON_DCOFSEL_MASK                     0x00000F00
#define _DCOCON_DCOFSEL_LENGTH                   0x00000004

#define _DCOCON_DCOEN_POSITION                   0x0000000D
#define _DCOCON_DCOEN_MASK                       0x00002000
#define _DCOCON_DCOEN_LENGTH                     0x00000001

#define _PMDCON_PMDLOCK_POSITION                 0x0000000B
#define _PMDCON_PMDLOCK_MASK                     0x00000800
#define _PMDCON_PMDLOCK_LENGTH                   0x00000001

#define _PMD1_ADC1MD_POSITION                    0x00000000
#define _PMD1_ADC1MD_MASK                        0x00000001
#define _PMD1_ADC1MD_LENGTH                      0x00000001

#define _PMD1_SPI1MD_POSITION                    0x00000003
#define _PMD1_SPI1MD_MASK                        0x00000008
#define _PMD1_SPI1MD_LENGTH                      0x00000001

#define _PMD1_SPI2MD_POSITION                    0x00000004
#define _PMD1_SPI2MD_MASK                        0x00000010
#define _PMD1_SPI2MD_LENGTH                      0x00000001

#define _PMD1_U1MD_POSITION                      0x00000005
#define _PMD1_U1MD_MASK                          0x00000020
#define _PMD1_U1MD_LENGTH                        0x00000001

#define _PMD1_U2MD_POSITION                      0x00000006
#define _PMD1_U2MD_MASK                          0x00000040
#define _PMD1_U2MD_LENGTH                        0x00000001

#define _PMD1_I2C1MD_POSITION                    0x00000007
#define _PMD1_I2C1MD_MASK                        0x00000080
#define _PMD1_I2C1MD_LENGTH                      0x00000001

#define _PMD1_PWMMD_POSITION                     0x00000009
#define _PMD1_PWMMD_MASK                         0x00000200
#define _PMD1_PWMMD_LENGTH                       0x00000001

#define _PMD1_QEIMD_POSITION                     0x0000000A
#define _PMD1_QEIMD_MASK                         0x00000400
#define _PMD1_QEIMD_LENGTH                       0x00000001

#define _PMD1_T1MD_POSITION                      0x0000000B
#define _PMD1_T1MD_MASK                          0x00000800
#define _PMD1_T1MD_LENGTH                        0x00000001

#define _PMD2_CCP1MD_POSITION                    0x00000000
#define _PMD2_CCP1MD_MASK                        0x00000001
#define _PMD2_CCP1MD_LENGTH                      0x00000001

#define _PMD2_CCP2MD_POSITION                    0x00000001
#define _PMD2_CCP2MD_MASK                        0x00000002
#define _PMD2_CCP2MD_LENGTH                      0x00000001

#define _PMD2_CCP3MD_POSITION                    0x00000002
#define _PMD2_CCP3MD_MASK                        0x00000004
#define _PMD2_CCP3MD_LENGTH                      0x00000001

#define _PMD2_CCP4MD_POSITION                    0x00000003
#define _PMD2_CCP4MD_MASK                        0x00000008
#define _PMD2_CCP4MD_LENGTH                      0x00000001

#define _PMD2_CCP5MD_POSITION                    0x00000004
#define _PMD2_CCP5MD_MASK                        0x00000010
#define _PMD2_CCP5MD_LENGTH                      0x00000001

#define _PMD2_CCP6MD_POSITION                    0x00000005
#define _PMD2_CCP6MD_MASK                        0x00000020
#define _PMD2_CCP6MD_LENGTH                      0x00000001

#define _PMD2_CCP7MD_POSITION                    0x00000006
#define _PMD2_CCP7MD_MASK                        0x00000040
#define _PMD2_CCP7MD_LENGTH                      0x00000001

#define _PMD2_CCP8MD_POSITION                    0x00000007
#define _PMD2_CCP8MD_MASK                        0x00000080
#define _PMD2_CCP8MD_LENGTH                      0x00000001

#define _PMD2_CCP9MD_POSITION                    0x00000008
#define _PMD2_CCP9MD_MASK                        0x00000100
#define _PMD2_CCP9MD_LENGTH                      0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_I2C3MD_POSITION                    0x00000002
#define _PMD3_I2C3MD_MASK                        0x00000004
#define _PMD3_I2C3MD_LENGTH                      0x00000001

#define _PMD3_U3MD_POSITION                      0x00000003
#define _PMD3_U3MD_MASK                          0x00000008
#define _PMD3_U3MD_LENGTH                        0x00000001

#define _PMD3_QEI2MD_POSITION                    0x00000005
#define _PMD3_QEI2MD_MASK                        0x00000020
#define _PMD3_QEI2MD_LENGTH                      0x00000001

#define _PMD3_CRCMD_POSITION                     0x00000007
#define _PMD3_CRCMD_MASK                         0x00000080
#define _PMD3_CRCMD_LENGTH                       0x00000001

#define _PMD3_PMPMD_POSITION                     0x00000008
#define _PMD3_PMPMD_MASK                         0x00000100
#define _PMD3_PMPMD_LENGTH                       0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

