draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define _PMD6_DMA0MD_POSITION                    0x00000008
#define _PMD6_DMA0MD_MASK                        0x00000100
#define _PMD6_DMA0MD_LENGTH                      0x00000001

#define _PMD6_DMA1MD_POSITION                    0x00000009
#define _PMD6_DMA1MD_MASK                        0x00000200
#define _PMD6_DMA1MD_LENGTH                      0x00000001

#define _PMD6_DMA2MD_POSITION                    0x0000000A
#define _PMD6_DMA2MD_MASK                        0x00000400
#define _PMD6_DMA2MD_LENGTH                      0x00000001

#define _PMD6_DMA3MD_POSITION                    0x0000000B
#define _PMD6_DMA3MD_MASK                        0x00000800
#define _PMD6_DMA3MD_LENGTH                      0x00000001

#define _PMD7_PTGMD_POSITION                     0x00000003
#define _PMD7_PTGMD_MASK                         0x00000008
#define _PMD7_PTGMD_LENGTH                       0x00000001

#define _PMD7_CMP1MD_POSITION                    0x00000008
#define _PMD7_CMP1MD_MASK                        0x00000100
#define _PMD7_CMP1MD_LENGTH                      0x00000001

#define _PMD7_CMP2MD_POSITION                    0x00000009
#define _PMD7_CMP2MD_MASK                        0x00000200
#define _PMD7_CMP2MD_LENGTH                      0x00000001

#define _PMD7_CMP3MD_POSITION                    0x0000000A
#define _PMD7_CMP3MD_MASK                        0x00000400
#define _PMD7_CMP3MD_LENGTH                      0x00000001

#define _PMD8_BIASMD_POSITION                    0x00000001
#define _PMD8_BIASMD_MASK                        0x00000002
#define _PMD8_BIASMD_LENGTH                      0x00000001

#define _PMD8_CLC1MD_POSITION                    0x00000002
#define _PMD8_CLC1MD_MASK                        0x00000004
#define _PMD8_CLC1MD_LENGTH                      0x00000001

#define _PMD8_CLC2MD_POSITION                    0x00000003
#define _PMD8_CLC2MD_MASK                        0x00000008
#define _PMD8_CLC2MD_LENGTH                      0x00000001

#define _PMD8_CLC3MD_POSITION                    0x00000004
#define _PMD8_CLC3MD_MASK                        0x00000010
#define _PMD8_CLC3MD_LENGTH                      0x00000001

#define _PMD8_CLC4MD_POSITION                    0x00000005
#define _PMD8_CLC4MD_MASK                        0x00000020
#define _PMD8_CLC4MD_LENGTH                      0x00000001

#define _PMD8_DMTMD_POSITION                     0x00000008
#define _PMD8_DMTMD_MASK                         0x00000100
#define _PMD8_DMTMD_LENGTH                       0x00000001

#define _PMD8_SENT1MD_POSITION                   0x0000000B
#define _PMD8_SENT1MD_MASK                       0x00000800
#define _PMD8_SENT1MD_LENGTH                     0x00000001

#define _PMD8_SENT2MD_POSITION                   0x0000000C
#define _PMD8_SENT2MD_MASK                       0x00001000
#define _PMD8_SENT2MD_LENGTH                     0x00000001

#define _PMD8_OPAMPMD_POSITION                   0x0000000D
#define _PMD8_OPAMPMD_MASK                       0x00002000
#define _PMD8_OPAMPMD_LENGTH                     0x00000001

#define _WDTCONL_WDTWINEN_POSITION               0x00000000
#define _WDTCONL_WDTWINEN_MASK                   0x00000001
#define _WDTCONL_WDTWINEN_LENGTH                 0x00000001

#define _WDTCONL_SLPDIV_POSITION                 0x00000001
#define _WDTCONL_SLPDIV_MASK                     0x0000003E
#define _WDTCONL_SLPDIV_LENGTH                   0x00000005

#define _WDTCONL_CLKSEL_POSITION                 0x00000006
#define _WDTCONL_CLKSEL_MASK                     0x000000C0
#define _WDTCONL_CLKSEL_LENGTH                   0x00000002

#define _WDTCONL_RUNDIV_POSITION                 0x00000008
#define _WDTCONL_RUNDIV_MASK                     0x00001F00
#define _WDTCONL_RUNDIV_LENGTH                   0x00000005

#define _WDTCONL_ON_POSITION                     0x0000000F
#define _WDTCONL_ON_MASK                         0x00008000
#define _WDTCONL_ON_LENGTH                       0x00000001

#define _REFOCON1_ROSEL_POSITION                 0x00000000
#define _REFOCON1_ROSEL_MASK                     0x0000000F
#define _REFOCON1_ROSEL_LENGTH                   0x00000004

#define _REFOCON1_ROACTIVE_POSITION              0x00000008
#define _REFOCON1_ROACTIVE_MASK                  0x00000100
#define _REFOCON1_ROACTIVE_LENGTH                0x00000001

#define _REFOCON1_ROSWEN_POSITION                0x00000009
#define _REFOCON1_ROSWEN_MASK                    0x00000200
#define _REFOCON1_ROSWEN_LENGTH                  0x00000001

#define _REFOCON1_ROSLP_POSITION                 0x0000000B
#define _REFOCON1_ROSLP_MASK                     0x00000800
#define _REFOCON1_ROSLP_LENGTH                   0x00000001

#define _REFOCON1_ROOUT_POSITION                 0x0000000C
#define _REFOCON1_ROOUT_MASK                     0x00001000
#define _REFOCON1_ROOUT_LENGTH                   0x00000001

#define _REFOCON1_ROSIDL_POSITION                0x0000000D
#define _REFOCON1_ROSIDL_MASK                    0x00002000
#define _REFOCON1_ROSIDL_LENGTH                  0x00000001

#define _REFOCON1_ROEN_POSITION                  0x0000000F
#define _REFOCON1_ROEN_MASK                      0x00008000
#define _REFOCON1_ROEN_LENGTH                    0x00000001

#define _REFOCON1_ROSEL0_POSITION                0x00000000
#define _REFOCON1_ROSEL0_MASK                    0x00000001
#define _REFOCON1_ROSEL0_LENGTH                  0x00000001

#define _REFOCON1_ROSEL1_POSITION                0x00000001
#define _REFOCON1_ROSEL1_MASK                    0x00000002
#define _REFOCON1_ROSEL1_LENGTH                  0x00000001

#define _REFOCON1_ROSEL2_POSITION                0x00000002
#define _REFOCON1_ROSEL2_MASK                    0x00000004
#define _REFOCON1_ROSEL2_LENGTH                  0x00000001

#define _REFOCON1_ROSEL3_POSITION                0x00000003
#define _REFOCON1_ROSEL3_MASK                    0x00000008
#define _REFOCON1_ROSEL3_LENGTH                  0x00000001

#define _REFOCONL_ROSEL_POSITION                 0x00000000
#define _REFOCONL_ROSEL_MASK                     0x0000000F
#define _REFOCONL_ROSEL_LENGTH                   0x00000004

#define _REFOCONL_ROACTIVE_POSITION              0x00000008
#define _REFOCONL_ROACTIVE_MASK                  0x00000100
#define _REFOCONL_ROACTIVE_LENGTH                0x00000001

