draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
#define BSS_HIGH             0x8FE9
#define BSS_STNDRD           0x8FED
#define BSS_DISABLED         0x8FEF

#define BSEN_ON              0x8FE7
#define BSEN_OFF             0x8FEF

#define GWRP_ON              0x8FCF
#define GWRP_OFF             0x8FEF

#define GSS_HIGH             0x8F2F
#define GSS_STNDRD           0x8FAF
#define GSS_DISABLED         0x8FEF

#define CWRP_ON              0x8EEF
#define CWRP_OFF             0x8FEF

#define CSS_HIGH             0x81EF
#define CSS_ENHNCD           0x89EF
#define CSS_STNDRD           0x8DEF
#define CSS_DISABLED         0x8FEF

#define AIVTDIS_ON           0x0FEF
#define AIVTDIS_OFF          0x8FEF

/* Register FBSLIM (0x2bf10)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBSLIM;
#define _FBSLIM(x) __attribute__((address(0x2bf10),deprecated_definition("consider migrating to #pragma config"),section("__FBSLIM.sec"),space(prog))) __prog__ uint16_t _FBSLIM = (x);

/*
** Only one invocation of FBSLIM should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBSLIM.
** Multiple options may be combined, as shown:
**
** _FBSLIM( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Flash Page Address Limit bits:
**     BSLIM_BSLIM          Boot Segment Flash page address  limit
**
*/

#define BSLIM_BSLIM          0x0000

/* Register FSIGN (0x2bf14)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSIGN;
#define _FSIGN(x) __attribute__((address(0x2bf14),deprecated_definition("consider migrating to #pragma config"),section("__FSIGN.sec"),space(prog))) __prog__ uint16_t _FSIGN = (x);

/*
** Only one invocation of FSIGN should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSIGN.
** Multiple options may be combined, as shown:
**
** _FSIGN( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register FOSCSEL (0x2bf18)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0x2bf18),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Source Selection:
**     FNOSC_FRC            Internal Fast RC (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with divide-by-N with PLL module (FRCPLL) 
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XT + PLL, HS + PLL, EC + PLL)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_BFRC           Back up Fast RC (BFRC) Oscillator
**     FNOSC_FRCDIVN        Internal Fast RC (FRC) Oscillator with postscaler
**
**   Two-speed Oscillator Start-up Enable bit:
**     IESO_OFF             Start up with user-selected oscillator source
**     IESO_ON              Start up device with FRC, then switch to user-selected oscillator source
**
*/

#define FNOSC_FRC            0x0080
#define FNOSC_FRCPLL         0x0081
#define FNOSC_PRI            0x0082
#define FNOSC_PRIPLL         0x0083
#define FNOSC_LPRC           0x0085
#define FNOSC_BFRC           0x0086
#define FNOSC_FRCDIVN        0x0087

#define IESO_OFF             0x0007
#define IESO_ON              0x0087

/* Register FOSC (0x2bf1c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0x2bf1c),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Mode Select bits:
**     POSCMD_EC            EC (External Clock) Mode
**     POSCMD_XT            XT Crystal Oscillator Mode
**     POSCMD_HS            HS Crystal Oscillator Mode
**     POSCMD_NONE          Primary Oscillator disabled
**
**   OSC2 Pin Function bit:
**     OSCIOFNC_ON          OSC2 is general purpose digital I/O pin
**     OSCIOFNC_OFF         OSC2 is clock output
**
**   Clock Switching Mode bits:
**     FCKSM_CSECME         Both Clock switching and Fail-safe Clock Monitor are enabled
**     FCKSM_CSECMD         Clock switching is enabled,Fail-safe Clock Monitor is disabled
**     FCKSM_CSDCMD         Both Clock switching and Fail-safe Clock Monitor are disabled
**
**   PLL Lock Status Control:
**     PLLKEN_OFF           PLL lock signal is not used; the PLL clock output will not be disabled if lock is lost
**     PLLKEN_ON            PLL lock signal will be used to disable PLL clock output if lock is lost
**
**   XT Config:
**     XTCFG_G0             4-8 MHz crystals
**     XTCFG_G1             8-16 MHz crystals
**     XTCFG_G2             16-24 MHz crystals
**     XTCFG_G3             24-32 MHz crystals
**
**   XT Boost:
**     XTBST_DISABLE        Default kick-start
**     XTBST_ENABLE         Boost the kick-start
**
*/

#define POSCMD_EC            0x1DC4
#define POSCMD_XT            0x1DC5
#define POSCMD_HS            0x1DC6
#define POSCMD_NONE          0x1DC7

#define OSCIOFNC_ON          0x1DC3
#define OSCIOFNC_OFF         0x1DC7

#define FCKSM_CSECME         0x1D07
#define FCKSM_CSECMD         0x1D47
#define FCKSM_CSDCMD         0x1D87

#define PLLKEN_OFF           0x1CC7
#define PLLKEN_ON            0x1DC7

#define XTCFG_G0             0x11C7
#define XTCFG_G1             0x15C7
#define XTCFG_G2             0x19C7
#define XTCFG_G3             0x1DC7

#define XTBST_DISABLE        0x0DC7
#define XTBST_ENABLE         0x1DC7

/* Register FWDT (0x2bf20)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0x2bf20),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

