draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Run Mode Watchdog Timer Post Scaler select bits:
**     RWDTPS_PS1           1:1
**     RWDTPS_PS2           1:2
**     RWDTPS_PS4           1:4
**     RWDTPS_PS8           1:8
**     RWDTPS_PS16          1:16
**     RWDTPS_PS32          1:32
**     RWDTPS_PS64          1:64
**     RWDTPS_PS128         1:128
**     RWDTPS_PS256         1:256
**     RWDTPS_PS512         1:512
**     RWDTPS_PS1024        1:1024
**     RWDTPS_PS2048        1:2048
**     RWDTPS_PS4096        1:4096
**     RWDTPS_PS8192        1:8192
**     RWDTPS_PS16384       1:16384
**     RWDTPS_PS32768       1:32768
**     RWDTPS_PS65536       1:65536
**     RWDTPS_PS131072      1:131072
**     RWDTPS_PS262144      1:262144
**     RWDTPS_PS524288      1:524288
**     RWDTPS_PS1048576     1:1048576
**     RWDTPS_PS2097152     1:2097152
**     RWDTPS_PS4194304     1:4194304
**     RWDTPS_PS8388608     1:8388608
**     RWDTPS_PS16777216    1:16777216
**     RWDTPS_PS33554432    1:33554432
**     RWDTPS_PS67108864    1:67108864
**     RWDTPS_PS134217728   1:134217728
**     RWDTPS_PS268435456   1:268435456
**     RWDTPS_PS536870912   1:536870912
**     RWDTPS_PS1073741824  1:1073741824
**     RWDTPS_PS2147483648  1:2147483648
**
**   Watchdog Timer Clock Select bits:
**     RCLKSEL_FCY          Use peripheral clk when system clock is not INTOSC/LPRC and device is not in Sleep;otherwise, use INTOSC/LPRC
**     RCLKSEL_FRC          Use FRC when WINDIS = 0, system clock is not INTOSC/LPRC and device is not in Sleep;otherwise, use INTOSC/LPRC
**     RCLKSEL_LPRC         Always use LPRC
**
**   Watchdog Timer Window Enable bit:
**     WINDIS_OFF           Watchdog Timer operates in Window mode
**     WINDIS_ON            Watchdog Timer operates in Non-Window mode
**
**   Watchdog Timer Window Select bits:
**     WDTWIN_WIN75         WDT Windo is 75% of WDT period
**     WDTWIN_WIN50         WDT Window is 50% of WDT period
**     WDTWIN_WIN37         WDT Window is 37.5% of WDT period
**     WDTWIN_WIN25         WDT Window is 25% of WDT period
**
**   Sleep Mode Watchdog Timer Post Scaler select bits:
**     SWDTPS_PS1           1:1
**     SWDTPS_PS2           1:2
**     SWDTPS_PS4           1:4
**     SWDTPS_PS8           1:8
**     SWDTPS_PS16          1:16
**     SWDTPS_PS32          1:32
**     SWDTPS_PS64          1:64
**     SWDTPS_PS128         1:128
**     SWDTPS_PS256         1:256
**     SWDTPS_PS512         1:512
**     SWDTPS_PS1024        1:1024
**     SWDTPS_PS2048        1:2048
**     SWDTPS_PS4096        1:4096
**     SWDTPS_PS8192        1:8192
**     SWDTPS_PS16384       1:16384
**     SWDTPS_PS32768       1:32768
**     SWDTPS_PS65536       1:65536
**     SWDTPS_PS131072      1:131072
**     SWDTPS_PS262144      1:262144
**     SWDTPS_PS524288      1:524288
**     SWDTPS_PS1048576     1:1048576
**     SWDTPS_PS2097152     1:2097152
**     SWDTPS_PS4194304     1:4194304
**     SWDTPS_PS8388608     1:8388608
**     SWDTPS_PS16777216    1:16777216
**     SWDTPS_PS33554432    1:33554432
**     SWDTPS_PS67108864    1:67108864
**     SWDTPS_PS134217728   1:134217728
**     SWDTPS_PS268435456   1:268435456
**     SWDTPS_PS536870912   1:536870912
**     SWDTPS_PS1073741824  1:1073741824
**     SWDTPS_PS2147483648  1:2147483648
**
**   Watchdog Timer Enable bit:
**     FWDTEN_ON_SW         WDT controlled via SW, use WDTCON.ON bit
**     FWDTEN_ON            WDT enabled in hardware
**
*/

#define RWDTPS_PS1           0xFFE0
#define RWDTPS_PS2           0xFFE1
#define RWDTPS_PS4           0xFFE2
#define RWDTPS_PS8           0xFFE3
#define RWDTPS_PS16          0xFFE4
#define RWDTPS_PS32          0xFFE5
#define RWDTPS_PS64          0xFFE6
#define RWDTPS_PS128         0xFFE7
#define RWDTPS_PS256         0xFFE8
#define RWDTPS_PS512         0xFFE9
#define RWDTPS_PS1024        0xFFEA
#define RWDTPS_PS2048        0xFFEB
#define RWDTPS_PS4096        0xFFEC
#define RWDTPS_PS8192        0xFFED
#define RWDTPS_PS16384       0xFFEE
#define RWDTPS_PS32768       0xFFEF
#define RWDTPS_PS65536       0xFFF0
#define RWDTPS_PS131072      0xFFF1
#define RWDTPS_PS262144      0xFFF2
#define RWDTPS_PS524288      0xFFF3
#define RWDTPS_PS1048576     0xFFF4
#define RWDTPS_PS2097152     0xFFF5
#define RWDTPS_PS4194304     0xFFF6
#define RWDTPS_PS8388608     0xFFF7
#define RWDTPS_PS16777216    0xFFF8
#define RWDTPS_PS33554432    0xFFF9
#define RWDTPS_PS67108864    0xFFFA
#define RWDTPS_PS134217728   0xFFFB
#define RWDTPS_PS268435456   0xFFFC
#define RWDTPS_PS536870912   0xFFFD
#define RWDTPS_PS1073741824  0xFFFE
#define RWDTPS_PS2147483648  0xFFFF

#define RCLKSEL_FCY          0xFFBF
#define RCLKSEL_FRC          0xFFDF
#define RCLKSEL_LPRC         0xFFFF

#define WINDIS_OFF           0xFF7F
#define WINDIS_ON            0xFFFF

#define WDTWIN_WIN75         0xFCFF
#define WDTWIN_WIN50         0xFDFF
#define WDTWIN_WIN37         0xFEFF
#define WDTWIN_WIN25         0xFFFF

#define SWDTPS_PS1           0x83FF
#define SWDTPS_PS2           0x87FF
#define SWDTPS_PS4           0x8BFF
#define SWDTPS_PS8           0x8FFF
#define SWDTPS_PS16          0x93FF
#define SWDTPS_PS32          0x97FF
#define SWDTPS_PS64          0x9BFF
#define SWDTPS_PS128         0x9FFF
#define SWDTPS_PS256         0xA3FF
#define SWDTPS_PS512         0xA7FF
#define SWDTPS_PS1024        0xABFF
#define SWDTPS_PS2048        0xAFFF
#define SWDTPS_PS4096        0xB3FF
#define SWDTPS_PS8192        0xB7FF
#define SWDTPS_PS16384       0xBBFF
#define SWDTPS_PS32768       0xBFFF
#define SWDTPS_PS65536       0xC3FF
#define SWDTPS_PS131072      0xC7FF
#define SWDTPS_PS262144      0xCBFF
#define SWDTPS_PS524288      0xCFFF
#define SWDTPS_PS1048576     0xD3FF
#define SWDTPS_PS2097152     0xD7FF
#define SWDTPS_PS4194304     0xDBFF
#define SWDTPS_PS8388608     0xDFFF
#define SWDTPS_PS16777216    0xE3FF
#define SWDTPS_PS33554432    0xE7FF
#define SWDTPS_PS67108864    0xEBFF
#define SWDTPS_PS134217728   0xEFFF
#define SWDTPS_PS268435456   0xF3FF
#define SWDTPS_PS536870912   0xF7FF
#define SWDTPS_PS1073741824  0xFBFF
#define SWDTPS_PS2147483648  0xFFFF

#define FWDTEN_ON_SW         0x7FFF
#define FWDTEN_ON            0xFFFF

/* Register FPOR (0x2bf24)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0x2bf24),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

