draco-sam/WPT_drone/WPT/TX/TX_SPI/TX_SPI.X/p33CK256MP206.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Memory BIST Feature Disable:
**     BISTDIS_ENABLED      mBIST on reset feature enabled
**     BISTDIS_DISABLED     mBIST on reset feature disabled
**
*/

#define BISTDIS_ENABLED      0x0000
#define BISTDIS_DISABLED     0x0040

/* Register FICD (0x2bf28)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x2bf28),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGC3 and PGD3
**     ICS_PGD2             Communicate on PGC2 and PGD2
**     ICS_PGD1             Communicate on PGC1 and PGD1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
**   BOOTSWP instruction disable bit:
**     NOBTSWP_ENABLED      BOOTSWP instruction is enabled
**     NOBTSWP_DISABLED     BOOTSWP instruction is disabled
**
*/

#define ICS_NONE             0x80A0
#define ICS_PGD3             0x80A1
#define ICS_PGD2             0x80A2
#define ICS_PGD1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define NOBTSWP_ENABLED      0x00A3
#define NOBTSWP_DISABLED     0x80A3

/* Register FDMTIVTL (0x2bf2c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTIVTL;
#define _FDMTIVTL(x) __attribute__((address(0x2bf2c),deprecated_definition("consider migrating to #pragma config"),section("__FDMTIVTL.sec"),space(prog))) __prog__ uint16_t _FDMTIVTL = (x);

/*
** Only one invocation of FDMTIVTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTIVTL.
** Multiple options may be combined, as shown:
**
** _FDMTIVTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Interval low word:
**     DMTIVTL_DMTIVTL      Lower 16 bits of 32 bitDMT window interval (0-0xFFFF)
**
*/

#define DMTIVTL_DMTIVTL      0x0000

/* Register FDMTIVTH (0x2bf30)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTIVTH;
#define _FDMTIVTH(x) __attribute__((address(0x2bf30),deprecated_definition("consider migrating to #pragma config"),section("__FDMTIVTH.sec"),space(prog))) __prog__ uint16_t _FDMTIVTH = (x);

/*
** Only one invocation of FDMTIVTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTIVTH.
** Multiple options may be combined, as shown:
**
** _FDMTIVTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Interval high word:
**     DMTIVTH_DMTIVTH      Uper 16 bits of 32 bitDMT window interval (0-0xFFFF)
**
*/

#define DMTIVTH_DMTIVTH      0x0000

/* Register FDMTCNTL (0x2bf34)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTL;
#define _FDMTCNTL(x) __attribute__((address(0x2bf34),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTL.sec"),space(prog))) __prog__ uint16_t _FDMTCNTL = (x);

/*
** Only one invocation of FDMTCNTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTL.
** Multiple options may be combined, as shown:
**
** _FDMTCNTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF):
**     DMTCNTL_DMTCNTL      Lower 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTL_DMTCNTL      0x0000

/* Register FDMTCNTH (0x2bf38)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTH;
#define _FDMTCNTH(x) __attribute__((address(0x2bf38),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTH.sec"),space(prog))) __prog__ uint16_t _FDMTCNTH = (x);

/*
** Only one invocation of FDMTCNTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTH.
** Multiple options may be combined, as shown:
**
** _FDMTCNTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF):
**     DMTCNTH_DMTCNTH      Upper 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTH_DMTCNTH      0x0000

/* Register FDMT (0x2bf3c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMT;
#define _FDMT(x) __attribute__((address(0x2bf3c),deprecated_definition("consider migrating to #pragma config"),section("__FDMT.sec"),space(prog))) __prog__ uint16_t _FDMT = (x);

/*
** Only one invocation of FDMT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMT.
** Multiple options may be combined, as shown:
**
** _FDMT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Disable bit:
**     DMTDIS_ON            Dead Man Timer is Enabled and cannot be disabled by software
**     DMTDIS_OFF           Dead Man Timer is Disabled and can be enabled by software
**
*/

#define DMTDIS_ON            0x0000
#define DMTDIS_OFF           0x0001

/* Register FDEVOPT (0x2bf40)                               */

